
// Функция block_api3_outgoing_payment_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Соответствие - Результат выполения функции
//
//DynamicDirective
Функция block_api3_outgoing_payment_calc_value(block_type, node, path, context, block_context)
	Ссылки = Новый Массив;
	Ссылки.Добавить(ОписаниеПоляСсылки("НашаОрганизация"));
	Ссылки.Добавить(ОписаниеПоляСсылки("Контрагент"));
	Ссылки.Добавить(ОписаниеПоляСсылки("СчетКонтрагента", "РасчетныйСчет"));
	Ссылки.Добавить(ОписаниеПоляСсылки("НашРасчетныйСчет"));
	Ссылки.Добавить(ОписаниеПоляСсылки("Договор"));
	Ссылки.Добавить(ОписаниеПоляСсылки("СтавкаНДС"));
	Даты = Новый Массив;
	Даты.Добавить(ОписаниеПоляДаты("Дата"));
	РеквизитыТребующиеКонвертации = Новый Структура("Ссылки, Даты", Ссылки, Даты);
	Возврат ЗаполнитьЗначенияApi3Objects("Документы", "ИсходящийПлатеж",  block_context, РеквизитыТребующиеКонвертации);
КонецФункции
