
// Функция block_api3_leave_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Соответствие - Результат выполения функции
//
//DynamicDirective
Функция block_api3_leave_calc_value(block_type, node, path, context, block_context)
	Ссылки = Новый Массив;
	Ссылки.Добавить(ОписаниеПоляСсылки("НашаОрганизация"));
	Ссылки.Добавить(ОписаниеПоляСсылки("Ответственный", "ЧастноеЛицо"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ЧастноеЛицо"));
	Ссылки.Добавить(ОписаниеПоляСсылки("СчетУчетаКонтрагент", "ПоказательУчета"));
	Ссылки.Добавить(ОписаниеПоляСсылки("СчетУчетаАванс", "ПоказательУчета"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ВидОтпуска"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ВидОтпускаКолДоговор", "ВидОтпускаДополнительный"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ОтзываемыйОтпуск", "Отпуск"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ПричинаОтзыва", "ПричинаОтзываИзОтпуска"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ДокументОснованиеОтзыва", "Больничный"));
	Ссылки.Добавить(ОписаниеПоляСсылки("Руководитель", "ЧастноеЛицо"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ДолжностьРуководителя", "Должность"));
	Ссылки.Добавить(ОписаниеПоляСсылки("Автор", "ЧастноеЛицо"));
	Даты = Новый Массив;
	Даты.Добавить(ОписаниеПоляДаты("Дата"));
	Даты.Добавить(ОписаниеПоляДаты("ДатаРасчета"));
	Даты.Добавить(ОписаниеПоляДаты("ДатаНач"));
	Даты.Добавить(ОписаниеПоляДаты("ДатаКнц"));
	РеквизитыТребующиеКонвертации = Новый Структура("Ссылки, Даты", Ссылки, Даты);
	Возврат ЗаполнитьЗначенияApi3Objects("Документы", "Отпуск",  block_context, РеквизитыТребующиеКонвертации);
КонецФункции
