
// Функция block_api3_maternityleavereturn_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Соответствие - Результат выполения функции
//
//DynamicDirective
Функция block_api3_maternityleavereturn_calc_value(block_type, node, path, context, block_context)
	Ссылки = Новый Массив;
	Ссылки.Добавить(ОписаниеПоляСсылки("НашаОрганизация"));
	Ссылки.Добавить(ОписаниеПоляСсылки("Валюта"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ЧастноеЛицо"));
	Ссылки.Добавить(ОписаниеПоляСсылки("Ответственный", "ЧастноеЛицо"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ДокументОснование", "ОтпускПоУходу"));
	Даты = Новый Массив;
	Даты.Добавить(ОписаниеПоляДаты("Дата"));
	Даты.Добавить(ОписаниеПоляДаты("ДатаВозврата"));
	Даты.Добавить(ОписаниеПоляДаты("ДатаПриказа"));
	РеквизитыТребующиеКонвертации = Новый Структура("Ссылки, Даты", Ссылки, Даты);
	Возврат ЗаполнитьЗначенияApi3Objects("Документы", "ОтпускПоУходуВозврат",  block_context, РеквизитыТребующиеКонвертации);
КонецФункции
