
// Функция block_api3_link_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Соответствие - Результат выполения функции
//
//DynamicDirective
Функция block_api3_link_calc_value(block_type, node, path, context, block_context)
	param = Новый Структура();
	Для Каждого ПараметрБлока Из block_context Цикл 
		Если Лев(ПараметрБлока.Ключ, 2) <> "__" Тогда 
			param.Вставить(ПараметрБлока.Ключ, ПараметрБлока.Значение)
		КонецЕсли;	
	КонецЦикла;	
	Возврат param;
КонецФункции
