
// Функция block_api3_accountingsettings_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Соответствие - Результат выполнения функции
//
//DynamicDirective
Функция block_api3_accountingsettings_calc_value(block_type, node, path, context, block_context)
	Ссылки = Новый Массив;
	Ссылки.Добавить(ОписаниеПоляСсылки("НашаОрганизация"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ПорядокРегистрацииФактурНаАванс"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ПорядокУплатыАвансовыхПлатежей"));
	Ссылки.Добавить(ОписаниеПоляСсылки("РасчетСебестоимости", "СпособРасчетаСебестоимости"));
	Ссылки.Добавить(ОписаниеПоляСсылки("СчетЗатрат", "ПоказательУчета"));
	Даты = Новый Массив;
	Даты.Добавить(ОписаниеПоляДаты("ДействуетС"));
	РеквизитыТребующиеКонвертации  = Новый Структура("Ссылки, Даты", Ссылки, Даты);
	Возврат ЗаполнитьЗначенияApi3Objects(Неопределено, "НастройкиБУиНУ", block_context, РеквизитыТребующиеКонвертации);
КонецФункции
