
// Функция block_api3_staffingtable_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Соответствие - Результат выполения функции
//
//DynamicDirective
Функция block_api3_staffingtable_calc_value(block_type, node, path, context, block_context)
	Ссылки = Новый Массив;
	Ссылки.Добавить(ОписаниеПоляСсылки("Должность"));
	Ссылки.Добавить(ОписаниеПоляСсылки("НашаОрганизация"));
	Ссылки.Добавить(ОписаниеПоляСсылки("РабочаяГруппа", "СтруктураПредприятия"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ГрафикРаботы", "ГрафикРабочегоВремени"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ТрудоваяФункция"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ДосрочнаяПенсия", "ОснованиеДосрочнойПенсии"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ЛьготнаяПенсия", "ОснованиеЛьготнойПенсии"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ОсобыеУсловияТруда"));
	Ссылки.Добавить(ОписаниеПоляСсылки("КлассУсловийТруда"));
	Даты = Новый Массив;
	Даты.Добавить(ОписаниеПоляДаты("ДатаОткрытия"));
	Даты.Добавить(ОписаниеПоляДаты("ДатаЗакрытия"));
	Даты.Добавить(ОписаниеПоляДаты("КлассУсловийТрудаДействуетС"));
	РеквизитыТребующиеКонвертации = Новый Структура("Ссылки, Даты", Ссылки, Даты);
	Возврат ЗаполнитьЗначенияApi3Objects("Справочники", "ШтатноеРасписание",  block_context, РеквизитыТребующиеКонвертации);
КонецФункции
