
// Функция block_api3_hiring_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Соответствие - Результат выполения функции
//
//DynamicDirective
Функция block_api3_hiring_calc_value(block_type, node, path, context, block_context)
	Ссылки = Новый Массив;
	Ссылки.Добавить(ОписаниеПоляСсылки("НашаОрганизация"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ЧастноеЛицо"));
	Ссылки.Добавить(ОписаниеПоляСсылки("Сотрудник"));
	Ссылки.Добавить(ОписаниеПоляСсылки("РабочаяГруппа", "СтруктураПредприятия"));
	Ссылки.Добавить(ОписаниеПоляСсылки("Должность"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ВидЗанятости"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ГрафикРаботы", "ГрафикРабочегоВремени"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ОснованиеСрочногоТрудовогоДоговора"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ТерриториальныеУсловия"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ШтатноеРасписание"));
	Даты = Новый Массив;
	Даты.Добавить(ОписаниеПоляДаты("Дата"));
	Даты.Добавить(ОписаниеПоляДаты("ДатаПриема"));
	Даты.Добавить(ОписаниеПоляДаты("ДатаКнц"));
	Даты.Добавить(ОписаниеПоляДаты("ТрудовойДоговорДата"));
	Даты.Добавить(ОписаниеПоляДаты("ТрудовойДоговорСрок"));
	РеквизитыТребующиеКонвертации = Новый Структура("Ссылки, Даты", Ссылки, Даты);
	Возврат ЗаполнитьЗначенияApi3Objects("Документы", "ПриемНаРаботу",  block_context, РеквизитыТребующиеКонвертации);
КонецФункции
