
// Функция block_api3_vatinvoice_incoming_calc_value
//
// Параметры:
//   block_type - Строка - имя API3 блока.
//   node - ЭлементDOM - блок Blockly
//   path - Строка - Выполняемое действие функции.
//   context - Структура - Параметры инишки.
//   block_context - Структура - Параметры блока.
//
// Возвращаемое значение:
//   Соответствие - API3 объект.
//
//DynamicDirective
Функция block_api3_vatinvoice_incoming_calc_value(block_type, node, path, context, block_context)
	Ссылки = Новый Массив;
	Ссылки.Добавить(ОписаниеПоляСсылки("НашаОрганизация"));
	Ссылки.Добавить(ОписаниеПоляСсылки("Ответственный", "ЧастноеЛицо"));
	Ссылки.Добавить(ОписаниеПоляСсылки("Контрагент"));
	Даты = Новый Массив;
	Даты.Добавить(ОписаниеПоляДаты("Дата"));
	РеквизитыТребующиеКонвертации = Новый Структура("Ссылки, Даты", Ссылки, Даты);
	Возврат ЗаполнитьЗначенияApi3Objects("Документы", "СчетФактураПолученный", block_context, РеквизитыТребующиеКонвертации);
КонецФункции
