
// Функция block_api3_salarydeductions_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Соответствие - Результат выполнения функции
//
//DynamicDirective
Функция block_api3_salarydeductions_calc_value(block_type, node, path, context, block_context)
	Ссылки = Новый Массив;
	Ссылки.Добавить(ОписаниеПоляСсылки("НашаОрганизация"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ВидНачисленияУдержания"));
	Ссылки.Добавить(ОписаниеПоляСсылки("СпособВыплатыУдержания"));
	Даты = Новый Массив;
	Даты.Добавить(ОписаниеПоляДаты("Дата"));
	Даты.Добавить(ОписаниеПоляДаты("ДатаНач"));
	Даты.Добавить(ОписаниеПоляДаты("ДатаКнц"));
	Даты.Добавить(ОписаниеПоляДаты("ДатаРасчета"));
	РеквизитыТребующиеКонвертации  = Новый Структура("Ссылки, Даты", Ссылки, Даты);
	Возврат ЗаполнитьЗначенияApi3Objects("Документы", "УдержаниеПоЗарплате", block_context, РеквизитыТребующиеКонвертации);
КонецФункции
