
// Функция block_api3_department_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Соответствие - Результат выполения функции
//
//DynamicDirective
Функция block_api3_department_calc_value(block_type, node, path, context, block_context)
	Ссылки = Новый Массив;
	Ссылки.Добавить(ОписаниеПоляСсылки("НашаОрганизация"));
	Ссылки.Добавить(ОписаниеПоляСсылки("Родитель", "СтруктураПредприятия"));
	Ссылки.Добавить(ОписаниеПоляСсылки("Руководитель", "ЧастноеЛицо"));
	РеквизитыТребующиеКонвертации = Новый Структура("Ссылки", Ссылки);
	Возврат ЗаполнитьЗначенияApi3Objects("Справочники", "СтруктураПредприятия",  block_context, РеквизитыТребующиеКонвертации);
КонецФункции


// Функция block_api3_department_localization_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Соответствие - Результат выполения функции
//
//DynamicDirective
Функция block_api3_department_localization_calc_value(block_type, node, path, context, block_context)
	Возврат ЗаполнитьЗначенияApi3Objects(неопределено, неопределено,  block_context);
КонецФункции
