
// Функция block_api3_salarypayment_payments_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Соответствие - Результат выполнения функции
//
//DynamicDirective
Функция block_api3_salarypayment_payments_calc_value(block_type, node, path, context, block_context)
	Ссылки = Новый Массив;
	Ссылки.Добавить(ОписаниеПоляСсылки("ЛицевойСчет"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ЧастноеЛицо"));
	РеквизитыТребующиеКонвертации  = Новый Структура("Ссылки", Ссылки);
	Возврат ЗаполнитьЗначенияApi3Objects(Неопределено, Неопределено, block_context, РеквизитыТребующиеКонвертации);
КонецФункции
