
// Функция block_api3_reportfts_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Соответствие - Результат выполения функции
//
//DynamicDirective
Функция block_api3_reportfts_calc_value(block_type, node, path, context, block_context)
	Ссылки = Новый Массив;
	Ссылки.Добавить(ОписаниеПоляСсылки("НашаОрганизация"));
	Даты = Новый Массив;
	Даты.Добавить(ОписаниеПоляДаты("Дата", "ДФ=yyyy-MM-dd"));
	Даты.Добавить(ОписаниеПоляДаты("ДатаНач", "ДФ=yyyy-MM-dd"));
	Даты.Добавить(ОписаниеПоляДаты("ДатаКнц", "ДФ=yyyy-MM-dd"));
	РеквизитыТребующиеКонвертации = Новый Структура("Ссылки, Даты", Ссылки, Даты);
	Возврат ЗаполнитьЗначенияApi3Objects("Отчеты", "ОтчетФНС",  block_context, РеквизитыТребующиеКонвертации);
КонецФункции
