
// Функция block_api3_planworkshedule_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Соответствие - Результат выполения функции
//
//DynamicDirective
Функция block_api3_planworkshedule_calc_value(block_type, node, path, context, block_context)
	Ссылки = Новый Массив;
	Ссылки.Добавить(ОписаниеПоляСсылки("ПроизводственныйКалендарь"));
	Ссылки.Добавить(ОписаниеПоляСсылки("СпособЗаполнения", "СпособыЗаполненияГРВ"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ВидУчетногоПериода"));
	Ссылки.Добавить(ОписаниеПоляСсылки("КонтрольВремени", "КонтрольВремениГРВ"));
	РеквизитыТребующиеКонвертации = Новый Структура("Ссылки", Ссылки);
	Возврат ЗаполнитьЗначенияApi3Objects("Справочники", "ГрафикРабочегоВремени",  block_context, РеквизитыТребующиеКонвертации);
КонецФункции
