
// Функция block_api3_additionalassignment_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Соответствие - Результат выполения функции
//
//DynamicDirective
Функция block_api3_additionalassignment_calc_value(block_type, node, path, context, block_context)
	Ссылки = Новый Массив;
	Ссылки.Добавить(ОписаниеПоляСсылки("НашаОрганизация"));
	Ссылки.Добавить(ОписаниеПоляСсылки("Сотрудник "));
	Ссылки.Добавить(ОписаниеПоляСсылки("ЧастноеЛицо"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ВидСовмещения"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ВидДоплаты", "ВидДоплатыЗаСовмещение"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ЗамещаемыйСотрудник", "ЧастноеЛицо"));
	Ссылки.Добавить(ОписаниеПоляСсылки("СовмещаемаяДолжность", "Должность"));
	Даты = Новый Массив;
	Даты.Добавить(ОписаниеПоляДаты("Дата"));
	Даты.Добавить(ОписаниеПоляДаты("ДатаНачалаСовмещения"));
	Даты.Добавить(ОписаниеПоляДаты("ДатаОкончанияСовмещения "));
	РеквизитыТребующиеКонвертации = Новый Структура("Ссылки, Даты", Ссылки, Даты);
	Возврат ЗаполнитьЗначенияApi3Objects("Документы", "СовмещениеДолжностей", block_context, РеквизитыТребующиеКонвертации);
КонецФункции
