
// Функция block_api3_sickleave_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Соответствие - Результат выполения функции
//
//DynamicDirective
Функция block_api3_sickleave_calc_value(block_type, node, path, context, block_context)
	Ссылки = Новый Массив;
	Ссылки.Добавить(ОписаниеПоляСсылки("Автор", "ЧастноеЛицо"));
	Ссылки.Добавить(ОписаниеПоляСсылки("НашаОрганизация"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ЧастноеЛицо"));
	Ссылки.Добавить(ОписаниеПоляСсылки("Ответственный", "ЧастноеЛицо"));
	Ссылки.Добавить(ОписаниеПоляСсылки("СчетУчетаКонтрагент", "ПоказательУчета"));
	Ссылки.Добавить(ОписаниеПоляСсылки("СчетУчетаАванс", "ПоказательУчета"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ПричинаНетрудоспособности"));
	Ссылки.Добавить(ОписаниеПоляСсылки("Сотрудник"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ПервичныйБЛ", "Больничный"));
	Даты = Новый Массив;
	Даты.Добавить(ОписаниеПоляДаты("Дата"));
	Даты.Добавить(ОписаниеПоляДаты("ДатаРасчета"));
	Даты.Добавить(ОписаниеПоляДаты("ДатаНач"));
	Даты.Добавить(ОписаниеПоляДаты("ДатаКнц"));
	Даты.Добавить(ОписаниеПоляДаты("ДатаНачалаРодственник1"));
	Даты.Добавить(ОписаниеПоляДаты("ДатаОкончанияРодственник1"));
	Даты.Добавить(ОписаниеПоляДаты("ДатаНачалаРодственник2"));
	Даты.Добавить(ОписаниеПоляДаты("ДатаОкончанияРодственник2"));
	Даты.Добавить(ОписаниеПоляДаты("ДатаВыдачи"));
	Даты.Добавить(ОписаниеПоляДаты("ПриступитьКРаботеС"));
	РеквизитыТребующиеКонвертации = Новый Структура("Ссылки, Даты", Ссылки, Даты);
	Возврат ЗаполнитьЗначенияApi3Objects("Документы", "Больничный",  block_context, РеквизитыТребующиеКонвертации);
КонецФункции


// Функция block_api3_sickleave_period_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Соответствие - Результат выполения функции
//
//DynamicDirective
Функция block_api3_sickleave_period_calc_value(block_type, node, path, context, block_context)
	Возврат ЗаполнитьЗначенияApi3Objects(неопределено, неопределено,  block_context);
КонецФункции


// Функция block_api3_sickleave_accrual_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Соответствие - Результат выполения функции
//
//DynamicDirective
Функция block_api3_sickleave_accrual_calc_value(block_type, node, path, context, block_context)
	Ссылки = Новый Массив;
	Ссылки.Добавить(ОписаниеПоляСсылки("Показатель", "ПоказательУчета"));
	Даты = Новый Массив;
	Даты.Добавить(ОписаниеПоляДаты("ДатаНач"));
	Даты.Добавить(ОписаниеПоляДаты("ДатаКнц"));
	РеквизитыТребующиеКонвертации = Новый Структура("Ссылки, Даты", Ссылки, Даты);
	Возврат ЗаполнитьЗначенияApi3Objects(неопределено, неопределено,  block_context, РеквизитыТребующиеКонвертации);
КонецФункции
