
// Функция block_api3_civilcontract_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Соответствие - Результат выполнения функции
//
//DynamicDirective
Функция block_api3_civilcontract_calc_value(block_type, node, path, context, block_context)
	Ссылки = Новый Массив;
	Ссылки.Добавить(ОписаниеПоляСсылки("НашаОрганизация"));
	Ссылки.Добавить(ОписаниеПоляСсылки("Ответственный", "ЧастноеЛицо"));
	Ссылки.Добавить(ОписаниеПоляСсылки("СчетУчетаАванс", "ПоказательУчета"));
	Ссылки.Добавить(ОписаниеПоляСсылки("СчетУчетаКонтрагент", "ПоказательУчета"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ЧастноеЛицо"));
	Ссылки.Добавить(ОписаниеПоляСсылки("Сотрудник"));
	Ссылки.Добавить(ОписаниеПоляСсылки("Руководитель", "ЧастноеЛицо"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ДолжностьРуководителя", "Должность"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ВидДоговораГПХ", "ВидНачисленияУдержания"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ВидЗанятости"));
	Ссылки.Добавить(ОписаниеПоляСсылки("РабочаяГруппа", "СтруктураПредприятия"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ГрафикРаботы", "ГрафикРабочегоВремени"));
	Ссылки.Добавить(ОписаниеПоляСсылки("Должность"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ПредыдущаяДолжность", "Должность"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ХарактерОплаты", "ХарактерВыплатыПоДоговору"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ТерриториальныеУсловия"));
	Ссылки.Добавить(ОписаниеПоляСсылки("ШтатноеРасписание"));
	Даты = Новый Массив;
	Даты.Добавить(ОписаниеПоляДаты("Дата"));
	Даты.Добавить(ОписаниеПоляДаты("ДатаПриема"));
	Даты.Добавить(ОписаниеПоляДаты("ДатаКнц"));
	Даты.Добавить(ОписаниеПоляДаты("ТрудовойДоговорДата"));
	Даты.Добавить(ОписаниеПоляДаты("ТрудовойДоговорСрок"));
	РеквизитыТребующиеКонвертации  = Новый Структура("Ссылки, Даты", Ссылки, Даты);
	Возврат ЗаполнитьЗначенияApi3Objects("Документы", "ПриемНаРаботуГПХ", block_context, РеквизитыТребующиеКонвертации);
КонецФункции
