
// Функция block_api3_writing_off_act_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Соответствие - Результат выполения функции
//
//DynamicDirective
Функция block_api3_writing_off_act_calc_value(block_type, node, path, context, block_context)
	Ссылки = Новый Массив;
	Ссылки.Добавить(ОписаниеПоляСсылки("Автор", "ЧастноеЛицо"));
	Ссылки.Добавить(ОписаниеПоляСсылки("НашаОрганизация"));
	Ссылки.Добавить(ОписаниеПоляСсылки("Ответственный", "ЧастноеЛицо"));
	Ссылки.Добавить(ОписаниеПоляСсылки("СчетУчетаКонтрагент", "ПоказательУчета"));
	Ссылки.Добавить(ОписаниеПоляСсылки("СчетУчетаАванс", "ПоказательУчета"));
	Ссылки.Добавить(ОписаниеПоляСсылки("Склад"));
	Ссылки.Добавить(ОписаниеПоляСсылки("СчетСписания", "ПоказательУчета"));
	Даты = Новый Массив;
	Даты.Добавить(ОписаниеПоляДаты("Дата"));
	РеквизитыТребующиеКонвертации = Новый Структура("Ссылки, Даты", Ссылки, Даты);
	Возврат ЗаполнитьЗначенияApi3Objects("Документы", "АктСписания",  block_context, РеквизитыТребующиеКонвертации);
КонецФункции
