
// Функция index_indicators_by_account_code
//
// Параметры:
//  Показатели - Массив - Массив показателей в начальном виде
//
// Возвращаемое значение:
//  Массив - Результат выполнения функции = индексированные показатели по коду
//
Функция index_indicators_by_account_code(Показатели)
	
	ИндексированныеПоказатели = Новый Соответствие;
	
	Для Каждого Показатель Из Показатели["Показатели"] Цикл
		СтруктураПоказателя = Новый Соответствие;
		СтруктураПоказателя.Вставить("КодПоказателя", Показатель["Имя"]);
		СтруктураПоказателя.Вставить("Приоритет", Показатель["Приоритет"]);
		СтруктураПоказателя.Вставить("Рейтинг", 0);
		Для Каждого Парам Из Показатель["Параметры"] Цикл
			КодСчета = get_prop(Парам, "Счет");
			СтруктураПоказателя.Вставить("Параметры", Парам);
		КонецЦикла;
		Детализация = Новый Соответствие;
		Для Каждого Детал Из Показатель["ДетализацияЭкспорт"] Цикл
			ДеталИмя = Новый Соответствие;
			ДеталИмя.Вставить("СпособПолучения", Детал["СпособПолучения"]);
			ДеталИмя.Вставить("ЗначениеПоУмолчанию", Детал["ЗначениеПоУмолчанию"]);
			Детализация.Вставить(Детал["Имя"], ДеталИмя);
		КонецЦикла;
		СтруктураПоказателя.Вставить("Детализация", Детализация);
		
		СписокПоказателейПоКодуСчета = get_prop(ИндексированныеПоказатели, КодСчета);
		Если СписокПоказателейПоКодуСчета = Неопределено Тогда
			СписокПоказателейПоКодуСчета = Новый Массив;
		КонецЕсли;
		СписокПоказателейПоКодуСчета.Добавить(СтруктураПоказателя);
		
		ИндексированныеПоказатели.Вставить(КодСчета, СписокПоказателейПоКодуСчета);
	КонецЦикла;
	
	Возврат ИндексированныеПоказатели;
	
КонецФункции

// Функция index_indicators_by_name
//
// Параметры:
//  Показатели - Массив - Массив показателей в начальном виде
//
// Возвращаемое значение:
//  Массив - Результат выполнения функции = индексированные показатели по имени
//
Функция index_indicators_by_name(Показатели)
	
	ИндексированныеПоказатели = Новый Соответствие;
	
	Для Каждого Показатель Из Показатели["Показатели"] Цикл
		СтруктураПоказателя = Новый Соответствие;
		СтруктураПоказателя.Вставить("КодПоказателя", Показатель["Имя"]);
		СтруктураПоказателя.Вставить("Приоритет", Показатель["Приоритет"]);
		СтруктураПоказателя.Вставить("Рейтинг", 0);
		КодСчета = "";
		СтруктураПоказателя.Вставить("КодСчета", КодСчета);
		Для Каждого Парам Из Показатель["Параметры"] Цикл
			СтруктураПоказателя.Вставить("КодСчета", get_prop(Парам, "Счет"));
			СтруктураПоказателя.Вставить("Параметры", Парам);
		КонецЦикла;
		Детализация = Новый Соответствие;
		Для Каждого Детал Из Показатель["ДетализацияИмпорт"] Цикл
			ДеталИмя = Новый Соответствие;
			ДеталИмя.Вставить("СпособПолучения", Детал["СпособПолучения"]);
			ДеталИмя.Вставить("ЗначениеПоУмолчанию", Детал["ЗначениеПоУмолчанию"]);
			Детализация.Вставить(Детал["Имя"], ДеталИмя);
		КонецЦикла;
		СтруктураПоказателя.Вставить("Детализация", Детализация);
		
		ИндексированныеПоказатели.Вставить(Показатель["Имя"], СтруктураПоказателя);
	КонецЦикла;
	
	Возврат ИндексированныеПоказатели;
	
КонецФункции

// Функция block_accordion_item_calc_value
//
// Параметры:
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
// local_context - Соответствие - Локальный контекст исполняемого блока
//
// Возвращаемое значение:
//  Структура - Результат выполения функции
//
// Сохраняем идентичность со структурой кода в Питоне
// BSLLS:CognitiveComplexity-off
Функция accounting_entries_list2_items(context, block_context, local_context)
	
	Результат = Новый Массив;
	УжеОбработаны = ПроверкаКоличестваОбработанных2(block_context, local_context);
	// признак отладки
	
	ВыборкаХозрасчетныхДвиженийССубконто2(block_context, local_context);
	
	сч = 0;
	счНаСтранице = 0;
	Если Не block_context.Свойство("selection_index") Тогда
		block_context.Вставить("selection_index", 0);
	КонецЕсли;
	
	Если block_context.Свойство("selection_max_index") И block_context["selection_index"] = block_context["selection_max_index"] Тогда
		Возврат Результат;	
	КонецЕсли;
	
	ВыгружатьПроводки = get_prop(block_context, "UNLOADING_TRANSACTIONS", Неопределено);
	НеизвестныеКакБухСправки = get_prop(block_context, "UNKNOWN_AS_ACCOUNTING_CERTIFICATES", Неопределено);
	
	Пока local_context["Выборка"].СледующийПоЗначениюПоля("Регистратор") Цикл
		сч = сч + 1;
		Если сч <= УжеОбработаны Тогда
			Продолжить;
		КонецЕсли;
		Проводки = Новый Массив;
		ПроводкиСырые = Новый Массив;
		Если ВыгружатьПроводки = "TRUE" Тогда
			// Преобразуем данные инишек показателей 1 раз
			Если block_context.page = 0 ИЛИ НЕ local_context.Свойство("Выборка") Тогда
				indicator_list_src  = index_indicators_by_account_code(block_context.indicator_list_src);
				indicator_list_dest = index_indicators_by_name(block_context.indicator_list_dest);
				local_context.Вставить("indicator_list_src",  indicator_list_src);
				local_context.Вставить("indicator_list_dest", indicator_list_dest);
			Иначе
				indicator_list_src  = local_context["indicator_list_src"];
				indicator_list_dest = local_context["indicator_list_dest"];
			КонецЕсли;
			
			Пока local_context["Выборка"].Следующий() Цикл
				// НЕ ГРУЗИМ ПРОВОДКИ ПО ЗАБАЛАНСОВЫМ СЧЕТАМ!!!
				Если НЕ ЗначениеЗаполнено(local_context["Выборка"].СчетДт) ИЛИ НЕ ЗначениеЗаполнено(local_context["Выборка"].СчетКт) Тогда
					Продолжить;
				КонецЕсли;
				
				ПроводкаСыраяДебет = Новый Структура("КодСчета,Аналитика1ИС,Аналитика2ИС,Аналитика3ИС", local_context["Выборка"].СчетДт,local_context["Выборка"].СубконтоДт1,local_context["Выборка"].СубконтоДт2,local_context["Выборка"].СубконтоДт3);
				ПроводкаСыраяКредит = Новый Структура("КодСчета,Аналитика1ИС,Аналитика2ИС,Аналитика3ИС", local_context["Выборка"].СчетКт,local_context["Выборка"].СубконтоКт1,local_context["Выборка"].СубконтоКт2,local_context["Выборка"].СубконтоКт3);
				ПроводкиСырые.Добавить(Новый Структура("Дебет,Кредит,Сумма,Дата", ПроводкаСыраяДебет, ПроводкаСыраяКредит, local_context["Выборка"].Сумма, Формат(local_context["Выборка"].Период, "ДФ=dd.MM.yyyy")));
				
				Контекст = Новый Структура;
				Контекст.Вставить("blacklist_accounts", block_context.blacklist_accounts);
				Контекст.Вставить("blacklist_detalization", block_context.blacklist_detalization);
				Контекст.Вставить("indicator_list_dest", indicator_list_dest);
				Контекст.Вставить("indicator_list_src", indicator_list_src);
				
				// Проводка Дебет
				Контекст.Вставить("accounting_entry_side", ПроводкаСыраяДебет);
				ПроводкаДебет = block_indicator_from_accounting_entry_side_calc_value("indicator_from_accounting_entry_side",
									Неопределено, "", context, Контекст);
				
				Контекст = Новый Структура;
				Контекст.Вставить("blacklist_accounts", block_context.blacklist_accounts);
				Контекст.Вставить("blacklist_detalization", block_context.blacklist_detalization);
				Контекст.Вставить("indicator_list_dest", indicator_list_dest);
				Контекст.Вставить("indicator_list_src", indicator_list_src);
				
				// Проводка Кредит
				Контекст.Вставить("accounting_entry_side", ПроводкаСыраяКредит);
				ПроводкаКредит = block_indicator_from_accounting_entry_side_calc_value("indicator_from_accounting_entry_side",
									Неопределено, "", context, Контекст);
				
				Проводки.Добавить(Новый Структура("Дебет,Кредит,Сумма,Дата", ПроводкаДебет, ПроводкаКредит, local_context["Выборка"].Сумма, Формат(local_context["Выборка"].Период, "ДФ=dd.MM.yyyy")));
			КонецЦикла;
			
			// НЕ ГРУЗИМ ДОКУМЕНТЫ БЕЗ ПРОВОДОК!!!
			Если Проводки.Количество() = 0 Тогда
				block_context["selection_index"] = block_context["selection_index"] + 1;
				счНаСтранице = счНаСтранице + 1;
				Если счНаСтранице = 20 Тогда
					Возврат Результат;
				КонецЕсли;
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		ТипЗначения = ТипЗнч(local_context["Выборка"].Регистратор);
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначения);
		ini_name = ОбъектМетаданных.Имя + "_read";
		Попытка
			Load_ini(ini_name);
			ИмяСБИС = Неопределено;
		Исключение
			Если НеизвестныеКакБухСправки = "TRUE" Тогда
				ini_name = "БухгалтерскаяСправка_read";
				ИмяСБИС = "БухгалтерскаяСправка";
			Иначе
				Продолжить;
			КонецЕсли;
		КонецПопытки;
		Результат.Добавить(Новый Структура("Название, Дата, Номер, ПроводкиСырые, Проводки, ИдИС, ИмяИС, ТипИС, ИмяСБИС, НашаОрганизация, ini_name", Строка(local_context["Выборка"].Регистратор), Формат(local_context["Выборка"].Регистратор.Дата,"ДФ=dd.MM.yyyy"), local_context["Выборка"].Регистратор.Номер, ПроводкиСырые, Проводки, XMLСтрока(local_context["Выборка"].Регистратор.УникальныйИдентификатор()), ОбъектМетаданных.Имя, "Документы", ИмяСБИС, Новый Структура("ИдИС, ИмяИС, ИмяСБИС", XMLСтрока(block_context.Организация.УникальныйИдентификатор()), block_context.filter["organization"]["ИмяИС"], "НашаОрганизация"), ini_name ));
		block_context["selection_index"] = block_context["selection_index"] + 1;
		счНаСтранице = счНаСтранице + 1;
		Если счНаСтранице = 20 Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;
	block_context.Вставить("selection_max_index", block_context["selection_index"]);
	Возврат Результат;
	
КонецФункции
// BSLLS:CognitiveComplexity-on

Функция ПроверкаКоличестваОбработанных2(block_context, local_context)
	УжеОбработаны = 0;
	// признак отладки
	Если НЕ local_context.Свойство("Выборка") И block_context.Свойство("selection_index") Тогда
		УжеОбработаны = block_context["selection_index"];	
	КонецЕсли;
	Возврат УжеОбработаны; 
КонецФункции

Процедура ВыборкаХозрасчетныхДвиженийССубконто2(block_context, local_context)
	Если block_context.page = 0 Или НЕ local_context.Свойство("Выборка") тогда
		Запрос = Новый Запрос;
	    Запрос.Текст =
	        "ВЫБРАТЬ
	        |   ХозрасчетныйДвиженияССубконто.Период КАК Период,
	        |   ХозрасчетныйДвиженияССубконто.Организация КАК Организация,
	        |   ХозрасчетныйДвиженияССубконто.Регистратор КАК Регистратор,
	        |   ХозрасчетныйДвиженияССубконто.СчетДт.КодБыстрогоВыбора КАК СчетДт,
	        |   ХозрасчетныйДвиженияССубконто.СубконтоДт1 КАК СубконтоДт1,
	        |   ХозрасчетныйДвиженияССубконто.СубконтоДт2 КАК СубконтоДт2,
	        |   ХозрасчетныйДвиженияССубконто.СубконтоДт3 КАК СубконтоДт3,
	        |   ХозрасчетныйДвиженияССубконто.СчетКт.КодБыстрогоВыбора КАК СчетКт,
	        |   ХозрасчетныйДвиженияССубконто.СубконтоКт1 КАК СубконтоКт1,
	        |   ХозрасчетныйДвиженияССубконто.СубконтоКт2 КАК СубконтоКт2,
	        |   ХозрасчетныйДвиженияССубконто.СубконтоКт3 КАК СубконтоКт3,
	        |   ХозрасчетныйДвиженияССубконто.Сумма КАК Сумма
	        |ИЗ
	        |   РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(
	        |       &ДатаНач,
	        |       &ДатаКнц,
	        |       Активность = Истина И Организация = &Организация
			|   ) КАК ХозрасчетныйДвиженияССубконто
			|ГДЕ
			|   ХозрасчетныйДвиженияССубконто.Сумма <> 0
			|УПОРЯДОЧИТЬ ПО
			|   Период Возр,
			|   Регистратор.Номер,
			|   Регистратор
			|";
	 	
		Запрос.УстановитьПараметр("ДатаНач", block_context.filter["dateStart"]);
		Запрос.УстановитьПараметр("ДатаКнц", КонецДня(block_context.filter["dateEnd"]));
		ИмяСправочникаОрганизаций = Сред(block_context.filter["organization"]["ИмяИС"], Найти(block_context.filter["organization"]["ИмяИС"], ".")+1);
		Организация = Справочники[ИмяСправочникаОрганизаций].ПолучитьСсылку(Новый УникальныйИдентификатор(block_context.filter["organization"]["ИдИС"]));
		block_context.Вставить("Организация", Организация);
		Запрос.УстановитьПараметр("Организация", Организация);
		РезультатЗапроса = Запрос.Выполнить();
	    Выборка = РезультатЗапроса.Выбрать();
		local_context.Вставить("Выборка", Выборка);
	КонецЕсли;	
КонецПроцедуры

