
//DynamicDirective
Процедура ДобавитьПараметрБлока(Ключи, Значение, ПараметрыАлгоритма)
	Если ТипЗнч(Ключи) = Тип("Массив") и Ключи.Количество() = 2 Тогда
		Если ПараметрыАлгоритма.Свойство(Ключи[0]) И ТипЗнч(ПараметрыАлгоритма[Ключи[0]]) = Тип("Соответствие") Тогда
			ПараметрыАлгоритма[Ключи[0]][Нрег(Строка(Ключи[1]))] = Значение
		Иначе	
		 	ПараметрыАлгоритма.Вставить(Ключи[0], Новый Соответствие);
			ДобавитьПараметрБлока(Ключи, Значение, ПараметрыАлгоритма);
		КонецЕсли;
	КонецЕсли;		
КонецПроцедуры

//DynamicDirective
Функция block_algorithm_info_calc_value(block_type, node, path, context, block_context)
	ТипыПараметров = Новый Соответствие();
	ТипыПараметров.Вставить("algorithm_info_param_string",	"Строка");	
	ТипыПараметров.Вставить("algorithm_info_param_number",	"Число");	
	ТипыПараметров.Вставить("algorithm_info_param_boolean",	"Булево");	
	
	Результат = Новый Соответствие;
	ПараметрыАлгоритма = Новый Структура;
	Результат.Вставить("params", Новый Соответствие);
	
	Для Каждого Параметр Из block_context Цикл
		Ключ = Параметр.Ключ;
		Если Лев(Ключ,1) <> "_" Тогда
			Если Лев(Ключ,5) = "PARAM" Тогда 
				Ключи = СтрРазделить82(Ключ,"_"); 
				ДобавитьПараметрБлока(Ключи, Параметр.Значение, ПараметрыАлгоритма);
			Иначе
				Результат.Вставить(Ключ,Параметр.Значение);	
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
	ТипыПеременных = workspace_find_mutation_by_name(node, "items_types"); 
	ТипыПараметровАлгоритма = СтрРазделить82(ТипыПеременных,",");
	Объекты = "algorithm_info_param_extsys_objects"; 
	ИндексМассива = ТипыПараметровАлгоритма.Найти(Объекты);
	Если ИндексМассива <> Неопределено Тогда 
		Результат["params"].Вставить("extsys_objects",Новый Соответствие);
		ТипыПараметровАлгоритма.Удалить(ИндексМассива);
	КонецЕсли;
	
	Счетчик = 0;
	Для Каждого Параметр Из ПараметрыАлгоритма Цикл
		ИмяПараметра = block_obj_get_path_value(Параметр,"Значение.Имя",Неопределено);
		Если ИмяПараметра <> Неопределено Тогда 
			Объект = get_prop(Параметр,"Значение");
			Если Объект["type"] = Неопределено Тогда 
				Объект["type"] = ТипыПараметров.Получить(ТипыПараметровАлгоритма.Получить(Счетчик));	
			КонецЕсли;
			Результат["params"][ИмяПараметра] = Объект; 
		КонецЕсли;
		Счетчик = Счетчик + 1;
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции

