
Функция block_c1_calculate_саlc_no_safe_mode(Выражение, ПараметрыАлгоритма = Неопределено)
	Результат = Вычислить(Выражение);
	Результат = ПоместитьВоВременноеХранилище(Результат, Новый УникальныйИдентификатор);
	Saby_ПривестиПеременнуюКДопустимойНаКлиенте(ПараметрыАлгоритма);
	Возврат Результат; 
КонецФункции

//DynamicDirective

Функция block_c1_calculate_calc_value(block_type, node, path, context, block_context)
	Алгоритм = block_context.NAME;
	ИмяНулевогоПараметра = "PARAM0";
	ИмяПарам = "PARAM";
	Если Не block_context.Свойство(ИмяНулевогоПараметра) Тогда
		АдресРезультата = block_c1_calculate_саlc_no_safe_mode(Алгоритм);
	Иначе
		НомерПараметра = 1;
		ПараметрыАлгоритма = Новый Структура;
		АргументыВызова = "ПараметрыАлгоритма." + ИмяНулевогоПараметра;
		ПарамЗначение = block_context[ИмяНулевогоПараметра];	
		Если ТипЗнч(get_prop(block_context, ИмяНулевогоПараметра)) = Тип("Соответствие") Тогда
			ПарамЗначение = ПолучитьСтруктуруИзСоответствия(block_context[ИмяНулевогоПараметра]);	
		КонецЕсли;
		ПараметрыАлгоритма.Вставить(ИмяНулевогоПараметра, ПарамЗначение);
		Пока block_context.Свойство(ИмяПарам + Строка(НомерПараметра)) Цикл
			ПарамЗначение = get_prop(block_context, ИмяПарам + Строка(НомерПараметра));	
			Если ТипЗнч(get_prop(block_context, ИмяПарам + Строка(НомерПараметра))) = Тип("Соответствие") Тогда
				ПарамЗначение = ПолучитьСтруктуруИзСоответствия(get_prop(block_context, ИмяПарам + Строка(НомерПараметра)));	
			КонецЕсли;	
			ПараметрыАлгоритма.Вставить(ИмяПарам + Строка(НомерПараметра), ПарамЗначение);
			АргументыВызова = АргументыВызова  + ", ПараметрыАлгоритма." + "PARAM" + Строка(НомерПараметра);
			НомерПараметра = НомерПараметра + 1;
		КонецЦикла;
		Выражение = Алгоритм + "(" + АргументыВызова + ")";
		АдресРезультата = block_c1_calculate_саlc_no_safe_mode(Выражение, ПараметрыАлгоритма);
		НомерПараметра = 0;
		Пока block_context.Свойство(ИмяПарам + Строка(НомерПараметра)) Цикл
			Если ТипЗнч(get_prop(block_context, ИмяПарам + Строка(НомерПараметра))) = Тип("Соответствие") Тогда
				ОбновитьСтруктуру(block_context[ИмяПарам + Строка(НомерПараметра)], ПараметрыАлгоритма[ИмяПарам + Строка(НомерПараметра)]);
			КонецЕсли;	
			НомерПараметра = НомерПараметра + 1;
		КонецЦикла;
	КонецЕсли;  
	Попытка 
		Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	Исключение  
		УдалитьИзВременногоХранилища(АдресРезультата);
		ИнфОбОшибке = ИнформацияОбОшибке();
		ВызватьИсключение NewExtExceptionСтрока(ИнфОбОшибке,,,, add_block_to_dump(block_context));	
	КонецПопытки;
	УдалитьИзВременногоХранилища(АдресРезультата);
	Возврат Результат;
КонецФункции
