
// Функция МенеджерОбъектаПоИмени
//
// Параметры:
// Имя - Строка - Имя
//
// Возвращаемое значение:
//  Неопределено - Результат выполения функции
//
// Функция должна быть такй, красиво и проще нет возможности сделать
// BSLLS:CognitiveComplexity-off
// BSLLS:CyclomaticComplexity-off
Функция МенеджерОбъектаПоИмени(Имя)
	Перем КлассОМ, ИмяОМ, Менеджер;
	
	ЧастиИмени = СтрРазделить82(Имя, ".");
	
	Если ЧастиИмени.Количество() > 0 Тогда
		КлассОМ = ВРег(ЧастиИмени[0]);
	КонецЕсли;
	
	Если ЧастиИмени.Количество() > 1 Тогда
		ИмяОМ = ЧастиИмени[1];
	КонецЕсли;
	
	Если      КлассОМ = "ПЛАНОБМЕНА"
	 Или      КлассОМ = "ПЛАНЫОБМЕНА" Тогда
		Менеджер = ПланыОбмена;
		
	ИначеЕсли Найти(КлассОМ, "СПРАВОЧНИК") Тогда
		Менеджер = Справочники;
		
	ИначеЕсли КлассОМ = "ЖУРНАЛДОКУМЕНТОВ"
	      Или КлассОМ = "ЖУРНАЛЫДОКУМЕНТОВ" Тогда
		Менеджер = ЖурналыДокументов;
		
	ИначеЕсли Найти(КлассОМ, "ДОКУМЕНТ") Тогда
		Менеджер = Документы;
		
	ИначеЕсли КлассОМ = "ПЕРЕЧИСЛЕНИЕ"
	      Или КлассОМ = "ПЕРЕЧИСЛЕНИЯ" Тогда
		Менеджер = Перечисления;
		
	ИначеЕсли КлассОМ = "ОБЩИЙМОДУЛЬ"
	      Или КлассОМ = "ОБЩИЕМОДУЛИ" Тогда
		
		Возврат ОбщийМодульЗначение(ИмяОМ);
		
	ИначеЕсли КлассОМ = "ОТЧЕТ"
	      Или КлассОМ = "ОТЧЕТЫ" Тогда
		Менеджер = Отчеты;
		
	ИначеЕсли КлассОМ = "ОБРАБОТКА"
	      Или КлассОМ = "ОБРАБОТКИ" Тогда
		Менеджер = Обработки;
		
	ИначеЕсли КлассОМ = "ПЛАНВИДОВХАРАКТЕРИСТИК"
	      Или КлассОМ = "ПЛАНЫВИДОВХАРАКТЕРИСТИК" Тогда
		Менеджер = ПланыВидовХарактеристик;
		
	ИначеЕсли КлассОМ = "ПЛАНСЧЕТОВ"
	      Или КлассОМ = "ПЛАНЫСЧЕТОВ" Тогда
		Менеджер = ПланыСчетов;
		
	ИначеЕсли КлассОМ = "ПЛАНВИДОВРАСЧЕТА"
	      Или КлассОМ = "ПЛАНЫВИДОВРАСЧЕТА" Тогда
		Менеджер = ПланыВидовРасчета;
		
	ИначеЕсли КлассОМ = "РЕГИСТРСВЕДЕНИЙ"
	      Или КлассОМ = "РЕГИСТРЫСВЕДЕНИЙ" Тогда
		Менеджер = РегистрыСведений;
		
	ИначеЕсли КлассОМ = "РЕГИСТРНАКОПЛЕНИЯ"
	      Или КлассОМ = "РЕГИСТРЫНАКОПЛЕНИЯ" Тогда
		Менеджер = РегистрыНакопления;
		
	ИначеЕсли КлассОМ = "РЕГИСТРБУХГАЛТЕРИИ"
	      Или КлассОМ = "РЕГИСТРЫБУХГАЛТЕРИИ" Тогда
		Менеджер = РегистрыБухгалтерии;
		
	ИначеЕсли КлассОМ = "РЕГИСТРРАСЧЕТА"
	      Или КлассОМ = "РЕГИСТРЫРАСЧЕТА" Тогда
		
		Если ЧастиИмени.Количество() < 3 Тогда
			// Регистр расчета
			Менеджер = РегистрыРасчета;
		Иначе
			КлассПодчиненногоОМ = ВРег(ЧастиИмени[2]);
			Если ЧастиИмени.Количество() > 3 Тогда
				ИмяПодчиненногоОМ = ЧастиИмени[3];
			КонецЕсли;
			Если КлассПодчиненногоОМ = "ПЕРЕРАСЧЕТ"
			 Или КлассПодчиненногоОМ = "ПЕРЕРАСЧЕТЫ" Тогда
				// Перерасчет
				Попытка
					Менеджер = РегистрыРасчета[ИмяОМ].Перерасчеты;
					ИмяОМ = ИмяПодчиненногоОМ;
				Исключение
					Менеджер = Неопределено;
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли КлассОМ = "БИЗНЕСПРОЦЕСС"
	      Или КлассОМ = "БИЗНЕСПРОЦЕССЫ" Тогда
		Менеджер = БизнесПроцессы;
		
	ИначеЕсли КлассОМ = "ЗАДАЧА"
	      Или КлассОМ = "ЗАДАЧИ" Тогда
		Менеджер = Задачи;
		
	ИначеЕсли КлассОМ = "КОНСТАНТА"
	      Или КлассОМ = "КОНСТАНТЫ" Тогда
		Менеджер = Константы;
		
	Иначе
		Если КлассОМ = "ПОСЛЕДОВАТЕЛЬНОСТЬ"
	      Или КлассОМ = "ПОСЛЕДОВАТЕЛЬНОСТИ" Тогда
			Менеджер = Последовательности;
		КонецЕсли;
	КонецЕсли;
	
	Если Менеджер <> Неопределено Тогда
		Если ЗначениеЗаполнено(ИмяОМ) Тогда
			Попытка
				Возврат Менеджер[ИмяОМ];
			Исключение
				Менеджер = Неопределено;
			КонецПопытки;
		Иначе
			Возврат Менеджер;
		КонецЕсли;
	КонецЕсли;
	
	СтрокаОшибки = "Отсутствует менеджер объекта "+Строка(Имя);
	ВызватьИсключение СтрокаОшибки;
КонецФункции
// BSLLS:CyclomaticComplexity-on
// BSLLS:CognitiveComplexity-on

Процедура ПроверитьИмяПроцедурыКонфигурации(Знач ИмяПроцедуры)
	
	ЧастиИмени = СтрРазделить82(ИмяПроцедуры, ".");
	Если ЧастиИмени.Количество() <> 2 И ЧастиИмени.Количество() <> 3 Тогда
		СтрокаОшибки = "Неправильный формат параметра ИмяПроцедуры (передано значение: "+Строка(ИмяПроцедуры) +" в ОбщегоНазначения.ВыполнитьМетодКонфигурации";
	
		ВызватьИсключение СтрокаОшибки;
	КонецЕсли;
	
	ИмяОбъекта = ЧастиИмени[0];
	Если ЧастиИмени.Количество() = 2 И Метаданные.ОбщиеМодули.Найти(ИмяОбъекта) = Неопределено Тогда
		СтрокаОшибки = "Неправильный формат параметра ИмяПроцедуры (передано значение: "+Строка(ИмяПроцедуры) +" в ОбщегоНазначения.ВыполнитьМетодКонфигурации.
						|Не существует общий модуль " + ИмяОбъекта;
	
		ВызватьИсключение СтрокаОшибки;
	КонецЕсли;
	
	Если ЧастиИмени.Количество() = 3 Тогда
		ПолноеИмяОбъекта = ЧастиИмени[0] + "." + ЧастиИмени[1];
		Попытка
			Менеджер = МенеджерОбъектаПоИмени(ПолноеИмяОбъекта);
		Исключение
			Менеджер = Неопределено;
		КонецПопытки;
		Если Менеджер = Неопределено Тогда
			СтрокаОшибки = "Неправильный формат параметра ИмяПроцедуры (передано значение: "+Строка(ИмяПроцедуры) +" в ОбщегоНазначения.ВыполнитьМетодКонфигурации.
							|Не существует менеджер объекта " + ПолноеИмяОбъекта;

			ВызватьИсключение СтрокаОшибки;
		КонецЕсли;
	КонецЕсли;
	
	ИмяМетодаОбъекта = ЧастиИмени[ЧастиИмени.ВГраница()];
	ВременнаяСтруктура = Новый Структура;
	Попытка
		// Проверка того, что ИмяПроцедуры является допустимым идентификатором.
		// Например: МояПроцедура.
		ВременнаяСтруктура.Вставить(ИмяМетодаОбъекта);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Безопасное выполнение метода'"),
			УровеньЖурналаРегистрации.Ошибка);
		СтрокаОшибки = "Неправильный формат параметра ИмяПроцедуры (передано значение: "+Строка(ИмяПроцедуры) +" в ОбщегоНазначения.ВыполнитьМетодКонфигурации.
							|Имя метода " + ИмяМетодаОбъекта+" не соответствует требованиям образования имен процедур и функций";
	
		ВызватьИсключение СтрокаОшибки;
	КонецПопытки;
	
КонецПроцедуры

Функция block_c1_calculate_саlc_safe_mode(Алгоритм, АргументыВызова = Неопределено, ПараметрыАлгоритма = Неопределено, ПараметрыАлгоритмаМассив = Неопределено)
	ОбщийМодульОбщегоНазначения = ОбщийМодульЗначение("ОбщегоНазначения");
	Если ОбщийМодульОбщегоНазначения = Неопределено Тогда
		ВызватьИсключение "Отсутствует общий модуль ОбщегоНазначения";
	КонецЕсли;	
	Если ПараметрыАлгоритма = Неопределено Тогда
		Результат = ОбщийМодульОбщегоНазначения.ВычислитьВБезопасномРежиме(Алгоритм);
	Иначе
		ЭтоФункцияПроцедура = Ложь;
		Попытка
			ПроверитьИмяПроцедурыКонфигурации(Алгоритм);
			ЭтоФункцияПроцедура = Истина;
		Исключение
			ЭтоФункцияПроцедура = Ложь;
		КонецПопытки;	
 		Если ЭтоФункцияПроцедура Тогда
			Попытка
				Результат = ОбщийМодульОбщегоНазначения.ВызватьФункциюКонфигурации(Алгоритм, ПараметрыАлгоритмаМассив);
			Исключение
				Результат = ОбщийМодульОбщегоНазначения.ВычислитьВБезопасномРежиме(Алгоритм+"("+АргументыВызова+")", ПараметрыАлгоритма);
			КонецПопытки
		Иначе
			Результат = ОбщийМодульОбщегоНазначения.ВычислитьВБезопасномРежиме(Алгоритм+"("+АргументыВызова+")", ПараметрыАлгоритма);
		КонецЕсли;	
	КонецЕсли;
	Результат = ПоместитьВоВременноеХранилище(Результат,Новый УникальныйИдентификатор);
	Возврат Результат 
КонецФункции

Функция block_c1_calculate_саlc_vo2(Знач Алгоритм, АргументыВызова = Неопределено, Знач Параметры = Неопределено, 
		ПараметрыАлгоритмаМассив = Неопределено)
	Результат = "";    
	МодульОбъекта = МодульОбъекта();    
	МассивФункции = СтрРазделить82(Алгоритм, ".");
	ИмяФункции = МассивФункции[1];
	
	// Если запуск не из обработки vo2 
	Если Не МодульОбъекта.Метаданные().Имя = "СБИС" Тогда
		ИмяФункции = "Saby_Core." + Строка(ИмяФункции);
		Результат =  block_c1_calculate_саlc_safe_mode(ИмяФункции, АргументыВызова, Параметры, ПараметрыАлгоритмаМассив);    
	Иначе
		Если ИмяФункции = "ЗаполнитьДоговорСКлиентомУТ11" Тогда
			Результат = МодульОбъекта.ЗаполнитьДоговорСКлиентомУТ11(Параметры.PARAM0);   
		ИначеЕсли ИмяФункции = "ЗаполнитьМенеджераУТ11" Тогда
			Результат = МодульОбъекта.ЗаполнитьМенеджераУТ11(Параметры.PARAM0); 
		ИначеЕсли ИмяФункции = "ЗаполнитьСоглашениеСКлиентомУТ11" Тогда
			Результат = МодульОбъекта.ЗаполнитьСоглашениеСКлиентомУТ11(Параметры.PARAM0); 
		ИначеЕсли ИмяФункции = "ЗаполнитьНалогообложениеНДСБезДоговораУТ11" Тогда
			Результат = МодульОбъекта.ЗаполнитьНалогообложениеНДСБезДоговораУТ11(Параметры.PARAM0);  
		ИначеЕсли  ИмяФункции = "сбисРассчитатьЦеныСтавкиИСуммыНДСДляСтрокТЧТоварыДокумента_УТ11" Тогда
            Результат = МодульОбъекта.сбисРассчитатьЦеныСтавкиИСуммыНДСДляСтрокТЧТоварыДокумента_УТ11(Параметры.PARAM0, 
			Параметры.PARAM1, Параметры.PARAM2);   
		ИначеЕсли  ИмяФункции = "ПолучитьНомерДокумента" Тогда
            Результат = МодульОбъекта.ПолучитьНомерДокумента(Параметры.PARAM0, Параметры.PARAM1);   
		ИначеЕсли ИмяФункции = "ВложениеСБИС_ПрочитатьДанные" Тогда
            Результат = МодульОбъекта.ВложениеСБИС_ПрочитатьДанные(Параметры.PARAM0, Параметры.PARAM1);  
		Иначе
			Результат = Неопределено;		
		КонецЕсли;
	КонецЕсли;	
	
	Результат = ПоместитьВоВременноеХранилище(Результат, Новый УникальныйИдентификатор); 
	Возврат Результат;
КонецФункции

// Функция block_c1_calculate_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Структура - Результат выполения функции
//
//DynamicDirective
// BSLLS:CognitiveComplexity-off
Функция block_c1_calculate_calc_value(block_type, node, path, context, block_context) 
	// BSLLS:CognitiveComplexity-off  
	Если Не block_context.Свойство("PARAM0") Тогда
		Алгоритм = block_context.NAME;  
		Если Лев(block_context.NAME, 19) = "ВнешняяОбработкаВо2" Тогда
			АдресРезультата = block_c1_calculate_саlc_vo2(Алгоритм);
		Иначе
			АдресРезультата = block_c1_calculate_саlc_safe_mode(Алгоритм); 
		КонецЕсли;
		
	Иначе
		НомерПараметра = 1;
		ПараметрыАлгоритма = Новый Структура;
		ПараметрыАлгоритмаМассив = Новый Массив;
		АргументыВызова = "Параметры."+"PARAM0";
		Если ТипЗнч(get_prop(block_context,"PARAM0")) = Тип("Соответствие") Тогда
			ПарамЗначение = ПолучитьСтруктуруИзСоответствия(block_context["PARAM0"]);	
		Иначе
			ПарамЗначение = block_context["PARAM0"];	
		КонецЕсли;
		ПараметрыАлгоритма.Вставить("PARAM0", ПарамЗначение);
		ПараметрыАлгоритмаМассив.Добавить(ПарамЗначение);
		Пока block_context.Свойство("PARAM" +Строка(НомерПараметра)) Цикл
			Если ТипЗнч(get_prop(block_context,"PARAM"+Строка(НомерПараметра))) = Тип("Соответствие") Тогда
				ПарамЗначение = ПолучитьСтруктуруИзСоответствия(get_prop(block_context,"PARAM"+Строка(НомерПараметра)));	
			Иначе
				ПарамЗначение = get_prop(block_context,"PARAM"+Строка(НомерПараметра));	
			КонецЕсли;	
			ПараметрыАлгоритма.Вставить("PARAM"+Строка(НомерПараметра), ПарамЗначение);
			ПараметрыАлгоритмаМассив.Добавить(ПарамЗначение);
			АргументыВызова = АргументыВызова  + ", Параметры." + "PARAM"+Строка(НомерПараметра);
			НомерПараметра = НомерПараметра + 1;
		КонецЦикла;    
		Если Лев(block_context.NAME, 19) = "ВнешняяОбработкаВо2" Тогда
			АдресРезультата = block_c1_calculate_саlc_vo2(block_context.NAME, АргументыВызова, ПараметрыАлгоритма, ПараметрыАлгоритмаМассив);
		Иначе
			АдресРезультата = block_c1_calculate_саlc_safe_mode(block_context.NAME, АргументыВызова, ПараметрыАлгоритма, ПараметрыАлгоритмаМассив);
		КонецЕсли;  	
	КонецЕсли;
	// BSLLS:CognitiveComplexity-on
	Попытка 
		Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	Исключение  
		УдалитьИзВременногоХранилища(АдресРезультата);
		ИнфОбОшибке = ИнформацияОбОшибке();
		ВызватьИсключение NewExtExceptionСтрока(ИнфОбОшибке,,,,add_block_to_dump(block_context));	
	КонецПопытки;
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	Возврат Результат;
КонецФункции
// BSLLS:CognitiveComplexity-on
