
Функция ЗаписьВыборкиВСтруктуру(ЗаписьВыборки, КолонкиВыборки)
	ТекущаяЗапись = Новый Структура;
	Для Каждого Колонка Из КолонкиВыборки Цикл
		ТекущаяЗапись.Вставить(Колонка.Имя, ЗаписьВыборки[Колонка.Имя]);	
	КонецЦикла;
	Возврат ТекущаяЗапись;
КонецФункции

Функция ПривестиAPI3ОбъектКСсылке(ЗначениеПараметра) 
	Результат = ЗначениеПараметра;
	Если ТипЗнч(ЗначениеПараметра) <> Тип("Структура") 
		И ТипЗнч(ЗначениеПараметра) <> Тип("Соответствие")
		И ТипЗнч(ЗначениеПараметра) <> Тип("Массив") Тогда
		Возврат Результат;
	КонецЕсли;
	Если ТипЗнч(ЗначениеПараметра) = Тип("Массив") Тогда 
		Результат = Новый Массив;
		Для Каждого Элемент_ЗначениеПараметра Из ЗначениеПараметра Цикл
			Результат.Добавить(ПривестиAPI3ОбъектКСсылке(Элемент_ЗначениеПараметра));
		КонецЦикла;
	Иначе
		ИмяИС = get_prop(ЗначениеПараметра, "ИмяИС", Неопределено);
		ИдИС = get_prop(ЗначениеПараметра, "ИдИС", Неопределено);
		ТипИС = get_prop(ЗначениеПараметра, "ТипИС", Неопределено); 
		Если ЗначениеЗаполнено(ТипИС) Тогда
			ИмяИС = ТипИС + "." + ИмяИС;	
		КонецЕсли;
		Если ИдИС <> Неопределено И ИмяИС <> Неопределено Тогда 
			Попытка 
				Результат = ПолучитьСсылкуПоИдИС(ИмяИС, ИдИС);
			Исключение
				Возврат Результат;	
			КонецПопытки;	
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;	
КонецФункции

Функция ВыполнитьЗапросНаСервере(ТекстЗапроса, param)  
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Для каждого _param Из param Цикл
		ЗначениеПараметра = ПривестиAPI3ОбъектКСсылке(_param.Значение);
		Запрос.УстановитьПараметр(_param.Ключ, ЗначениеПараметра);
	КонецЦикла;
	Возврат ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());	
КонецФункции

// Функция block_c1_call_select_execute
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Структура - Результат выполения функции
//
//DynamicDirective
Функция block_c1_call_select_execute(block_type, node, path, context, block_context)
	Если block_context.Свойство("result") Тогда
		Возврат block_context["result"];
	КонецЕсли;

	begin = ДатаВМиллисекундах();
	Title = "Выполнение запроса в ИС";
	Subtitle = get_prop(block_context, "__id");
	Попытка
		_select_node = workspace_find_input_by_name(node, "select");
		res = block_execute_all_next(_select_node, path + "." + "main", context, block_context);
		ТекстЗапроса = res;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫБРАТЬ", Символы.ВК + "ВЫБРАТЬ");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ";", ";" + Символы.ВК);
		param = block_c1_call_select_get_param(node, path, context, block_context);
		block_check_step(context, block_context);
		
		Если ЗначениеЗаполнено(ТекстЗапроса) Тогда		
			Результат = ВыполнитьЗапросНаСервере(ТекстЗапроса, param) ; 
			block_context.Вставить("result", Результат);
		Иначе
			block_context.Вставить("result", Неопределено);
		КонецЕсли;
	Исключение
		ИнфОбОшибкеБлок = ИнформацияОбОшибке();
		ОшибкаСтруктура = NewExtExceptionСтруктура(ИнфОбОшибкеБлок);
		Если ЭтоСлужебнаяОшибкаБлока(ОшибкаСтруктура.type) Тогда
			ВызватьИсключение ИнфОбОшибкеБлок.Описание; // (исходное исключение)
		КонецЕсли;
        DataSel = Новый Структура;
		DataSel.Вставить("message", get_prop(ОшибкаСтруктура, "message"));
		DataSel.Вставить("detail", get_prop(ОшибкаСтруктура, "detail"));
        end = ДатаВМиллисекундах();
		block_saby_execute_action_write_esoaction(begin, end, Title, Subtitle, DataSel, , 100);		
		ВызватьИсключение ИнфОбОшибкеБлок.Описание;	
	КонецПопытки;
	end = ДатаВМиллисекундах();
	block_saby_execute_action_write_esoaction(begin, end, Title, Subtitle);			
	Возврат block_context["result"];

КонецФункции

// Функция block_c1_call_select_get_value
//
// Параметры:
// node - XML - Текущий обрабатываемый узел XML
//
// Возвращаемое значение:
//  Структура - Результат выполения функции
//
//DynamicDirective
Функция block_c1_call_select_get_value(node)	               
	Возврат node.ПервыйДочерний.ТекстовоеСодержимое;
КонецФункции

// Функция block_c1_call_select_get_param
//
// Параметры:
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Структура - Результат выполения функции
//
//DynamicDirective
Функция block_c1_call_select_get_param(node, path, context, block_context)
	param = Новый Структура;
	РезультатXpath_PARAM = Workspace.ВычислитьВыражениеXpath("./b:value[contains(@name,'PARAM')]", node, размыватель);
	РезультатXpath_FIELD = Workspace.ВычислитьВыражениеXpath("./b:field[contains(@name,'FIELD')]", node, размыватель);
	Пока Истина Цикл
		Узел_PARAM = РезультатXpath_PARAM.ПолучитьСледующий();
		Если Узел_PARAM = Неопределено Тогда Прервать КонецЕсли;
		Узел_FIELD = РезультатXpath_FIELD.ПолучитьСледующий();
		Если Узел_FIELD = Неопределено Тогда Прервать КонецЕсли;
		res = block_execute_all_next(Узел_PARAM, path + "." + "main", context, block_context);
		param_name = Узел_FIELD.ТекстовоеСодержимое;
		param.Вставить(param_name, res);
	КонецЦикла;
	
	Возврат param; 
КонецФункции

//DynamicDirective

Процедура ВыделитьИдентификаторАккаунт(СтрокаЗапроса)
	ИдСБИС = get_prop(СтрокаЗапроса, "ИдСБИС");	
	Если Не ЗначениеЗаполнено(ИдСБИС) Тогда 
		Возврат;
	КонецЕсли;	
	ИдСБИСИтог = "";
	Аккаунт = "";
	МассивСтрокСРазделителем = СтрРазделить82(ИдСБИС, "_");	
	Для Каждого ВыбраннаяСтрока Из МассивСтрокСРазделителем Цикл  
		Если СтрДлина(ВыбраннаяСтрока) <> 36 Тогда 
			Если СтрДлина(ВыбраннаяСтрока) > 0 Тогда
				Аккаунт = ВыбраннаяСтрока;
			КонецЕсли;	
			Продолжить;
		КонецЕсли;	 
		Если ИдСБИСИтог <> "" Тогда
			ИдСБИСИтог = ИдСБИСИтог + "_";
		КонецЕсли;
		ИдСБИСИтог = ИдСБИСИтог + ВыбраннаяСтрока;	
	КонецЦикла;
	СтрокаЗапроса.Вставить("ИдСБИС", ИдСБИСИтог);
	СтрокаЗапроса.Вставить("Аккаунт", Аккаунт);
КонецПроцедуры

//DynamicDirective

Процедура ОбсчитатьЗаписьВыборки(ДочернийУзел, path, context, block_context)
    block_execute_all_next(ДочернийУзел, path, context, block_context, True);
	Строка = block_get_variable(context, block_context["VAR"]);
	ВыделитьИдентификаторАккаунт(Строка);	
	block_context["ROWS"].Добавить(Строка);	
КонецПроцедуры

// BSLLS:FunctionOutParameter-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:Typo-off

Функция ДополнитьЗапросСтатусамиСаби(ТекстЗапроса)   
	Если ИнтеграцияСтатусыДокументов = Неопределено Тогда
		СтатусыДокументовИнициализация();
	КонецЕсли;
	Стенд = ИнтеграцияСтатусыДокументов.Сервис;
	Если Найти(ТекстЗапроса, "&ПоляСабиСтатусов КАК ПоляСабиСтатусов") > 0 И Найти(ТекстЗапроса, "КАК ТаблицаОбъектовИС") > 0 Тогда
		// Замена блока полей
		ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ПоляСабиСтатусов КАК ПоляСабиСтатусов",
		"ЕСТЬNULL(ХранилищеСтатусовSabyСтатус.Значение, -1) КАК СтатусСБИС," + Символы.ПС +
		"	ЕСТЬNULL(ХранилищеСтатусовSabyИд.Значение, """") КАК ИдСБИС," + Символы.ПС +
		"	ЕСТЬNULL(ХранилищеСтатусовSabyТекущийЭтап.Значение, """") КАК АктивныйЭтап"
		);
		
		// Вставка ЛЕВОЕ СОЕДИНЕНИЕ после "КАК ТаблицаОбъектовИС"
		ХранилищеСтатусовSaby = СтатусыДокументовИмяРегистраСвойствОбъектов();
		
		ДопСоединения = Символы.ПС + 
		"	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений." + ХранилищеСтатусовSaby + " КАК ХранилищеСтатусовSabyСтатус" + Символы.ПС +
		"	ПО ТаблицаОбъектовИС.Ссылка = ХранилищеСтатусовSabyСтатус.Объект" + Символы.ПС +
		"		И (ХранилищеСтатусовSabyСтатус.Свойство.Наименование = """ + Стенд + "ДокументСБИС_Статус"")" + Символы.ПС +
		"	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений." + ХранилищеСтатусовSaby + " КАК ХранилищеСтатусовSabyИд" + Символы.ПС +
		"	ПО ТаблицаОбъектовИС.Ссылка = ХранилищеСтатусовSabyИд.Объект" + Символы.ПС +
		"		И (ХранилищеСтатусовSabyИд.Свойство.Наименование = """ + Стенд + "ДокументСБИС_Ид"")" + Символы.ПС +
		"	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений." + ХранилищеСтатусовSaby + " КАК ХранилищеСтатусовSabyТекущийЭтап" + Символы.ПС +
		"	ПО ТаблицаОбъектовИС.Ссылка = ХранилищеСтатусовSabyТекущийЭтап.Объект " +
		"		И (ХранилищеСтатусовSabyТекущийЭтап.Свойство.Наименование = """ + Стенд + "ДокументСБИС_ТекущийЭтап"")";
		
		ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"КАК ТаблицаОбъектовИС",
		"КАК ТаблицаОбъектовИС" + ДопСоединения
		);
	КонецЕсли;
	
	// Замена условий 
	Если Найти(ТекстЗапроса, "&УсловияСабиСтатусов") > 0 Тогда
		ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&УсловияСабиСтатусов",
		"(&СтатусСБИСНеЗаполнено ИЛИ ЕСТЬNULL(ХранилищеСтатусовSabyСтатус.Значение, ""-1"") = &СтатусСБИС)"
		);
	КонецЕсли;	
	
	Возврат ТекстЗапроса; 
	
КонецФункции

// BSLLS:Typo-on
// BSLLS:DuplicateStringLiteral-on
// BSLLS:FunctionOutParameter-on

