
Функция block_c1_calculate_саlc_safe_mode(Алгоритм, ПараметрыАлгоритма = Неопределено)
	Если ПараметрыАлгоритма = Неопределено Тогда
		Результат = ОбщегоНазначения.ВычислитьВБезопасномРежиме(Алгоритм);
	Иначе
		Результат = ОбщегоНазначения.ВычислитьВБезопасномРежиме(Алгоритм, ПараметрыАлгоритма);
	КонецЕсли;
	Результат = ПоместитьВоВременноеХранилище(Результат,Новый УникальныйИдентификатор);
	Возврат Результат 
КонецФункции

//DynamicDirective
Функция block_c1_calculate_calc_value(block_type, node, path, context, block_context)
	Если Не block_context.Свойство("PARAM0") Тогда
		Алгоритм = block_context.NAME;
		АдресРезультата = block_c1_calculate_саlc_safe_mode(Алгоритм);
	Иначе
		НомерПараметра = 1;
		ПараметрыАлгоритма = Новый Структура;
		АргументыВызова = "Параметры."+"PARAM0";
		Если ТипЗнч(get_prop(block_context,"PARAM0")) = Тип("Соответствие") Тогда
			ПарамЗначение = ПолучитьСтруктуруИзСоответствия(block_context["PARAM0"]);	
		Иначе
			ПарамЗначение = block_context["PARAM0"];	
		КонецЕсли;
		ПараметрыАлгоритма.Вставить("PARAM0", ПарамЗначение);
		Пока block_context.Свойство("PARAM" +Строка(НомерПараметра)) Цикл
			Если ТипЗнч(get_prop(block_context,"PARAM"+Строка(НомерПараметра))) = Тип("Соответствие") Тогда
				ПарамЗначение = ПолучитьСтруктуруИзСоответствия(get_prop(block_context,"PARAM"+Строка(НомерПараметра)));	
			Иначе
				ПарамЗначение = get_prop(block_context,"PARAM"+Строка(НомерПараметра));	
			КонецЕсли;	
			ПараметрыАлгоритма.Вставить("PARAM"+Строка(НомерПараметра), ПарамЗначение);
			АргументыВызова = АргументыВызова  + ", Параметры." + "PARAM"+Строка(НомерПараметра);
			НомерПараметра = НомерПараметра + 1;
		КонецЦикла;
		АдресРезультата = block_c1_calculate_саlc_safe_mode(block_context.NAME+"("+АргументыВызова+")", ПараметрыАлгоритма);
	КонецЕсли;  
	Попытка 
		Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	Исключение  
		УдалитьИзВременногоХранилища(АдресРезультата);
		ИнфОбОшибке = ИнформацияОбОшибке();
		ВызватьИсключение NewExtExceptionСтрока(ИнфОбОшибке,,,,add_block_to_dump(block_context));	
	КонецПопытки;
	УдалитьИзВременногоХранилища(АдресРезультата);
	Возврат Результат;
КонецФункции
