
// Функция block_c1_execute3_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Структура - Результат выполнения функции
//
//DynamicDirective
Функция block_c1_execute3_calc_value(block_type, node, path, context, block_context)
	begin = ДатаВМиллисекундах();
	Title = "Выполнение кода";
	Subtitle = get_prop(block_context, "__id");
	required_param = Новый Массив;
	required_param.Добавить("SCRIPT");
	Для Каждого Элем Из block_context Цикл
		Если Найти(Элем.Ключ, "PARAM_NAME") Тогда
			required_param.Добавить(Элем.Ключ);		
		КонецЕсли;
	КонецЦикла;	
	block_check_required_param_in_block_context(required_param, block_context);
	Попытка
		ТекстАлгоритма = block_context.SCRIPT;
		ПараметрыАлгоритма = Новый Структура;
		Индекс = 0;
		Пока Истина Цикл
			КлючИмени = "PARAM_NAME" + Индекс;
			КлючЗначения = "PARAM_VALUE" + Индекс;
			Если block_context.Свойство(КлючИмени) Тогда
				ИмяПараметра = get_prop(block_context, КлючИмени);
				ЗначениеПараметра = get_prop(block_context, КлючЗначения);
				Если ТипЗнч(ЗначениеПараметра) = Тип("Соответствие") Тогда
					ЗначениеПараметра = ПолучитьСтруктуруИзСоответствия(ЗначениеПараметра);
				КонецЕсли;
				ПараметрыАлгоритма.Вставить(ИмяПараметра, ЗначениеПараметра);
				Индекс = Индекс + 1;
			Иначе
				Прервать;
			КонецЕсли;
		КонецЦикла;
		// 
		Если ПараметрыАлгоритма.Количество() = 0 Тогда
			block_c1_execute2_саlc(ТекстАлгоритма);
		Иначе		
			block_c1_execute2_саlc(ТекстАлгоритма, ПараметрыАлгоритма);
		КонецЕсли; 
	Исключение 
		ИнформацияОбОшибкеБлока = ИнформацияОбОшибке();
		ОшибкаБлокаСтруктура = NewExtExceptionСтруктура(ИнформацияОбОшибкеБлока);
		Если ЭтоСлужебнаяОшибкаБлока(ОшибкаБлокаСтруктура.type) Тогда
			ВызватьИсключение ИнформацияОбОшибкеБлока.Описание; // (исходное исключение)
		КонецЕсли;
        DataAction = Новый Структура;
		DataAction.Вставить("message", get_prop(ОшибкаБлокаСтруктура, "message"));
		DataAction.Вставить("detail", get_prop(ОшибкаБлокаСтруктура, "detail"));
        end = ДатаВМиллисекундах();
		block_saby_execute_action_write_esoaction(begin, end, Title, Subtitle, DataAction, , 100);		
		ВызватьИсключение NewExtExceptionСтрока(ИнформацияОбОшибкеБлока,,,,add_block_to_dump(block_context));;	
	КонецПопытки;
	end = ДатаВМиллисекундах();
	block_saby_execute_action_write_esoaction(begin, end, Title, Subtitle);			
	Возврат ПараметрыАлгоритма;

КонецФункции
