
Функция block_c1_execute2_саlc_no_safe_mode(Алгоритм, ПарамАлгоритма = Неопределено) 
	Выполнить(Алгоритм);
	Возврат Неопределено;
КонецФункции

// Функция block_c1_execute2_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Неопределено - Результат выполения функции
//
//DynamicDirective
Функция block_c1_execute2_calc_value(block_type, node, path, context, block_context)
	begin = ДатаВМиллисекундах();
	Title = "Выполнение кода";
	Subtitle = get_prop(block_context, "__id");
	Попытка
		Алгоритм = block_context.NAME;
		ИмяНулевогоПараметра = "PARAM0";
		ИмяПарам = "PARAM";
		Если Не block_context.Свойство(ИмяНулевогоПараметра) Тогда
			Возврат block_c1_execute2_саlc_no_safe_mode(Алгоритм);
		КонецЕсли;	
		НомПараметра = 1;
		ПарамАлгоритма = Новый Структура;
		АргВызова = "ПарамАлгоритма." + ИмяНулевогоПараметра;
		ПараметрЗначение = block_context[ИмяНулевогоПараметра];	
		Если ТипЗнч(get_prop(block_context, ИмяНулевогоПараметра)) = Тип("Соответствие") Тогда
			ПараметрЗначение = ПолучитьСтруктуруИзСоответствия(block_context[ИмяНулевогоПараметра]);	
		КонецЕсли;
		ПарамАлгоритма.Вставить(ИмяНулевогоПараметра, ПараметрЗначение);
		Пока block_context.Свойство(ИмяПарам + Строка(НомПараметра)) Цикл
			ПараметрЗначение = get_prop(block_context, ИмяПарам + Строка(НомПараметра));	
			Если ТипЗнч(get_prop(block_context, ИмяПарам + Строка(НомПараметра))) = Тип("Соответствие") Тогда
				ПараметрЗначение = ПолучитьСтруктуруИзСоответствия(get_prop(block_context, ИмяПарам + Строка(НомПараметра)));	
			КонецЕсли;	
			ПарамАлгоритма.Вставить(ИмяПарам + Строка(НомПараметра), ПараметрЗначение);
			АргВызова = АргВызова  + ", ПарамАлгоритма." + ИмяПарам + Строка(НомПараметра);
			НомПараметра = НомПараметра + 1;
		КонецЦикла;
		block_c1_execute2_саlc_no_safe_mode(Алгоритм + "(" + АргВызова + ")", ПарамАлгоритма);	
		НомПараметра = 0;
		
		Пока block_context.Свойство(ИмяПарам + Строка(НомПараметра)) Цикл
			Если ТипЗнч(get_prop(block_context, ИмяПарам + Строка(НомПараметра))) = Тип("Соответствие") Тогда
				ОбновитьСтруктуру(block_context[ИмяПарам + Строка(НомПараметра)], ПарамАлгоритма[ИмяПарам + Строка(НомПараметра)]);
			КонецЕсли;	
			НомПараметра = НомПараметра + 1;
		КонецЦикла; 
	Исключение
		ИнфОбОшибкеБлока = ИнформацияОбОшибке();
		ОшибкаСтруктура = NewExtExceptionСтруктура(ИнфОбОшибкеБлока);
		Если ЭтоСлужебнаяОшибкаБлока(ОшибкаСтруктура.type) Тогда
			ВызватьИсключение ИнфОбОшибкеБлока.Описание; // (исходное исключение)
		КонецЕсли;
        DataAct = Новый Структура;
		DataAct.Вставить("message", get_prop(ОшибкаСтруктура, "message"));
		DataAct.Вставить("detail", get_prop(ОшибкаСтруктура, "detail"));
        end = ДатаВМиллисекундах();
		block_saby_execute_action_write_esoaction(begin, end, Title, Subtitle, DataAct, , 100);		
		ВызватьИсключение ИнфОбОшибкеБлока.Описание;
	КонецПопытки;
	Возврат Неопределено;
КонецФункции
