
Процедура block_c1_execute2_саlc_safe_mode(Алгоритм, ПараметрыАлгоритма = Неопределено) 
	ОбщийМодульОбщегоНазначения = ОбщийМодульЗначение("ОбщегоНазначения");
	Если ОбщийМодульОбщегоНазначения = Неопределено Тогда
		ВызватьИсключение "Отсутствует общий модуль ОбщегоНазначения";
	КонецЕсли;
	Если ПараметрыАлгоритма = Неопределено Тогда
		ОбщийМодульОбщегоНазначения.ВыполнитьВБезопасномРежиме(Алгоритм);
	Иначе
		ОбщийМодульОбщегоНазначения.ВыполнитьВБезопасномРежиме(Алгоритм,ПараметрыАлгоритма);
	КонецЕсли;
КонецПроцедуры

// Функция block_c1_execute2_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Неопределено - Результат выполения функции
//
//DynamicDirective
Функция block_c1_execute2_calc_value(block_type, node, path, context, block_context)
	begin = ДатаВМиллисекундах();
	Title = "Выполнение кода";
	Subtitle = get_prop(block_context, "__id");
	Попытка
		Если Не block_context.Свойство("PARAM0") Тогда
			Алгоритм = block_context.NAME;
			block_c1_execute2_саlc_safe_mode(Алгоритм);
		Иначе
			НомерПараметра = 1;
			ПараметрыАлгоритма = Новый Структура;
			АргументыВызова = "Параметры." + "PARAM0";
			Если ТипЗнч(get_prop(block_context,"PARAM0")) = Тип("Соответствие") Тогда
				ПарамЗначение = ПолучитьСтруктуруИзСоответствия(block_context["PARAM0"]);	
			Иначе
				ПарамЗначение = block_context["PARAM0"];	
			КонецЕсли;
			ПараметрыАлгоритма.Вставить("PARAM0", ПарамЗначение);
			Пока block_context.Свойство("PARAM" + Строка(НомерПараметра)) Цикл
				Если ТипЗнч(get_prop(block_context, "PARAM" + Строка(НомерПараметра))) = Тип("Соответствие") Тогда
					ПарамЗначение = ПолучитьСтруктуруИзСоответствия(get_prop(block_context, "PARAM" + Строка(НомерПараметра)));	
				Иначе
					ПарамЗначение = get_prop(block_context, "PARAM" + Строка(НомерПараметра));	
				КонецЕсли;	
				ПараметрыАлгоритма.Вставить("PARAM"+Строка(НомерПараметра), ПарамЗначение);
				АргументыВызова = АргументыВызова  + ", Параметры." + "PARAM" + Строка(НомерПараметра);
				НомерПараметра = НомерПараметра + 1;
			КонецЦикла;
			block_c1_execute2_саlc_safe_mode(block_context.NAME + "(" + АргументыВызова + ")", ПараметрыАлгоритма);
		КонецЕсли;	 
	Исключение 
		ИнфОбОшибкеБлока = ИнформацияОбОшибке();
		ОшибкаСтруктура = NewExtExceptionСтруктура(ИнфОбОшибкеБлока);
		Если ЭтоСлужебнаяОшибкаБлока(ОшибкаСтруктура.type) Тогда
			ВызватьИсключение ИнфОбОшибкеБлока.Описание; // (исходное исключение)
		КонецЕсли;
        DataAct = Новый Структура;
		DataAct.Вставить("message", get_prop(ОшибкаСтруктура, "message"));
		DataAct.Вставить("detail", get_prop(ОшибкаСтруктура, "detail"));
        end = ДатаВМиллисекундах();
		block_saby_execute_action_write_esoaction(begin, end, Title, Subtitle, DataAct, , 100);		
		ВызватьИсключение ИнфОбОшибкеБлока.Описание;		
	КонецПопытки;
	end = ДатаВМиллисекундах();
	block_saby_execute_action_write_esoaction(begin, end, Title, Subtitle);			
	Возврат Неопределено;

КонецФункции
