
Процедура block_c1_execute2_саlc_no_safe_mode(Алгоритм, ПарамАлгоритма = Неопределено) 
	Выполнить(Алгоритм);
КонецПроцедуры

// Функция block_c1_execute2_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Неопределено - Результат выполения функции
//
//DynamicDirective
Функция block_c1_execute2_calc_value(block_type, node, path, context, block_context)
	Алгоритм = block_context.NAME;
	ИмяНулевогоПараметра = "PARAM0";
	ИмяПарам = "PARAM";
	Если Не block_context.Свойство(ИмяНулевогоПараметра) Тогда
		block_c1_execute2_саlc_no_safe_mode(Алгоритм);
	Иначе
		НомПараметра = 1;
		ПарамАлгоритма = Новый Структура;
		АргВызова = "ПарамАлгоритма." + ИмяНулевогоПараметра;
		Если ТипЗнч(get_prop(block_context, ИмяНулевогоПараметра)) = Тип("Соответствие") Тогда
			ПараметрЗначение = ПолучитьСтруктуруИзСоответствия(block_context[ИмяНулевогоПараметра]);	
		Иначе
			ПараметрЗначение = block_context[ИмяНулевогоПараметра];	
		КонецЕсли;
		ПарамАлгоритма.Вставить(ИмяНулевогоПараметра, ПараметрЗначение);
		Пока block_context.Свойство(ИмяПарам + Строка(НомПараметра)) Цикл
			Если ТипЗнч(get_prop(block_context, ИмяПарам + Строка(НомПараметра))) = Тип("Соответствие") Тогда
				ПараметрЗначение = ПолучитьСтруктуруИзСоответствия(get_prop(block_context, ИмяПарам + Строка(НомПараметра)));	
			Иначе
				ПараметрЗначение = get_prop(block_context, ИмяПарам + Строка(НомПараметра));	
			КонецЕсли;	
			ПарамАлгоритма.Вставить(ИмяПарам + Строка(НомПараметра), ПараметрЗначение);
			АргВызова = АргВызова  + ", ПарамАлгоритма." + ИмяПарам + Строка(НомПараметра);
			НомПараметра = НомПараметра + 1;
		КонецЦикла;
		block_c1_execute2_саlc_no_safe_mode(Алгоритм + "(" + АргВызова + ")", ПарамАлгоритма);
	КонецЕсли;	
	Возврат Неопределено;
КонецФункции
