
Функция block_c1_execute2_саlc(Алгоритм, Параметры = Неопределено)
	Попытка 
		ОбщийМодульОбщегоНазначения = ОбщийМодульЗначение("ОбщегоНазначения");
		ОбщийМодульОбщегоНазначения.ВыполнитьВБезопасномРежиме("ТЕСТ = 1;");
		ВозможноВыполнитьВБезопасномРежиме = Истина;
	Исключение
		ВозможноВыполнитьВБезопасномРежиме = Ложь;	
	КонецПопытки;
	Если ВозможноВыполнитьВБезопасномРежиме Тогда
		Если Параметры = Неопределено Тогда
			ОбщийМодульОбщегоНазначения.ВыполнитьВБезопасномРежиме(Алгоритм);
		Иначе
			ОбщийМодульОбщегоНазначения.ВыполнитьВБезопасномРежиме(Алгоритм, Параметры);
		КонецЕсли;
	Иначе		
#Область include_IntegrationBlockly_base_Blocks_C1Execute2NoSafeMode
#КонецОбласти	
	КонецЕсли;	
	Saby_ПривестиПеременнуюКДопустимойНаКлиенте(Параметры);
	Возврат Неопределено;
	
КонецФункции

// Функция block_c1_execute2_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Неопределено - Результат выполения функции
//
//DynamicDirective
Функция block_c1_execute2_calc_value(block_type, node, path, context, block_context)
	begin = ДатаВМиллисекундах();
	Title = "Выполнение кода";
	Subtitle = get_subtitle_from_comment_id(node, block_context);
	Попытка
		Алгоритм = block_context.NAME;
		ИмяНулевогоПараметра = "PARAM0";
		ИмяПарам = "PARAM";
		Если Не block_context.Свойство(ИмяНулевогоПараметра) Тогда
			Возврат block_c1_execute2_саlc(Алгоритм);
		КонецЕсли;	
		НомерПараметра = 1;
		ПараметрыАлгоритма = Новый Структура;
		АргументыВызова = "Параметры." + ИмяНулевогоПараметра;
		Если ТипЗнч(get_prop(block_context, ИмяНулевогоПараметра)) = Тип("Соответствие") Тогда
			ПарамЗнач = ПолучитьСтруктуруИзСоответствия(block_context[ИмяНулевогоПараметра]);	
		Иначе
			ПарамЗнач = block_context[ИмяНулевогоПараметра];	
		КонецЕсли;
		ПараметрыАлгоритма.Вставить(ИмяНулевогоПараметра, ПарамЗнач);
		Пока block_context.Свойство(ИмяПарам + Строка(НомерПараметра)) Цикл
			Если ТипЗнч(get_prop(block_context, ИмяПарам + Строка(НомерПараметра))) = Тип("Соответствие") Тогда
				ПарамЗнач = ПолучитьСтруктуруИзСоответствия(get_prop(block_context, ИмяПарам + Строка(НомерПараметра)));	
			Иначе
				ПарамЗнач = get_prop(block_context, ИмяПарам + Строка(НомерПараметра));	
			КонецЕсли;	
			ПараметрыАлгоритма.Вставить(ИмяПарам + Строка(НомерПараметра), ПарамЗнач);
			АргументыВызова = АргументыВызова  + ", Параметры." + ИмяПарам + Строка(НомерПараметра);
			НомерПараметра = НомерПараметра + 1;
		КонецЦикла;
		block_c1_execute2_саlc(Алгоритм + "(" + АргументыВызова + ")", ПараметрыАлгоритма);
		
		НомерПараметра = 0;
		
		Пока block_context.Свойство(ИмяПарам + Строка(НомерПараметра)) Цикл
			Если ТипЗнч(get_prop(block_context, ИмяПарам + Строка(НомерПараметра))) = Тип("Соответствие") Тогда
				ОбновитьСтруктуру(block_context[ИмяПарам + Строка(НомерПараметра)], ПараметрыАлгоритма[ИмяПарам + Строка(НомерПараметра)]);
			КонецЕсли;	
			НомерПараметра = НомерПараметра + 1;
		КонецЦикла; 
	Исключение 
		ИнфОбОшибкеБлока = ИнформацияОбОшибке();
		ОшибкаСтруктура = NewExtExceptionСтруктура(ИнфОбОшибкеБлока);
		Если ЭтоСлужебнаяОшибкаБлока(ОшибкаСтруктура.type) Тогда
			ВызватьИсключение ИнфОбОшибкеБлока.Описание; // (исходное исключение)
		КонецЕсли;
        DataAct = Новый Структура;
		DataAct.Вставить("message", get_prop(ОшибкаСтруктура, "message"));
		DataAct.Вставить("detail", get_prop(ОшибкаСтруктура, "detail"));
        end = ДатаВМиллисекундах();
		block_saby_execute_action_write_esoaction(begin, end, Title, Subtitle, DataAct, , 100);		
		ВызватьИсключение NewExtExceptionСтрока(ИнфОбОшибкеБлока,,,,add_block_to_dump(block_context));;	
	КонецПопытки;
	end = ДатаВМиллисекундах();
	block_saby_execute_action_write_esoaction(begin, end, Title, Subtitle);			
	Возврат Неопределено;

КонецФункции
