
// Функция block_c1_get_uuid_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Структура - Результат выполения функции
//
//DynamicDirective
Функция block_c1_get_uuid_calc_value(block_type, node, path, context, block_context)
	Если ЗначениеЗаполнено(block_context.REF) Тогда
		Возврат Строка(block_context.REF.УникальныйИдентификатор());
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
КонецФункции	

// Функция block_c1_get_uuid_get_value_node
//
// Параметры:
// node - XML - Текущий обрабатываемый узел XML
//
// Возвращаемое значение:
//  Структура - Результат выполения функции
//
//DynamicDirective
Функция block_c1_get_uuid_get_value_node(node)
	Возврат Workspace.ВычислитьВыражениеXpath("./b:value", node, размыватель).ПолучитьСледующий();	
КонецФункции	
