
// Функция block_c1_meta_create_execute
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Структура - Результат выполения функции
//
//DynamicDirective
Функция block_c1_meta_create_execute(block_type, node, path, context, block_context)
	type = block_c1_meta_create_get_node_field(node);
	subtype = workspace_find_input_by_name(node, "SUBTYPE");
	res = block_execute_all_next(subtype, path + "." + "main", context, block_context);
	Результат = Неопределено;
	Если type = "Документ" Тогда
		НовыйОбъект = Новый (type + "Менеджер" + "." + res);
		Результат = НовыйОбъект.СоздатьДокумент();
	ИначеЕсли type = "Справочник" Тогда
		НовыйОбъект = Новый (type + "Менеджер" + "." + res);
		Результат = НовыйОбъект.СоздатьЭлемент();
	ИначеЕсли type = "ПланВидовХарактеристик" Тогда
		НовыйОбъект = Новый ("ПланВидовХарактеристикМенеджер" + "." + res);
		Результат = НовыйОбъект.СоздатьЭлемент();
	ИначеЕсли type = "СправочникГруппа" Тогда
		НовыйОбъект = Новый ("СправочникМенеджер" + "." + res);
		Результат = НовыйОбъект.СоздатьГруппу();
	ИначеЕсли type = "ПланВидовРасчета" Тогда
		НовыйОбъект = Новый ("ПланВидовРасчетаМенеджер" + "." + res);
		Результат = НовыйОбъект.СоздатьВидРасчета();
	ИначеЕсли type = "Задача" Тогда
		НовыйОбъект = Новый ("ЗадачаМенеджер" + "." + res);
		Результат = НовыйОбъект.СоздатьЗадачу();
	Иначе
		ВызватьИсключение NewExtExceptionСтрока(, "Не реализовано создание объекта", type, , add_block_to_dump(block_context))
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Функция block_c1_meta_create_get_node_field
//
// Параметры:
// node - XML - Текущий обрабатываемый узел XML
//
// Возвращаемое значение:
//  Структура - Результат выполения функции
//
//DynamicDirective
Функция block_c1_meta_create_get_node_field(node)	
	Возврат Workspace.ВычислитьВыражениеXpath("./b:field", node, размыватель).ПолучитьСледующий().ТекстовоеСодержимое; 
КонецФункции
