
Функция	ОбновлениеТабличныхЧастейОбъекта(времОбъект, ТекущийОбъект)
	ЗаполненныйОбъект = времОбъект;
	
	ТипыОбъектовСтрокаТЧ = Новый Массив();
	ТипыОбъектовСтрокаТЧ.Добавить(Тип("Структура"));
	ТипыОбъектовСтрокаТЧ.Добавить(Тип("Соответствие"));
	
	// Обходим кеквизиты внешних данных
	Для Каждого ЭлементДанных Из ТекущийОбъект Цикл
		Если ТипЗнч(ЭлементДанных.Значение) <> Тип("Массив") Тогда
			Продолжить;
		КонецЕсли;
		
		// Получаем табличную часть объекта, очищаем её
		ТаблЧастьОбъекта = ЗаполненныйОбъект[ЭлементДанных.Ключ];
		ТаблЧастьОбъекта.Очистить();
		// И заполняем строки новыми данными
		Для Каждого СтрокаТЧ Из ЭлементДанных.Значение Цикл
			// ЗаполнитьЗначенияСвойств не зработает для строки ТЧ объекта, поэтому обход каждого реквизита строки
			Если ТипыОбъектовСтрокаТЧ.Найти(ТипЗнч(СтрокаТЧ)) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ПустаяСтрокаТЧ = ТаблЧастьОбъекта.Добавить();
			Для Каждого РеквизитТЧ Из СтрокаТЧ Цикл
				Если РеквизитТЧ.Ключ = "НомерСтроки" Тогда
					Продолжить;
				КонецЕсли;
				ПустаяСтрокаТЧ[РеквизитТЧ.Ключ] = РеквизитТЧ.Значение;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ЗаполненныйОбъект;
КонецФункции

Функция ОбновитьНаСервере(block_context, ТекущийОбъект)
	Если ТипЗнч(ТекущийОбъект) = Тип("Структура") И ТекущийОбъект.Свойство("Ссылка") Тогда
		Если ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда
			времОбъект = ТекущийОбъект.Ссылка.ПолучитьОбъект();
		Иначе  
			ИмяИС = get_prop(ТекущийОбъект, "ИмяИС"); 
			СтруктураОбъекта = СтрРазделить82(ИмяИС,".");
			времОбъект = СоздатьНовыйОбъект(get_prop(СтруктураОбъекта, 0), get_prop(СтруктураОбъекта, 1));
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(времОбъект, ТекущийОбъект);
		времОбъект = ОбновлениеТабличныхЧастейОбъекта(времОбъект, ТекущийОбъект);
	Иначе	
		времОбъект = ТекущийОбъект;
	КонецЕсли;
	// Если вдруг нужно записать чистые данные, без выполнения методов: ПередЗаписью, ПриЗаписи, ПередУдалением
	// времОбъект.ОбменДанными.Загрузка = Истина;
	УстановитьПривилегированныйРежим(Истина);
	времОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбновлениеДокумента");
	УстановитьПривилегированныйРежим(Ложь);
	времОбъект.Записать();
	Возврат времОбъект.Ссылка;
КонецФункции

// Функция block_c1_meta_update_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Структура - Результат выполения функции
//
// Сохраняем идентичность со структурой кода в Питоне
// BSLLS:UnusedLocalVariable-off
//DynamicDirective
Функция block_c1_meta_update_calc_value(block_type, node, path, context, block_context)
	Попытка
		variable_name = block_context.variable;
		ТекущийОбъект = block_get_variable(context, variable_name);
		СсылкаНаОбъект = ОбновитьНаСервере(block_context, ТекущийОбъект);
		Если ТипЗнч(ТекущийОбъект) = Тип("Структура") Тогда
			ТекущийОбъект = ПолучитьСтруктуруИзОбъекта(СсылкаНаОбъект);
			block_set_variable(context, variable_name, ТекущийОбъект); 
		КонецЕсли;
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ВызватьИсключение(NewExtExceptionСтрока(ИнфОбОшибке, неопределено, неопределено, , add_block_to_dump(block_context)));
	КонецПопытки;	
	Возврат Неопределено;
КонецФункции
// BSLLS:UnusedLocalVariable-on
