Функция ОбновлениеРеквизитовОбъекта(времОбъект, ТекущийОбъект) 
	ЗаполненныйОбъект = времОбъект;
	
	ТипыОбъектовСтрокаТЧ = Новый Массив();
	ТипыОбъектовСтрокаТЧ.Добавить(Тип("Структура"));
	ТипыОбъектовСтрокаТЧ.Добавить(Тип("Соответствие"));
	
	// Обходим кеквизиты внешних данных
	Для Каждого ЭлементДанных Из ТекущийОбъект Цикл
		Если ТипЗнч(ЭлементДанных.Значение) <> Тип("Массив") Тогда
			Попытка
				ЗаполненныйОбъект[ЭлементДанных.Ключ] = ЭлементДанных.Значение;
				Продолжить;
			Исключение
				Продолжить;
			КонецПопытки;
		КонецЕсли;
		
		// Получаем табличную часть объекта, очищаем её
		ТаблЧастьОбъекта = ЗаполненныйОбъект[ЭлементДанных.Ключ];
		Попытка
			ТаблЧастьОбъекта.Очистить();
			ОбновлениеТабличныхЧастейОбъекта(ЭлементДанных, ТаблЧастьОбъекта, ТипыОбъектовСтрокаТЧ);
		Исключение
			Продолжить;
		КонецПопытки; 
	КонецЦикла;
	Возврат ЗаполненныйОбъект;
КонецФункции

Процедура ОбновлениеТабличныхЧастейОбъекта(ЭлементДанных, ТаблЧастьОбъекта, ТипыОбъектовСтрокаТЧ)
	
	// заполняем строки новыми данными
	Для Каждого СтрокаТЧ Из ЭлементДанных.Значение Цикл
		// ЗаполнитьЗначенияСвойств не зработает для строки ТЧ объекта, поэтому обход каждого реквизита строки
		Если ТипыОбъектовСтрокаТЧ.Найти(ТипЗнч(СтрокаТЧ)) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПустаяСтрокаТЧ = ТаблЧастьОбъекта.Добавить();
		Для Каждого РеквизитТЧ Из СтрокаТЧ Цикл
			Если РеквизитТЧ.Ключ = "НомерСтроки" Тогда
				Продолжить;
			КонецЕсли;
			ПустаяСтрокаТЧ[РеквизитТЧ.Ключ] = РеквизитТЧ.Значение;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Функция ОбновитьНаСервере(block_context, ТекущийОбъект)
	Если ТипЗнч(ТекущийОбъект) = Тип("Структура") И ТекущийОбъект.Свойство("Ссылка") Тогда
		Если ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда
			времОбъект = ТекущийОбъект.Ссылка.ПолучитьОбъект();
		Иначе  
			ИмяИС = get_prop(ТекущийОбъект, "ИмяИС"); 
			СтруктураОбъекта = СтрРазделить82(ИмяИС,".");
			времОбъект = СоздатьНовыйОбъект(get_prop(СтруктураОбъекта, 0), get_prop(СтруктураОбъекта, 1));
		КонецЕсли;
		
		времОбъект = ОбновлениеРеквизитовОбъекта(времОбъект, ТекущийОбъект);
	Иначе	
		времОбъект = ТекущийОбъект;
	КонецЕсли;
	// Если вдруг нужно записать чистые данные, без выполнения методов: ПередЗаписью, ПриЗаписи, ПередУдалением
	// времОбъект.ОбменДанными.Загрузка = Истина;
	УстановитьПривилегированныйРежим(Истина);
	времОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбновлениеДокумента");
	УстановитьПривилегированныйРежим(Ложь);

	Если Не block_context.Свойство("posted") Или Не ЗначениеЗаполнено(block_context.posted) Тогда
		времОбъект.Записать();
	ИначеЕсли block_context.posted Тогда
		времОбъект.Записать(РежимЗаписиДокумента.Проведение);
	ИначеЕсли get_prop(ТекущийОбъект, "Проведен", Ложь) Тогда // в Saby не проведен, в 1С - проведен
		времОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	Иначе // нигде не проведен
		времОбъект.Записать();
	КонецЕсли;
	
	Если block_context.Свойство("deletion_mark") И block_context.deletion_mark Тогда
		 времОбъект.УстановитьПометкуУдаления(Истина);
	 КонецЕсли;
	 
	времОбъект.Записать();
	Возврат времОбъект.Ссылка;
КонецФункции

// Функция block_c1_meta_update_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Структура - Результат выполения функции
//
// Сохраняем идентичность со структурой кода в Питоне
// BSLLS:UnusedLocalVariable-off
//DynamicDirective
Функция block_c1_meta_update_calc_value(block_type, node, path, context, block_context)
	begin = ДатаВМиллисекундах();
	Title = "Запись объекта метаданных";
	Попытка
		variable_name = block_context.variable;
		ТекущийОбъект = block_get_variable(context, variable_name);
		Subtitle = get_prop(ТекущийОбъект, "ИмяИС");
		СсылкаНаОбъект = ОбновитьНаСервере(block_context, ТекущийОбъект);
		Если ТипЗнч(ТекущийОбъект) = Тип("Структура") Тогда
			ТекущийОбъект = ПолучитьСтруктуруИзОбъекта(СсылкаНаОбъект);
			block_set_variable(context, variable_name, ТекущийОбъект); 
		КонецЕсли;
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();  
		ОшибкаСтруктура = NewExtExceptionСтруктура(ИнфОбОшибке);
		Если ЭтоСлужебнаяОшибкаБлока(ОшибкаСтруктура.type) Тогда
			ВызватьИсключение ИнфОбОшибке.Описание; // (исходное исключение)
		КонецЕсли;
        Data = Новый Структура;
		Data.Вставить("message", get_prop(ОшибкаСтруктура, "message"));
		Data.Вставить("detail", get_prop(ОшибкаСтруктура, "detail"));
        end = ДатаВМиллисекундах();
		block_saby_execute_action_write_esoaction(begin, end, Title, Subtitle, Data, , 100);		
		ВызватьИсключение(NewExtExceptionСтрока(ИнфОбОшибке, неопределено, неопределено, , add_block_to_dump(block_context)));
	КонецПопытки;	
	end = ДатаВМиллисекундах();
	block_saby_execute_action_write_esoaction(begin, end, Title, Subtitle);			
	Возврат Неопределено;
КонецФункции

// BSLLS:UnusedLocalVariable-on
