
// Функция block_c1_meta_create_execute
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Структура - Результат выполения функции
//
//DynamicDirective
Функция block_c1_meta_create_execute(block_type, node, path, context, block_context)
	type = block_c1_meta_create_get_node_field(node);
	subtype = workspace_find_input_by_name(node, "SUBTYPE");
	res = block_execute_all_next(subtype, path + "." + "main", context, block_context);
	Попытка 
		Результат = block_c1_meta_create_get_new_object(type, res);
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ВызватьИсключение(NewExtExceptionСтрока(ИнфОбОшибке, Неопределено, Неопределено,, add_block_to_dump(block_context)));
	КонецПопытки;	

	Возврат Результат;
КонецФункции

// Функция block_c1_meta_create_get_node_field
//
// Параметры:
// node - XML - Текущий обрабатываемый узел XML
//
// Возвращаемое значение:
//  Структура - Результат выполения функции
//
//DynamicDirective
Функция block_c1_meta_create_get_node_field(node)	
	Возврат Workspace.ВычислитьВыражениеXpath("./b:field", node, размыватель).ПолучитьСледующий().ТекстовоеСодержимое; 
КонецФункции

&НаСервере
Функция СоздатьНовыйОбъект(Вид, Тип) 
	Результат = Неопределено;
	Если Вид = "Документ" Тогда
		НовыйОбъект = Новый (Вид + "Менеджер" + "." + Тип);
		Результат = НовыйОбъект.СоздатьДокумент();
	ИначеЕсли Вид = "Справочник" Тогда
		НовыйОбъект = Новый (Вид + "Менеджер" + "." + Тип);
		Результат = НовыйОбъект.СоздатьЭлемент();
	ИначеЕсли Вид = "ПланВидовХарактеристик" Тогда
		НовыйОбъект = Новый (Вид + "Менеджер" + "." + Тип);
		Результат = НовыйОбъект.СоздатьЭлемент();
	ИначеЕсли Вид = "СправочникГруппа" Тогда
		НовыйОбъект = Новый ("СправочникМенеджер" + "." + Тип);
		Результат = НовыйОбъект.СоздатьГруппу();
	ИначеЕсли Вид = "ПланВидовРасчета" Тогда
		НовыйОбъект = Новый (Вид + "Менеджер" + "." + Тип);
		Результат = НовыйОбъект.СоздатьВидРасчета();
	ИначеЕсли Вид = "Задача" Тогда
		НовыйОбъект = Новый (Вид + "Менеджер" + "." + Тип);
		Результат = НовыйОбъект.СоздатьЗадачу();
	Иначе
		ВызватьИсключение "Не реализовано создание объекта";
	КонецЕсли;
    Возврат Результат;
КонецФункции

&НаСервере
Функция block_c1_meta_create_get_new_object(type, res)  
	Попытка
		Результат = СоздатьНовыйОбъект(type, res);
	Исключение   
		ИнфОбОшибке = ИнформацияОбОшибке();
		ВызватьИсключение ИнфОбОшибке.Описание;	
	КонецПопытки;
	Результат = ПолучитьСтруктуруИзОбъекта(Результат);
	Результат.Вставить("ИдИС", Строка(Новый УникальныйИдентификатор()));
	Результат.Вставить("ИмяИС", type + "." + res);
	
	Возврат Результат;
КонецФункции
