
// Функция block_c1_meta_create_execute
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Структура - Результат выполения функции
//
//DynamicDirective
Функция block_c1_meta_create_execute(block_type, node, path, context, block_context)
	begin = ДатаВМиллисекундах();
	Title = "Создание объекта метаданных";
	type = get_prop(block_context, "TYPE");
	subtype = get_prop(block_context, "SUBTYPE");
	Subtitle = Строка(type) + "." + Строка(subtype);
	data = get_prop(block_context, "DATA");
	Попытка 
		Результат = block_c1_meta_create_get_new_object(type, subtype, data);
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ОшибкаСтруктура = NewExtExceptionСтруктура(ИнфОбОшибке);
		Если ЭтоСлужебнаяОшибкаБлока(ОшибкаСтруктура.type) Тогда
			ВызватьИсключение ИнфОбОшибке.Описание; // (исходное исключение)
		КонецЕсли;
        Data = Новый Структура;
		Data.Вставить("message", get_prop(ОшибкаСтруктура, "message"));
		Data.Вставить("detail", get_prop(ОшибкаСтруктура, "detail"));
        end = ДатаВМиллисекундах();
		block_saby_execute_action_write_esoaction(begin, end, Title, Subtitle, Data, , 100);		
		ВызватьИсключение(NewExtExceptionСтрока(ИнфОбОшибке, Неопределено, Неопределено,, add_block_to_dump(block_context)));
	КонецПопытки;	
	end = ДатаВМиллисекундах();
	block_saby_execute_action_write_esoaction(begin, end, Title, Subtitle);			

	Возврат Результат;

КонецФункции

// Функция block_c1_meta_create_get_node_field
//
// Параметры:
// node - XML - Текущий обрабатываемый узел XML
//
// Возвращаемое значение:
//  Структура - Результат выполения функции
//
//DynamicDirective
Функция block_c1_meta_create_get_node_field(node)	
	Возврат Workspace.ВычислитьВыражениеXpath("./b:field", node, размыватель).ПолучитьСледующий().ТекстовоеСодержимое; 
КонецФункции

&НаСервере
Функция СоздатьНовыйОбъект(Вид, Тип, Основание = Неопределено) 
	Результат = Неопределено;
	Если Вид = "Документ" Тогда
		НовыйОбъект = Новый (Вид + "Менеджер" + "." + Тип);
		Результат = НовыйОбъект.СоздатьДокумент();
		Если ЗначениеЗаполнено(Основание) Тогда 
			Результат.Заполнить(Основание);
		КонецЕсли;
	ИначеЕсли Вид = "Справочник" Тогда
		НовыйОбъект = Новый (Вид + "Менеджер" + "." + Тип);
		Результат = НовыйОбъект.СоздатьЭлемент();
	ИначеЕсли Вид = "ПланВидовХарактеристик" Тогда
		НовыйОбъект = Новый (Вид + "Менеджер" + "." + Тип);
		Результат = НовыйОбъект.СоздатьЭлемент();
	ИначеЕсли Вид = "СправочникГруппа" Тогда
		НовыйОбъект = Новый ("СправочникМенеджер" + "." + Тип);
		Результат = НовыйОбъект.СоздатьГруппу();
	ИначеЕсли Вид = "ПланВидовРасчета" Тогда
		НовыйОбъект = Новый (Вид + "Менеджер" + "." + Тип);
		Результат = НовыйОбъект.СоздатьВидРасчета();
	ИначеЕсли Вид = "Задача" Тогда
		НовыйОбъект = Новый (Вид + "Менеджер" + "." + Тип);
		Результат = НовыйОбъект.СоздатьЗадачу();
	Иначе
		ВызватьИсключение "Не реализовано создание объекта";
	КонецЕсли;
    Возврат Результат;
КонецФункции

&НаСервере
Функция block_c1_meta_create_get_new_object(type, res, data = Неопределено)  
	Попытка
		Результат = СоздатьНовыйОбъект(type, res, data);
	Исключение   
		ИнфОбОшибке = ИнформацияОбОшибке();
		ВызватьИсключение ИнфОбОшибке.Описание;	
	КонецПопытки;
	Результат = ПолучитьСтруктуруИзОбъекта(Результат);
	Результат.Вставить("ИдИС", Строка(Новый УникальныйИдентификатор()));
	Результат.Вставить("ИмяИС", type + "." + res);
	
	Возврат Результат;
КонецФункции
