
Функция ОбновитьНаСервере(block_context, context_variables)
	variable_name = block_context.variable;
	ТекущийОбъект = context_variables[variable_name];
	Если ТипЗнч(ТекущийОбъект) = Тип("Структура") И ТекущийОбъект.Свойство("Ссылка") Тогда
		времОбъект = ТекущийОбъект.Ссылка.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(времОбъект, ТекущийОбъект);
	Иначе
		времОбъект = ТекущийОбъект;
	КонецЕсли;
		// Если вдруг нужно записать чистые данные, без выполнения методов: ПередЗаписью, ПриЗаписи, ПередУдалением
		// времОбъект.ОбменДанными.Загрузка = Истина;
		УстановитьПривилегированныйРежим(Истина);
		времОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбновлениеДокумента");
		УстановитьПривилегированныйРежим(Ложь);
		времОбъект.Записать();
	Возврат Неопределено;
КонецФункции

// Функция block_c1_meta_update_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Структура - Результат выполения функции
//
// Сохраняем идентичность со структурой кода в Питоне
// BSLLS:UnusedLocalVariable-off
//DynamicDirective
Функция block_c1_meta_update_calc_value(block_type, node, path, context, block_context)
	variable_name = block_context.variable;
	context_variables = context_variables_get(context);
	Попытка
		ОбновитьНаСервере(block_context, context_variables);
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		ВызватьИсключение(NewExtExceptionСтрока(ИнфОбОшибке, неопределено, неопределено, , add_block_to_dump(block_context)));
	КонецПопытки;	
	Возврат Неопределено;
КонецФункции
// BSLLS:UnusedLocalVariable-on
