
// Функция block_c1_ref_from_id_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Структура - Результат выполения функции
//
//DynamicDirective
Функция block_c1_ref_from_id_calc_value(block_type, node, path, context, block_context)

	Если block_context.Свойство("ИмяИС") И block_context.Свойство("ИдИС") И
		ЗначениеЗаполнено(block_context.ИмяИС) И ЗначениеЗаполнено(block_context.ИдИС) Тогда			
		Попытка
			СсылкаНаобъект = ПолучитьСсылкуПоИдИС(block_context.ИмяИС, block_context.ИдИС);
			Возврат СсылкаНаобъект;  
		Исключение
			Возврат Неопределено;
		КонецПопытки;
	КонецЕсли;
КонецФункции
