
Процедура ВыполнитьЗаписьНаСервере(block_context)
	записатьЗапись = Истина;
	ОтборПоследних = Новый Структура();
	Если block_context.TYPE = "РегистрыСведений" Тогда
		Менеджер = РегистрыСведений;
	ИначеЕсли block_context.TYPE = "РегистрыНакопления" Тогда
		Менеджер = РегистрыНакопления;
	//ИначеЕсли block_context.TYPE = "РегистрыБухгалтерии" Тогда
	//ИначеЕсли block_context.TYPE = "РегистрыРасчета" Тогда
	КонецЕсли;
	НаборЗаписей = Менеджер[block_context.SUBTYPE].СоздатьНаборЗаписей();
	Для Каждого ОтборЗаписей из block_context.select Цикл
		НаборЗаписей.Отбор[ОтборЗаписей.Ключ].Установить(ОтборЗаписей.Значение);
		Если block_context.record.Получить(ОтборЗаписей.Ключ) = Неопределено Тогда
			block_context.record.Вставить(ОтборЗаписей.Ключ,ОтборЗаписей.Значение);
		КонецЕсли;
		ОтборПоследних.Вставить(ОтборЗаписей.Ключ,ОтборЗаписей.Значение);
	КонецЦикла;
	Если block_context.TYPE = "РегистрыСведений" Тогда
		ПериодичностьРС = НаборЗаписей.метаданные().ПериодичностьРегистраСведений;
		Если ПериодичностьРС = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда
		ИначеЕсли ПериодичностьРС = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.День Тогда
			Если Не ЗначениеЗаполнено(block_context.select["Период"]) Тогда
				block_context.select["Период"] = ТекущаяДата();
			КонецЕсли;
			Если Не ЗначениеЗаполнено(block_context.record["Период"]) Тогда
				block_context.record["Период"] = ТекущаяДата();
			КонецЕсли;
			//получить последнюю запись и сверить с новой
			срезПоследних = Менеджер[block_context.SUBTYPE].срезПоследних(block_context.select["Период"],ОтборПоследних);
			Если срезПоследних.количество()>0 Тогда
				ПоследняяЗапись = срезПоследних[срезПоследних.количество()-1];
				записатьЗапись = Ложь;
				Для Каждого Поле из block_context.record Цикл
					Попытка
						Если Поле.Значение <> ПоследняяЗапись[Поле.Ключ] Тогда
							записатьЗапись = Истина;
							Прервать;
						КонецЕсли;
					Исключение
					КонецПопытки;
				КонецЦикла;
			КонецЕсли;
		Иначе	// Год, Квартал, Месяц, ПозицияРегистратора, Секунда
			ВызватьИсключение "В блоке c1_register_update не поддерживается ПериодичностьРегистраСведений = "+ ПериодичностьРС;
		КонецЕсли;
	КонецЕсли;
	Если записатьЗапись Тогда
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
		Иначе
			НоваяЗапись = НаборЗаписей[НаборЗаписей.Количество() - 1]
		КонецЕсли;
		Для Каждого Поле из block_context.record Цикл
			Попытка
				НоваяЗапись[Поле.Ключ] = Поле.Значение;
			Исключение
			КонецПопытки;
		КонецЦикла;
		Попытка
			НаборЗаписей.Записать();
		Исключение
			ИнфОбОшибке = ИнформацияОбОшибке();
			ВызватьИсключение(NewExtExceptionСтрока(ИнфОбОшибке, неопределено, неопределено,, add_block_to_dump(block_context)));
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры	

//DynamicDirective
Функция block_c1_register_update_calc_value(block_type, node, path, context, block_context)
	ВыполнитьЗаписьНаСервере(block_context);
	Возврат Неопределено;
КонецФункции
