
Процедура ВыполнитьЗаписьНаСервере(block_context)
	записатьЗапись = Истина;
	ОтборПоследних = Новый Структура();
	
	Менеджер = ТипМенеджераРегистра(block_context.TYPE);
	
	НаборЗаписей = Менеджер[block_context.SUBTYPE].СоздатьНаборЗаписей();
	
	ЗаполнитьОтборПоследних(block_context, ОтборПоследних, НаборЗаписей);
	
	записатьЗапись = ПроверитьНаПериодичностьИПерезапись(block_context, Менеджер, НаборЗаписей, ОтборПоследних);
	
	Если записатьЗапись Тогда
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
		Иначе
			НоваяЗапись = НаборЗаписей[НаборЗаписей.Количество() - 1]
		КонецЕсли;
		Для Каждого Поле из block_context.record Цикл
			Попытка
				НоваяЗапись[Поле.Ключ] = Поле.Значение;
// Нужно просто выполнить код
// BSLLS:MissingCodeTryCatchEx-off
			Исключение
			КонецПопытки;
// BSLLS:MissingCodeTryCatchEx-on				
		КонецЦикла;
		Попытка
			НаборЗаписей.Записать();
		Исключение
			ИнфОбОшибке = ИнформацияОбОшибке();
			ВызватьИсключение(NewExtExceptionСтрока(ИнфОбОшибке, неопределено, неопределено,, add_block_to_dump_onserver(block_context)));
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

Функция ПроверитьНаПериодичностьИПерезапись(block_context, Менеджер, НаборЗаписей, ОтборПоследних)
	записатьЗапись = Истина;
	Если block_context.TYPE = "РегистрыСведений" Тогда
		ПериодичностьРС = НаборЗаписей.метаданные().ПериодичностьРегистраСведений;
		Если ПериодичностьРС = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда
			записатьЗапись = Истина;
		ИначеЕсли ПериодичностьРС = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.День Тогда
			записатьЗапись = ПроверитьПериодичностьДень(block_context, Менеджер, НаборЗаписей, ОтборПоследних);
			
		Иначе	// Год, Квартал, Месяц, ПозицияРегистратора, Секунда
			ВызватьИсключение "В блоке c1_register_update не поддерживается ПериодичностьРегистраСведений = "+ ПериодичностьРС;
		КонецЕсли;
	КонецЕсли;
	Возврат записатьЗапись;
КонецФункции

Функция ПроверитьПериодичностьДень(block_context, Менеджер, НаборЗаписей, ОтборПоследних)
	записатьЗапись = Истина;
	_Период = "Период";
	Если Не ЗначениеЗаполнено(block_context.select[_Период]) Тогда
		block_context.select[_Период] = ТекущаяДатаСеанса();
	КонецЕсли;
	Если Не ЗначениеЗаполнено(block_context.record[_Период]) Тогда
		block_context.record[_Период] = ТекущаяДатаСеанса();
	КонецЕсли;
	//получить последнюю запись и сверить с новой
	срезПоследних = Менеджер[block_context.SUBTYPE].срезПоследних(block_context.select[_Период], ОтборПоследних);
	Если срезПоследних.количество()>0 Тогда
		ПоследняяЗапись = срезПоследних[срезПоследних.количество()-1];
		записатьЗапись = Ложь;
		Для Каждого Поле из block_context.record Цикл
			Попытка
				Если Поле.Значение <> ПоследняяЗапись[Поле.Ключ] Тогда
					записатьЗапись = Истина;
					Прервать;
				КонецЕсли;
// Нужно просто выполнить код
// BSLLS:MissingCodeTryCatchEx-off
			Исключение
			КонецПопытки;
// BSLLS:MissingCodeTryCatchEx-on				
		КонецЦикла;	
	КонецЕсли;
	Возврат записатьЗапись;
КонецФункции

Функция ТипМенеджераРегистра(TYPE)
	Если TYPE = "РегистрыСведений" Тогда
		Менеджер = РегистрыСведений;
	Иначе
		Если TYPE = "РегистрыНакопления" Тогда
			Менеджер = РегистрыНакопления;
		// ИначеЕсли block_context.TYPE = "РегистрыБухгалтерии" Тогда
		// ИначеЕсли block_context.TYPE = "РегистрыРасчета" Тогда
		КонецЕсли;
	КонецЕсли;
    Возврат Менеджер;
КонецФункции

Процедура ЗаполнитьОтборПоследних(block_context, ОтборПоследних, НаборЗаписей)
	Для Каждого ОтборЗаписей из block_context.select Цикл
		НаборЗаписей.Отбор[ОтборЗаписей.Ключ].Установить(ОтборЗаписей.Значение);
		Если block_context.record.Получить(ОтборЗаписей.Ключ) = Неопределено Тогда
			block_context.record.Вставить(ОтборЗаписей.Ключ,ОтборЗаписей.Значение);
		КонецЕсли;
		ОтборПоследних.Вставить(ОтборЗаписей.Ключ,ОтборЗаписей.Значение);
	КонецЦикла;
		
КонецПроцедуры	


// Функция block_c1_strip_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Неопределено - Результат выполения функции
//
//DynamicDirective
Функция block_c1_register_update_calc_value(block_type, node, path, context, block_context)
	ВыполнитьЗаписьНаСервере(block_context);
	Возврат Неопределено;
КонецФункции
