
// Функция block_c1_ref_to_obj_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Структура - Результат выполения функции
//
//DynamicDirective
Функция block_c1_ref_to_obj_calc_value(block_type, node, path, context, block_context)
	СсылкаНаОбъект	= block_context["LINK"];
	Если Не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Возврат неопределено;
	КонецЕсли;
	ИмяСБИС = get_prop(block_context, "SABY_TYPE");
	СтруктураОбъекта = Api3Object(СсылкаНаОбъект, ИмяСБИС); 		
	Возврат СтруктураОбъекта;
КонецФункции
