
// Функция block_c1_ref_from_api3_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Структура - Результат выполения функции
//
//DynamicDirective
Функция block_c1_ref_from_api3_calc_value(block_type, node, path, context, block_context)
	Если get_prop(block_context.API3,"ИдИС") = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если Найти(block_context.API3["ИмяИС"], ".") > 0 Тогда
		ИмяИС = block_context.API3["ИмяИС"];
	Иначе
		ИмяИС = block_context.API3["ТипИС"] + "." + block_context.API3["ИмяИС"];
	КонецЕсли;
	Попытка
		СсылкаНаобъект = ПолучитьСсылкуПоИдИС(ИмяИС, block_context.API3["ИдИС"]);
		Возврат СсылкаНаобъект;  
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции
