Функция block_c1_ref_calc_value(block_type, node, path, context, block_context)
	ИмяИС = ?(block_context["type"] = "Документ", "Документы", block_context["type"]);
	ИмяИС = ?(ИмяИС = "Справочник", "Справочники", ИмяИС);
	ИмяИС = ?(ИмяИС = "Перечисление", "Перечисления", ИмяИС);
	ИмяИС = ИмяИС + "." + block_context["subtype"]; 
	Попытка
		СсылкаНаобъект = ПолучитьСсылкуПоИдИС(ИмяИС, block_context["uuid"]);
		Возврат СсылкаНаобъект;  
	Исключение
		Возврат Неопределено;
	КонецПопытки;	
КонецФункции

