
// Функция block_c1_strip_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Неопределено - Результат выполения функции
//
//DynamicDirective
Функция block_c1_strip_calc_value(block_type, node, path, context, block_context)
	_Строка = get_prop(block_context, "STRING");
	Если _Строка <> Неопределено Тогда
		Возврат СокрЛП(Строка(_Строка));	
	КонецЕсли;
	Возврат Неопределено;	
КонецФункции	
