
//DynamicDirective

Процедура ИнициализацияКэшаОперации()
	КэшОперации = Новый Структура;
	КэшОперации.Вставить("МаксимальныйРазмерКэша", 1000); // Ограничиваем кэш
	КэшОперации.Вставить("Значение", Новый Соответствие);
КонецПроцедуры

//DynamicDirective

Функция block_cache_read_calc_value(block_type, node, path, context, block_context)

	Если НЕ ЗначениеЗаполнено(КэшОперации) Тогда
		ИнициализацияКэшаОперации();
	КонецЕсли;

	// Вычисляем отдельно ключ
	_select_node = workspace_find_input_by_name(node, "PATH");
	Ключ = block_execute_all_next(_select_node, path + "." + "main", context, block_context);
	Если ТипЗнч(Ключ) <> Тип("Строка") Тогда
		Текст = "В блоке 'Прочитать из кэша (cache_read)' тип ключа должен быть строка!";
		ВызватьИсключение Текст;
	КонецЕсли;
	ЭлементКэша = get_prop(КэшОперации.Значение, Ключ);

	// Если новый ключ - вычисляем значение при отсутствии и добавляем его в кэш
	Если НЕ ЗначениеЗаполнено(ЭлементКэша) Тогда

		// Вычисляем отдельно значение для кэша
		_select_node = workspace_find_input_by_name(node, "VALUE");
		ЗначениеДляКэша = block_execute_all_next(_select_node, path + "." + "main", context, block_context);

		// Добавляем в кэш новое значение
		ЗаписатьВКэшОперации(КэшОперации, ЭлементКэша, Ключ, ЗначениеДляКэша);

	// Ключ есть в кэше - увеличиваем его частоту использования
	Иначе

		ЭлементКэша.Частота = ЭлементКэша.Частота + 1; // Новая частота

	КонецЕсли;

	Возврат ЭлементКэша.Значение;

КонецФункции

//DynamicDirective

Процедура ЗаписатьВКэшОперации(КэшОперации, ЭлементКэша, Ключ, ЗначениеДляКэша)
	// При переполнении кэша удаляем 10% старых (самых редкоиспользуемых) значений
		Если КэшОперации.Значение.Количество() >= КэшОперации.МаксимальныйРазмерКэша Тогда
			Частоты = Новый СписокЗначений;
			Для Каждого ЭлементКэша Из КэшОперации.Значение Цикл
				Частоты.Добавить(ЭлементКэша.Значение.Частота, ЭлементКэша.Ключ);
			КонецЦикла;
			Частоты.СортироватьПоЗначению(НаправлениеСортировки.Возр); // Сортируем по увеличению частоты исользования
			// Удаляем 10% редкоиспользуемых значений кэша
			ИндМакс = Цел(Частоты.Количество() * 0.1);
			Для Инд = 0 По ИндМакс Цикл
				КэшОперации.Значение.Удалить(Частоты[Инд].Представление);
			КонецЦикла;
		КонецЕсли;

		// Добавляем в кэш новое значение
		ЭлементКэша = Новый Структура;
		ЭлементКэша.Вставить("Частота", 1);
		ЭлементКэша.Вставить("Значение", ЗначениеДляКэша);
		КэшОперации.Значение.Вставить(Ключ, ЭлементКэша);
КонецПроцедуры	

