
// Функция block_string_to_date_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Строка - Результат выполения функции
//
//DynamicDirective
Функция block_date_to_string_calc_value(block_type, node, path, context, block_context)
	Значение = get_prop(block_context, "VALUE");
	СтрФормат = get_prop(block_context, "TEMPLATE");
	Попытка
		Возврат ФорматироватьДатуПоШаблону(Значение, СтрФормат);		
	Исключение
		Инфо = ИнформацияОбОшибке();
		Если Инфо.Код = "1" Тогда
			Ошибка = NewExtExceptionСтрока(, "Неверный формат",
				"Значение " + Строка(Значение) + " не может быть преобразовано к дате" + Символы.ПС + "(format)", "format_to_date");
			ВызватьИсключение Ошибка;
		Иначе
			Ошибка = NewExtExceptionСтрока(, "Неверный формат",
				"Значение " + Строка(Значение) + " не соответствует формату " + СтрФормат + Символы.ПС + "(format)", "format_to_date");
			ВызватьИсключение Ошибка;
		КонецЕсли;
	КонецПопытки;
КонецФункции

// Форматирует дату в строку по шаблону в формате ISO
//
// Параметры:
// Дата - Дата
// ИсходныйШаблон - Строка - Шаблон
//
// Возвращаемое значение:
//  Строка - Результат выполения функции
//
//DynamicDirective
Функция ФорматироватьДатуПоШаблону(Дата, ИсходныйШаблон)
	
	Если ТипЗнч(Дата) <> Тип("Дата") Тогда
		Ошибка = NewExtExceptionСтрока(, "Неверный формат",
			"Значение " + Строка(Дата) + " не может быть преобразовано к дате" + Символы.ПС + "(format)", "format_to_date");
		ВызватьИсключение Ошибка;
	КонецЕсли;
	
	// BSLLS:DuplicatedInsertionIntoCollection-off Соответствие различает регистр
	Рез = Новый Соответствие;
	Рез.Вставить("a", "ddd");
	Рез.Вставить("A", "dddd");
	Рез.Вставить("d", "dd");
	Рез.Вставить("b", "MMM");
	Рез.Вставить("B", "MMMM");
	Рез.Вставить("m", "MM");
	Рез.Вставить("y", "yy");
	Рез.Вставить("Y", "yyyy");
	Рез.Вставить("H", "HH");
	Рез.Вставить("I", "hh");
	Рез.Вставить("p", "tt");
	Рез.Вставить("M", "mm");
	Рез.Вставить("S", "ss");
	Рез.Вставить("f", ""); // Микросекунд нет в 1С
	Рез.Вставить("z", ""); // Сдвиг, нет в 1С
	Рез.Вставить("Z", ""); // UTC, GMT
	Рез.Вставить("U", ""); // Номер недели, начинаем с ВС
	Рез.Вставить("c", ""); // Локальные дата и время
	Рез.Вставить("x", ""); // Локальная дата
	Рез.Вставить("X", ""); // Локальное время
	Рез.Вставить("", "%");
	// BSLLS:DuplicatedInsertionIntoCollection-on
	ПозицияФормат = 1;
	Результат = "";
	Пока ПозицияФормат <= СтрДлина(ИсходныйШаблон) Цикл
		Символ = Сред(ИсходныйШаблон, ПозицияФормат, 1);
		Если Символ = "%" Тогда
			ПозицияФормат = ПозицияФормат + 1;
			Код = Сред(ИсходныйШаблон, ПозицияФормат, 1);
			Если Рез.Получить(Код) = Неопределено Тогда
				Ошибка = NewExtExceptionСтрока(, "Неверный формат",
					"Значение " + Строка(Дата) + " не соответствует формату " + ИсходныйШаблон + Символы.ПС + "(format)",
					"format_to_date");
				ВызватьИсключение Ошибка;
			КонецЕсли;
			Результат = Результат + Формат(Дата, "ДФ=" + Рез[Код]);
		Иначе
			Результат = Результат + Символ;
		КонецЕсли;
		ПозицияФормат = ПозицияФормат + 1;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
