
// Функция block_esd_order_for_shipping
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Соответствие - Результат выполения функции
//
//DynamicDirective
Функция block_esd_order_for_shipping(block_type, node, path, context, block_context)
	param = Новый Соответствие;
	СкопироватьКонтекстБлокаЭПД(param, block_context);
	Возврат param;
КонецФункции

// Функция block_esd_route_point
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Соответствие - Результат выполения функции
//
//DynamicDirective
Функция block_esd_route_point(block_type, node, path, context, block_context)
	param = Новый Соответствие;
	СкопироватьКонтекстБлокаЭПД(param, block_context);
	Возврат param;
КонецФункции

Процедура СкопироватьКонтекстБлокаЭПД(РезультатРасчетаБлока, КонтекстБлока)
	ПараметрыЭкранированияИерархииЭПД = ПараметрыЭкранированияИерархииЭПД();
	
	Для Каждого ЭлементКонтекстаБлока Из КонтекстБлока Цикл
		Ключ = ЭлементКонтекстаБлока.Ключ;
		Если Лев(Ключ, 1) = "_" Или ЭлементКонтекстаБлока.Значение = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ЭлементЭкранирования Из ПараметрыЭкранированияИерархииЭПД Цикл
			Ключ = СтрЗаменить(Ключ, ЭлементЭкранирования.Значение, ЭлементЭкранирования.Ключ);
		КонецЦикла;
		
		РезультатРасчетаБлока.Вставить(Ключ, ЭлементКонтекстаБлока.Значение);
	КонецЦикла;
КонецПроцедуры
