Функция block_execute_workspace_calc_value(block_type, node, path, context, block_context)
	Если Не block_context.Свойство("PARAM_VALUE_0") Тогда
		Результат = ОбщегоНазначения.ВычислитьВБезопасномРежиме(block_context.NAME);
	Иначе
		НомерПараметра = 1;
		Параметры = Новый Структура;
		АргументыВызова = "Параметры."+block_context["PARAM_NAME_0"];
		Если ТипЗнч(get_prop(block_context,"PARAM_VALUE_0")) = Тип("Соответствие") Тогда
			ПарамЗначение = ПолучитьСтруктуруИзСоответствия(block_context["PARAM_VALUE_0"]);	
		Иначе
			ПарамЗначение = block_context["PARAM_VALUE_0"];	
		КонецЕсли;
		Параметры.Вставить(block_context["PARAM_NAME_0"], ПарамЗначение);
		Пока block_context.Свойство("PARAM_NAME_" +Строка(НомерПараметра)) Цикл
			Если ТипЗнч(get_prop(block_context,"PARAM_VALUE_"+Строка(НомерПараметра))) = Тип("Соответствие") Тогда
				ПарамЗначение = ПолучитьСтруктуруИзСоответствия(get_prop(block_context,"PARAM_VALUE_"+Строка(НомерПараметра)));	
			Иначе
				ПарамЗначение = get_prop(block_context,"PARAM_VALUE_"+Строка(НомерПараметра));	
			КонецЕсли;	
			Параметры.Вставить(block_context["PARAM_NAME_"+Строка(НомерПараметра)], ПарамЗначение);
			АргументыВызова = АргументыВызова  + ", Параметры." + block_context["PARAM_NAME_"+Строка(НомерПараметра)];
			НомерПараметра = НомерПараметра + 1;
		КонецЦикла;
		Результат = ОбщегоНазначения.ВычислитьВБезопасномРежиме(block_context.NAME+"("+АргументыВызова+")", Параметры);
	КонецЕсли;	
	Возврат Результат;
КонецФункции

Функция ПолучитьСтруктуруИзСоответствия(ЗначВход)
	
	СтруктураВозврат=Новый Структура;
	
	Если ТипЗнч(ЗначВход)=Тип("Соответствие") Тогда
		
		ФлагОщибка=Ложь;
		
		Для Каждого р Из ЗначВход Цикл
			Попытка
				СтруктураВозврат.Вставить(р.Ключ,ПолучитьСтруктуруИзСоответствия(р.Значение));
			Исключение
				ФлагОщибка=Истина;
				Прервать;
			КонецПопытки;
		КонецЦикла;
		
		Если ФлагОщибка Тогда // пришел ключь который не возможно поместить в структуру
			СтруктураВозврат = Новый Массив;
			Для Каждого р Из ЗначВход Цикл
				ДопСтруктура=Новый Структура;
				ДопСтруктура.Вставить("Ключ",р.Ключ);
				ДопСтруктура.Вставить("Значение",ПолучитьСтруктуруИзСоответствия(р.Значение));
				СтруктураВозврат.Добавить(ДопСтруктура);
			КонецЦикла;
		КонецЕсли;
		
		Возврат СтруктураВозврат; 
		
	ИначеЕсли ТипЗнч(ЗначВход)=Тип("Массив") Тогда
		
		НовыйМассив=Новый Массив;
		Для Каждого ЭлМ Из ЗначВход Цикл
			НовыйМассив.Добавить(ПолучитьСтруктуруИзСоответствия(ЭлМ));
		КонецЦикла;
		Возврат НовыйМассив;
		
	КонецЕсли;
	
	Возврат ЗначВход; 
	
КонецФункции
