Функция СсылкаСправочникаПоИдентификатору(ИмяИС, ЗначениеИдентификатор) 
	Возврат Справочники[ИмяИС].ПолучитьСсылку(Новый УникальныйИдентификатор(ЗначениеИдентификатор))	
КонецФункции	

Функция ЗначениеФильтраПодключения(ЗаписьFilter) 
	ЗначениеФильтра = ЗаписьFilter.Значение;
	ИмяИСРеквизит = "ИмяИС";
	Если ТипЗнч(ЗаписьFilter.Значение) = Тип("Соответствие") Тогда
		ИдИС = get_prop(ЗаписьFilter.Значение, "ИдИС", Неопределено);
		ИмяИС = get_prop(ЗаписьFilter.Значение, ИмяИСРеквизит, Неопределено);
		Api3Link = get_prop(ЗаписьFilter.Значение, "Api3Link", Неопределено);
		Если Api3Link <> Неопределено Тогда
			ИмяИС = get_prop(Api3Link, ИмяИСРеквизит, Неопределено);
		КонецЕсли;   
		Попытка
			ЗначениеФильтра = ПолучитьСсылкуПоИдИС(ИмяИС, ИдИС);
		Исключение
			ЗначениеФильтра = Неопределено;
		КонецПопытки;
	КонецЕсли;	
	Если ТипЗнч(ЗаписьFilter.Значение) <> Тип("Массив") Тогда 
		Возврат ЗначениеФильтра;	
	КонецЕсли;
	
	МассивЗначений = Новый Массив; 
	Для Каждого Запись Из ЗаписьFilter.Значение Цикл
		ЗначениеМассива = Запись;
		Если ТипЗнч(ЗначениеМассива) = Тип("Соответствие") Тогда 
			ИдИС = get_prop(ЗначениеМассива, "ИдИС", Неопределено);
			ИмяИС = get_prop(ЗначениеМассива, ИмяИСРеквизит, Неопределено);
			Попытка
				ЗначениеМассива = ПолучитьСсылкуПоИдИС(ИмяИС, ИдИС);
			Исключение
				ЗначениеМассива = Неопределено;
			КонецПопытки;	
		КонецЕсли;
		Если ЗначениеЗаполнено(ЗначениеМассива) Тогда
			МассивЗначений.Добавить(ЗначениеМассива);	
		КонецЕсли;	
	КонецЦикла;      
	ЗначениеФильтра = Неопределено;
	Если МассивЗначений.Количество() > 0 Тогда
		ЗначениеФильтра = МассивЗначений;
	КонецЕсли;	
	Возврат ЗначениеФильтра; 
КонецФункции

//DynamicDirective

Функция ОбъектыСинхBlockly(context_params, ConnectionId) Экспорт
	мИниФайлов	= Новый Массив();
	мИниФайлов.Добавить(Новый Структура("type, name", "Система", "ОбъектыСинхBlockly"));
	params	= Новый Структура(
			"props, ini",
			Новый Структура("id, type_data, requested_ini_format", ConnectionId, 1, "Dom1C"), мИниФайлов);
	res = ТранспортИнтеграции.local_helper_integration_api(context_params, "IntegrationConnection.ReadConnection", params, "int-settings");
	ОбъектыИСОбъектыСБИС = get_prop(get_prop(get_prop(res, "data"), "ОбъектыСинхBlockly"), "data");
	Возврат ОбъектыИСОбъектыСБИС;
КонецФункции

// Функция МассивФильтровПодключения
//
// Параметры:
// DataFilter - Соответствие - Data Filter
//
// Возвращаемое значение:
//  Массив - Результат выполения функции
//
//DynamicDirective
Функция МассивФильтровПодключения(DataFilter) Экспорт
	МассивФильтров = Новый Массив;
	Если Не ТипЗнч(DataFilter) = Тип("Соответствие") Тогда
		Возврат МассивФильтров;
	КонецЕсли;	
	Для Каждого ЗаписьFilter ИЗ DataFilter Цикл 
		ЗначениеФильтра = ЗначениеФильтраПодключения(ЗаписьFilter);
		Если ЗначениеЗаполнено(ЗначениеФильтра) Тогда
			НовоеЗначениеФильтра = Новый Структура;
			НовоеЗначениеФильтра.Вставить("Название",ЗаписьFilter.Ключ);		
			НовоеЗначениеФильтра.Вставить("Значение", ЗначениеФильтра);
			МассивФильтров.Добавить(НовоеЗначениеФильтра);
		КонецЕсли;	
	 КонецЦикла;	
	 
	Возврат МассивФильтров;
КонецФункции

// Функция НаправленияСинхронизации
//
// Параметры:
// context_param - Соответствие - Параметры подключения
// ConnectionId - Строка - Идентификатор соединения
//
// Возвращаемое значение:
//  Массив - Результат выполения функции
//
//DynamicDirective
Функция НаправленияСинхронизации(context_param, ConnectionId) Экспорт
	Фильтр = Новый Структура("ConnectionId", ConnectionId);
	СчетчикСтраниц = 0;
	МассивНаправлений = Новый Массив;
	Пока ИСТИНА Цикл
		res = ТранспортИнтеграции.local_helper_api3_typesyncobject_list(context_param, Фильтр, Неопределено, Неопределено, СчетчикСтраниц);
		Result = res.Получить("Result");
		Если ТипЗнч(Result) = Тип("Массив") Тогда
			Для Каждого Запись ИЗ Result Цикл   
				МассивНаправлений.Добавить(Запись);
			КонецЦикла;	
		КонецЕсли;
		Если res.Получить("Navigation") <> Неопределено
			И res["Navigation"].Получить("HasMore") = ИСТИНА Тогда
			СчетчикСтраниц = СчетчикСтраниц + 1;
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	Возврат МассивНаправлений; 
КонецФункции

Функция ПримененФильтрПоРеквизиту(НазваниеРеквизита)
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("StatusId", 	"Игнорирован");
    СтруктураОтвета.Вставить("StatusMsg", 	"Применен фильтр по реквизиту " + НазваниеРеквизита);
	Возврат СтруктураОтвета;		
КонецФункции	

Функция ЕстьСтандартныйРеквизит(МетаданныеСсылки, ИмяРеквизита)
	Для Каждого Реквизит Из МетаданныеСсылки.СтандартныеРеквизиты Цикл
		Если Реквизит.Имя = ИмяРеквизита Тогда  
			Возврат Истина;
		КонецЕсли;	
	КонецЦикла;
	Возврат Ложь;
КонецФункции

Процедура ОбработатьФильтрПериода(НазваниеФильтра, ЗначениеФильтра, Сравнение)
	Отступ5 = 5;
	Отступ3 = 3;
	Если Прав(НазваниеФильтра, Отступ5) = "_From" Тогда 
		НазваниеФильтра = Лев(НазваниеФильтра, СтрДлина(НазваниеФильтра) - Отступ5);
		ЗначениеФильтра = НачалоДня(ПреобразоватьСтрокуВДату("yyyy-MM-dd", ЗначениеФильтра));
		Сравнение = "Меньше";
	КонецЕсли; 
	Если Прав(НазваниеФильтра, Отступ3) = "_To" Тогда 
		НазваниеФильтра = Лев(НазваниеФильтра, СтрДлина(НазваниеФильтра) - Отступ3);		
		ЗначениеФильтра = КонецДня(ПреобразоватьСтрокуВДату("yyyy-MM-dd", ЗначениеФильтра));
		Сравнение = "Больше";
	КонецЕсли;
	Если Прав(НазваниеФильтра, Отступ3) = "Нач" Тогда 
		НазваниеФильтра = Лев(НазваниеФильтра, СтрДлина(НазваниеФильтра) - Отступ3);
		ЗначениеФильтра = НачалоДня(ПреобразоватьСтрокуВДату("yyyy-MM-dd", ЗначениеФильтра));
		Сравнение = "Меньше";
	КонецЕсли; 
	Если Прав(НазваниеФильтра, Отступ3) = "Кнц" Тогда 
		НазваниеФильтра = Лев(НазваниеФильтра, СтрДлина(НазваниеФильтра) - Отступ3);		
		ЗначениеФильтра = КонецДня(ПреобразоватьСтрокуВДату("yyyy-MM-dd", ЗначениеФильтра));
		Сравнение = "Больше";
	КонецЕсли;
КонецПроцедуры

Процедура ПроверкаОбъектаПоФильтру(СсылкаНаОбъект, Фильтр, МетаданныеСсылки, СтруктураОтвета)
	НазваниеФильтра = Фильтр.Название;
	ЗначениеФильтра = Фильтр.Значение;
	Сравнение = "НеРавно";
	ОбработатьФильтрПериода(НазваниеФильтра, ЗначениеФильтра, Сравнение);	
	Если НазваниеФильтра = "ПодразделенияОрганизаций" // убрать условие в 25.4100 после исправления ини
			И МетаданныеСсылки.Реквизиты.Найти(НазваниеФильтра) = Неопределено Тогда 
			НазваниеФильтра = "Подразделение";		
	КонецЕсли;
	Если МетаданныеСсылки.Реквизиты.Найти(НазваниеФильтра) = Неопределено И 
		Не ЕстьСтандартныйРеквизит(МетаданныеСсылки, НазваниеФильтра) Тогда	
			Возврат;
	КонецЕсли;
	ЗначениеРеквизита = СсылкаНаОбъект[НазваниеФильтра];
	Если ТипЗнч(ЗначениеФильтра) = Тип("Массив") Тогда
		Если Фильтр.Значение.Найти(ЗначениеРеквизита) = Неопределено Тогда
			СтруктураОтвета = ПримененФильтрПоРеквизиту(НазваниеФильтра);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	Если (Сравнение = "НеРавно" И ЗначениеРеквизита <> ЗначениеФильтра)
		Или (Сравнение = "Меньше" И ЗначениеРеквизита < ЗначениеФильтра) 
		Или (Сравнение = "Больше" И ЗначениеРеквизита > ЗначениеФильтра)		Тогда
		СтруктураОтвета = ПримененФильтрПоРеквизиту(НазваниеФильтра);
	КонецЕсли;	
КонецПроцедуры

Функция ЭтоСсылкаДляВыгрузки(СсылкаНаОбъект, ТипыОбъектовИСДляВыгрузки, Фильтры)
	МетаданныеСсылки = Метаданные.НайтиПоТипу(ТипЗнч(СсылкаНаОбъект));
	ПолноеИмя = МетаданныеСсылки.ПолноеИмя();
	ПолноеИмя = СтрЗаменить(ПолноеИмя, "Документ.", "Документы.");
	ПолноеИмя = СтрЗаменить(ПолноеИмя, "Справочник.", "Справочники.");
	ПолноеИмя = СтрЗаменить(ПолноеИмя, "Перечисление.", "Перечисления.");
	ПолноеИмя = СтрЗаменить(ПолноеИмя, "ПланВидовХарактеристик.", "ПланыВидовХарактеристик.");
		
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("StatusId", Неопределено);
	СтруктураОтвета.Вставить("StatusMsg", "");
	МассивОбъектовИСДляВыгрузки = get_prop(ТипыОбъектовИСДляВыгрузки, "ОбъектыВыгрузки"); 
	ОтключенныеОбъекты = get_prop(ТипыОбъектовИСДляВыгрузки, "ОтключенныеОбъекты");
	Если МассивОбъектовИСДляВыгрузки.Найти(ПолноеИмя) = Неопределено Тогда 
		ОтключенныйОбъект = get_prop(ОтключенныеОбъекты, ПолноеИмя);
		СтруктураОтвета.Вставить("SbisType", 	ОтключенныйОбъект);
		StatusId = "Игнорирован";
		Если ОтключенныйОбъект = Неопределено Тогда
			StatusId = "НеСинхронизируется";	
		КонецЕсли;
		СтруктураОтвета.Вставить("StatusId", 	StatusId);
    	СтруктураОтвета.Вставить("StatusMsg", 	"Синхронизация данного объекта отключена в списке сопоставлений");
		Возврат СтруктураОтвета;
	КонецЕсли; 
	
	Для Каждого Фильтр Из Фильтры Цикл   
		Если Не ЗначениеЗаполнено(Фильтр.Название) Тогда
			Продолжить;
		КонецЕсли;  
		ПроверкаОбъектаПоФильтру(СсылкаНаОбъект, Фильтр, МетаданныеСсылки, СтруктураОтвета);
		StatusId = get_prop(СтруктураОтвета, "StatusId");
		Если StatusId = "Игнорирован" Тогда
			ОтключенныйОбъект = get_prop(ОтключенныеОбъекты, ПолноеИмя);
			СтруктураОтвета.Вставить("SbisType", ОтключенныйОбъект);
			Прервать;	
		КонецЕсли;	
	КонецЦикла;
	
	Возврат СтруктураОтвета;
КонецФункции

Функция BlocklyGetInfoParams(info, НазваниеРеквизита, ЗначениеРеквизита) Экспорт 
	Если ТипЗнч(info) = Тип("Соответствие") Тогда
		info_params = info.Получить("Params");
		Если ТипЗнч(info_params) = Тип("Массив") Тогда 
			Для Каждого Запись ИЗ info_params Цикл
				Если Запись.Получить(НазваниеРеквизита) = ЗначениеРеквизита Тогда
					Возврат Запись;
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;	
	КонецЕсли;
	Возврат Неопределено;	
КонецФункции

Функция УдаляемОбъектыИзПланаОбмена(УзелПланаОбмена, Условие)
	НомерОтправленного = УзелПланаОбмена.НомерОтправленного;
	ПланыОбмена.УдалитьРегистрациюИзменений(УзелПланаОбмена, НомерОтправленного);
	УзелПланаОбменаОбъект = УзелПланаОбмена.ПолучитьОбъект();
	УзелПланаОбменаОбъект.НомерОтправленного = УзелПланаОбменаОбъект.НомерОтправленного + 1;
	УзелПланаОбменаОбъект.Записать();	

	Возврат Неопределено;
КонецФункции	

Функция АлгоритмRead(Api3Object, ОбъектыИС)
	ТипИСИмяИС = "";
	IniName = "";
	ТипИС = get_prop(Api3Object, "ТипИС");
	ИмяИС = get_prop(Api3Object, "ИмяИС");
	Если ЗначениеЗаполнено(ТипИС) Тогда
		ТипИСИмяИС = ТипИС + "." + ИмяИС;
	Иначе
		ТипИСИмяИС = ИмяИС;	
	КонецЕсли;
	МассивINI = get_prop(ОбъектыИС, ТипИСИмяИС, Новый Массив);
	Для Каждого Запись Из МассивINI Цикл 
		Если Прав(Запись, 5) = "_read" Тогда
			IniName = Запись;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	Возврат IniName; 
КонецФункции

Процедура ДобавитьПакетИзменений(МассивПакетыОбъектов, objects, СчетчикПакетов, ТекстОбъекты, ЗапускССервера)
	МодульОбъекта = МодульОбъекта();
	МассивПакетыОбъектов.Добавить(objects);
	objects = Новый Массив;
	СчетчикПакетов = СчетчикПакетов + 1;
	ТекстПакеты = "; Сформировано пакетов: " + Формат(СчетчикПакетов, "ЧГ=");
	ТекстСообщения = ТекстОбъекты + ";" + ТекстПакеты;
	Если ЗапускССервера Тогда
		МодульОбъекта.СообщитьПрогресс(0, ТекстСообщения);
	КонецЕсли;
КонецПроцедуры

Функция ПакетыИзменений(ИмяПланаОбмена, ИдентификаторУзлаОбмена, ТаблицаФильтров, ТипыОбъектовИСДляВыгрузки, context, ОбъектыСинхBlockly, ЗапускССервера = Ложь)
	УзелПланаОбмена = ПланыОбмена[ИмяПланаОбмена].ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторУзлаОбмена));	
	Если Не ЗначениеЗаполнено(УзелПланаОбмена) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	objects = Новый Массив;
	МассивПакетыОбъектов = Новый Массив;
	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(УзелПланаОбмена,УзелПланаОбмена.НомерОтправленного);
	РазмерСтраницы = 50; 
	//РазмерСтраницы = 1000; 
	ОбъектыИС = get_prop(ОбъектыСинхBlockly, "ОбъектыИС");
	СчетчикОбъектов = 0;
	ТекстСообщения = ""; 
	СчетчикПакетов = 0;
	МодульОбъекта = МодульОбъекта();
	Пока ВыборкаИзменений.Следующий() Цикл
		СчетчикОбъектов = СчетчикОбъектов + 1;
		ОбъектВыгрузки = ВыборкаИзменений.Получить();
		ТекстОбъекты = "Обработано объектов: " + Формат(СчетчикОбъектов, "ЧГ=");
		Если СчетчикПакетов > 0 Тогда
			ТекстПакеты = "; Сформировано пакетов: " + Формат(СчетчикПакетов, "ЧГ=");
		КонецЕсли;
		ТекстСообщения = ТекстОбъекты + ТекстПакеты;
		Если ЗапускССервера Тогда
			МодульОбъекта.СообщитьПрогресс(0, ТекстСообщения); 
		КонецЕсли;
		Попытка 
			СсылкаНаОбъект = ОбъектВыгрузки.Ссылка; 
			СтатусОбъекта = ЭтоСсылкаДляВыгрузки(СсылкаНаОбъект, ТипыОбъектовИСДляВыгрузки, ТаблицаФильтров);
			Если get_prop(СтатусОбъекта, "StatusId", "") = "НеСинхронизируется" Тогда
				Продолжить;
			КонецЕсли;
			Api3Object = Api3Object(СсылкаНаОбъект, get_prop(СтатусОбъекта, "SbisType"), Истина, Неопределено, Истина);
			Api3Object.Вставить("StatusId", get_prop(СтатусОбъекта, "StatusId"));
			Api3Object.Вставить("StatusMsg", get_prop(СтатусОбъекта, "StatusMsg", ""));
			objects.Добавить(Api3Object);
		Исключение
			Продолжить;	
		КонецПопытки;
		Если objects.Количество() = РазмерСтраницы Тогда
			ДобавитьПакетИзменений(МассивПакетыОбъектов, objects, СчетчикПакетов, ТекстОбъекты, ЗапускССервера);
		КонецЕсли;	
	КонецЦикла; 
	Если objects.Количество() > 0 Тогда
		ДобавитьПакетИзменений(МассивПакетыОбъектов, objects, СчетчикПакетов, ТекстОбъекты, ЗапускССервера);
	КонецЕсли;	
	ПланыОбменаContext = get_prop(context, "ПланыОбмена", Новый Соответствие);
	ПланыОбменаContext.Вставить(ИдентификаторУзлаОбмена, УзелПланаОбмена);
	context.Вставить("ПланыОбмена", ПланыОбменаContext);
	Возврат МассивПакетыОбъектов;	
КонецФункции	

Функция ТипыОбъектовДляВыгрузки(ОбъектыСинхBlockly)                     
	МассивОбъектовВыгрузки = Новый Массив;
	ОтключенныеОбъектыВыгрузки = Новый Соответствие;
	ОтключенныеSabyОбъектыВыгрузки = Новый Соответствие;
	ОбъектыSaby = get_prop(ОбъектыСинхBlockly, "Объекты", Новый Массив); 
	МассивИниВыгрузка = Новый Массив;
	Для Каждого ОбъектSaby Из ОбъектыSaby Цикл 
		СтатусСинхронизации = get_prop(ОбъектSaby, "СтатусСинхронизации");   
		Если СтатусСинхронизации = 2 Или СтатусСинхронизации = 3 Тогда
			ВыгрузкаИни = get_prop(ОбъектSaby, "Выгрузка");
			ИнтеграцияДополнитьМассив(МассивИниВыгрузка, ВыгрузкаИни);	
			Продолжить;
		КонецЕсли;
		ВыгрузкаИни = get_prop(ОбъектSaby, "Выгрузка");
		Для Каждого ЗаписьИНИ Из ВыгрузкаИни Цикл
			ОтключенныеSabyОбъектыВыгрузки.Вставить(ЗаписьИНИ, get_prop(ОбъектSaby, "КрасивоеНазвание"));
		КонецЦикла;
	КонецЦикла;	
	ОбъектыИС = get_prop(ОбъектыСинхBlockly, "ОбъектыИС", Новый Массив);
	Для Каждого Запись Из ОбъектыИС Цикл
		МассивИНИ = Запись["Значение"]; 
		Для Каждого ЗаписьИНИ Из МассивИНИ Цикл 
			Если МассивИниВыгрузка.Найти(ЗаписьИНИ)<> Неопределено Тогда 
				МассивОбъектовВыгрузки.Добавить(Запись["Ключ"]);
				Прервать;
			КонецЕсли;	
			ОтключенныйSabyОбъект = get_prop(ОтключенныеSabyОбъектыВыгрузки, ЗаписьИНИ);
			Если ОтключенныйSabyОбъект <> Неопределено Тогда
				ОтключенныеОбъектыВыгрузки.Вставить(Запись["Ключ"], ОтключенныйSabyОбъект);	
			КонецЕсли;		
		КонецЦикла;	
	КонецЦикла;	
	Возврат Новый Структура("ОбъектыВыгрузки,ОтключенныеОбъекты", МассивОбъектовВыгрузки, ОтключенныеОбъектыВыгрузки); 
КонецФункции

// Функция ЗаписатьИзмененияУзлаВExtsyncdoc
//
// Параметры:
// context - Соответствие - Контекст исполняемого блока
// ИмяПланаОбмена - Строка - ИмяПлана обмена
// connection_uuid - Строка - Идентификатор соединения
//
//DynamicDirective
Процедура ЗаписатьИзмененияУзлаВExtsyncdoc(context, ИмяПланаОбмена, connection_uuid)
	Фильтры = get_prop(context, "Filter"); 
	
	ОбъектыСинхBlockly = ОбъектыСинхBlockly(context.params, connection_uuid);	
	ТаблицаФильтров = МассивФильтровПодключения(Фильтры);
	ТипыОбъектовИСДляВыгрузки = ТипыОбъектовДляВыгрузки(ОбъектыСинхBlockly); 
	
	direction = 1;
	Робот = 	get_prop(context.operation, "isRobot", Ложь);
	Data = ТранспортИнтеграции.local_helper_system_info(Робот);
	data_to_write = get_prop(context.report, "data_to_write");
	Если data_to_write <> Неопределено Тогда
		ОбновитьСтруктуру(Data, data_to_write);
		context.report.Удалить("data_to_write");
	КонецЕсли;
	extsyncdoc_uuid = get_prop(context.report, "uuid", "");
	Если ПустаяСтрока(extsyncdoc_uuid) Тогда
		ПараметрыВЫзова = Новый Структура("Direction, Data", direction, Data);
	Иначе
		ПараметрыВЫзова = Новый Структура("Uuid, Direction, Data", extsyncdoc_uuid, direction, Data);
	КонецЕсли;	
	objects = Новый Массив;
	ПолученныйUuid = ТранспортИнтеграции.local_helper_extsyncdoc_write(
			context.params, connection_uuid, ПараметрыВызова, objects);
	context.operation.Вставить("operation_uuid", 	ПолученныйUuid);
	context.operation.Вставить("connection_uuid", 	connection_uuid); 
	ПараметрыВызова.Вставить("Uuid", ПолученныйUuid);			
	context.report.new = Ложь;
	
		
	ЗапускССервера = Ложь;
	#Если Сервер Тогда
		ЗапускССервера = Истина;
	#КонецЕсли	
	МассивПакетыОбъектов = ПакетыИзменений(ИмяПланаОбмена, connection_uuid, ТаблицаФильтров, ТипыОбъектовИСДляВыгрузки, context, ОбъектыСинхBlockly, ЗапускССервера);	
	ВсегоПакетов = МассивПакетыОбъектов.Количество();
	СчетчикПакетов = 0;
	Для Каждого ПакетОбъектов Из МассивПакетыОбъектов Цикл   
		СчетчикПакетов = СчетчикПакетов + 1;
		Процент = Окр(СчетчикПакетов/ВсегоПакетов * 100, 0);
		ТекстСообщения = "Отправлено пакетов: " + Формат(СчетчикПакетов, "ЧГ=") + " из " + Формат(ВсегоПакетов, "ЧГ=");
		ДопПарамерыПрогресса = Новый Структура("Прогресс", Процент); //Градусник для обновления статусов
		СообщитьПрогрессОперации(Процент, ТекстСообщения, ДопПарамерыПрогресса);
		objects = block_extsyncdoc_write_api3_link(context, direction, ПакетОбъектов, Ложь);
		ПолученныйUuid = ТранспортИнтеграции.local_helper_extsyncdoc_write(
			context.params, connection_uuid, ПараметрыВызова, objects);
		context.report.new = Ложь;	
	КонецЦикла;
КонецПроцедуры

// Функция block_extsys_read_changes_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Булево - Результат выполения функции
//
//DynamicDirective
Функция block_extsys_read_changes_calc_value(block_type, node, path, context, block_context) Экспорт
	_last_error = "_last_error";
	Попытка
		connection_uuid = get_prop(context.Report.operation, "uuid", "");
		info = block_get_variable(context, "parameters");
// Сохраняем идентичность со структурой кода в Питоне
// BSLLS:UnusedLocalVariable-off
		info_params = get_prop(info, "Params", Неопределено);
// BSLLS:UnusedLocalVariable-on		
		СоответствиеПланОбмена = BlocklyGetInfoParams(info, "name", "ПланОбмена"); 
		Если СоответствиеПланОбмена <> Неопределено Тогда
			ИмяПланаОбмена = СоответствиеПланОбмена.Получить("default");
		Иначе 
			block_set_variable(context, _last_error, "Не удалось определить план обмена для блока extsys_read_changes");
			ВызватьИсключение NewExtExceptionСтрока("Не удалось определить план обмена для блока extsys_read_changes");
			Возврат Ложь;
		КонецЕсли;	
			
		ЗаписатьИзмененияУзлаВExtsyncdoc(context, ИмяПланаОбмена, connection_uuid); 	
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		block_set_variable(context, _last_error, NewExtExceptionСтрока(ИнфОбОшибке));
		ВызватьИсключение NewExtExceptionСтрока(ИнфОбОшибке);
		
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
КонецФункции
