
// Функция block_extsys_link_by_external_uid_calc_value
//
// Параметры:
// ПолноеИмяТипаЧерезТочку - Строка - Имя типа метаданных: "Справочники.Сотрудники", "Документы.ПриемНаРаботу"
//
// Возвращаемое значение:
//  Неопределено - Если тип метеданных не определен
//  Строка - Строка с полным именем типа метаданных вида "Справочник.Сотрудники"
//
// BSLLS:TooManyReturns-off
Функция ПолноеИмяМетаданныхПоТипуСтрокой(ПолноеИмяТипаЧерезТочку)
	// Проверим, может передано правильное полное имя вида "Справочник.Сотрудники"
	МетаданныеПоИмени = НайтиМетаданныеПоПолномуИмени(ПолноеИмяТипаЧерезТочку);
	Если МетаданныеПоИмени <> Неопределено Тогда
		ПолноеИмя = МетаданныеПоИмени.ПолноеИмя();
		Возврат ПолноеИмя;
	КонецЕсли;
	
	// Проверим, если передано неправильное полное имя вида "Справочники.Сотрудники"
	Попытка
		ТипВидОбъекта = СтрРазделить82(ПолноеИмяТипаЧерезТочку, ".", Ложь);
		ТипОбъекта = ТипВидОбъекта[0];
		ТипОбъекта = СтрЗаменить(ТипОбъекта, "Документы", "Документ");
		ТипОбъекта = СтрЗаменить(ТипОбъекта, "Справочники", "Справочник");
		ТипОбъекта = СтрЗаменить(ТипОбъекта, "Перечисления", "Перечисление");
		ТипОбъекта = СтрЗаменить(ТипОбъекта, "ПланыВидовХарактеристик", "ПланВидовХарактеристик");
		ВидОбъекта = ТипВидОбъекта[1];
		МетаданныеПоИмени = НайтиМетаданныеПоПолномуИмени(ТипОбъекта + "." + ВидОбъекта);
		Если МетаданныеПоИмени <> Неопределено Тогда
			ПолноеИмя = МетаданныеПоИмени.ПолноеИмя();
			Возврат ПолноеИмя;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции
// BSLLS:TooManyReturns-on

Функция ОбъектИСПоУИДСБИСИТипу(УИД, ТипОбъектов)
	
// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
// BSLLS:SetPrivilegedMode-on
	
	Регламент = "";
	Если ИнтеграцияСтатусыДокументов = Неопределено Тогда
		СтатусыДокументовИнициализация(, Регламент);
	КонецЕсли;
	Сервис  = ИнтеграцияСтатусыДокументов.Сервис;
	Аккаунт = ИнтеграцияСтатусыДокументов.Аккаунт;
	
	АккаунтСтрокой = СокрЛП(Аккаунт);
	// Формируем ИД + с заполненным аккаунтом
	МассивИД = Новый Массив;
	Если ЗначениеЗаполнено(АккаунтСтрокой) Тогда
		МассивИД.Добавить(УИД + "_" + АккаунтСтрокой);
	Иначе
		МассивИД.Добавить(УИД);
	КонецЕсли;
	
	// Ищем документы по свойству ДокументСБИС_Ид				
	Префикс    = ПрефиксДокументаПоДопСведениям(Регламент, Сервис);	
	СвойствоИД = СтатусыДокументовИзвлечьСвойствоПоОписанию(Префикс + "_Ид");
	
	МассивСвойств = Новый Массив;
	МассивСвойств.Добавить(СвойствоИД);
	
	// Находим все документы с ИД + Аккаунт
	ОбъектыТЗ = ТаблицаСвойствОбъектов(МассивИД, МассивСвойств, Истина, ТипОбъектов);
	
	Если ОбъектыТЗ.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат ОбъектыТЗ[0].Объект;
	КонецЕсли;
	
КонецФункции

// Функция block_extsys_link_by_external_uid_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Неопределено, Произвольный - Ссылка на объект ИС
//
//DynamicDirective
Функция block_extsys_link_by_external_uid_calc_value(block_type, node, path, context, block_context)
	
	required_param = Новый Массив;
	required_param.Добавить("SBIS_ID");
	block_check_required_param_in_block_context(required_param, block_context);
	
	УИД = get_prop(block_context, "SBIS_ID");
	ТипИС = get_prop(block_context, "CLIENT_TYPE");
	ТипОбъектов = Неопределено;
	Если ЗначениеЗаполнено(ТипИС) Тогда
		ИмяТипаМетаданных = ПолноеИмяМетаданныхПоТипуСтрокой(ТипИС);
		Если НЕ ЗначениеЗаполнено(ИмяТипаМетаданных) Тогда
			ВызватьИсключение NewExtExceptionСтрока(, "Ошибка в блоке",
													"не определен ТипИС = " + ТипИС + " в блоке " + block_type);
		КонецЕсли;
		ТипОбъектов = Тип(СтрЗаменить(ИмяТипаМетаданных, ".", "Ссылка."));
	КонецЕсли;
	
	Возврат ОбъектИСПоУИДСБИСИТипу(УИД, ТипОбъектов);
	
КонецФункции
