//DynamicDirective
Функция block_extsys_print_form_list_calc_value(block_type, node, path, context, block_context)
	СписокПечатныхФорм = Новый Массив;
	ИдИС = get_prop(block_context.API3,"ИдИС");
	ИмяИС = get_prop(block_context.API3,"ИмяИС");
	Если ЗначениеЗаполнено(ИдИС) и ЗначениеЗаполнено(ИмяИС) Тогда 
		Попытка   
			DOC = ПолучитьСсылкуПоИдИС(ИмяИС, ИдИС);
			СписокПечатныхФорм = ПолучитьПечатныеФормы(DOC, СписокПечатныхФорм, Истина);
		Исключение
		КонецПопытки;
	КонецЕсли;
	Возврат СписокПечатныхФорм;
КонецФункции

