
// BSLLS:DuplicateStringLiteral-off

//DynamicDirective

Функция block_extsys_query_by_view_calc_value(block_type, node, path, context, block_context)
	local_context = Новый Структура;
	
	Pagination = Новый Структура("HasMore", Ложь);
	
	context_variable_scope_add(block_context, Новый Структура);
	
	info = workspace_init_procedure_block("info");
	Результат_info = block_execute(info.type, info.node, "", context, block_context);
	
	view = workspace_init_procedure_block("view");
	Результат_view = block_execute(view.type, view.node, "", context, block_context);
	
	context_variable_scope_remove(block_context);
	
	ЗаполнитьПараметрыБлокаНаСервере(block_context, Результат_info, Результат_view);
	
	c1_call_select2_execute(block_type, node, path, context, block_context, Pagination, local_context);
	
	Возврат Новый Структура("Rows, Pagination", block_context["ROWS"], Pagination);
	
КонецФункции

Процедура ЗаполнитьПараметрыБлокаНаСервере(block_context, Результат_info, Результат_view)
	ТипИС = Результат_info["ext_sys_obj_type"];
	ТипИС = ПривестиТипИСКЕдЧислу(ТипИС);
	МетаОбъект = НайтиМетаданныеПоПолномуИмени(ТипИС);
	
	Колонки = get_prop(Результат_view, "COLUMNS"); 
	Фильтры = get_prop(Результат_view, "FILTER");
	
	ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 0 
	|   ТаблицаОбъектовИС.Ссылка КАК ОбъектИС,
	|   ПРЕДСТАВЛЕНИЕ(ТаблицаОбъектовИС.Ссылка) КАК Название,
	|	&ПоляСабиСтатусов КАК ПоляСабиСтатусов";
	
	ПоляЗапроса = СформироватьПоляЗапроса(Колонки, МетаОбъект);
	
	ТекстЗапроса = ТекстЗапроса + ПоляЗапроса + " " + Символы.ПС +	
	" ИЗ " + Символы.ПС + ТипИС +
	" КАК ТаблицаОбъектовИС " + Символы.ПС;
	
	ПараметрыЗапроса = Новый Структура;
	
	ТекстУсловия = СформироватьУсловияЗапроса(block_context, Колонки, Фильтры, ПараметрыЗапроса, МетаОбъект, ТипИС);
	
	Если Лев(ТипИС, 8) = "Документ" Тогда 
		СортировкаЗапроса = " УПОРЯДОЧИТЬ ПО
		|	ТаблицаОбъектовИС.Дата УБЫВ,
		|	ТаблицаОбъектовИС.Номер УБЫВ;";
	Иначе
		СортировкаЗапроса = " УПОРЯДОЧИТЬ ПО ТаблицаОбъектовИС." + Колонки[0]["PROPERTY"] + " УБЫВ;";
	КонецЕсли;	
	
	ТекстЗапроса = ТекстЗапроса + ТекстУсловия + СортировкаЗапроса;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, " ГДЕ УПОРЯДОЧИТЬ ПО", " УПОРЯДОЧИТЬ ПО");
	
	block_context.Вставить("SELECT", ТекстЗапроса);
	block_context.Вставить("SELECT_PARAMS", ПараметрыЗапроса);
	
КонецПроцедуры

Функция НайтиМетаданныеПоПолномуИмени(Тип)
	Возврат Метаданные.НайтиПоПолномуИмени(Тип);	
КонецФункции

Функция СформироватьПоляЗапроса(Columns, МетаОбъект) Экспорт

    ТекстПоля = "";
	ПоляСабиСтатусов = Новый Массив; 
	ПоляСабиСтатусов.Добавить("СтатусСБИС");
	ПоляСабиСтатусов.Добавить("АктивныйЭтап");
	ПоляСабиСтатусов.Добавить("ИдСБИС");
	
	Для каждого Колонка Из Columns Цикл
		ШаблонКолонки = get_prop(Колонка, "TEMPLATE");
        ИмяКолонки = get_prop(Колонка, "NAME");
		Если Не ПоляСабиСтатусов.Найти(ИмяКолонки) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		// BSLLS:IfElseIfEndsWithElse-off
		Если ШаблонКолонки = "column_date_number" Тогда
			ИмяКолонкиДата = "Дата";
			ИмяПоляДата = get_prop(Колонка, "DATE_PROPERTY");
			
			ИмяКолонкиНомер = "Номер";
			ИмяПоляНомер = get_prop(Колонка, "NUMBER_PROPERTY");
			
			ВыражениеДата = "ТаблицаОбъектовИС." + ИмяПоляДата + " КАК " + ИмяКолонкиДата; 
			ВыражениеНомер = "ТаблицаОбъектовИС." + ИмяПоляНомер + " КАК " + ИмяКолонкиНомер;
			
			ТекстПоля = ТекстПоля + ", " + Символы.ПС + " " + ВыражениеДата;
			ТекстПоля = ТекстПоля + ", " + Символы.ПС + " " + ВыражениеНомер;
			
			Продолжить;
		ИначеЕсли ШаблонКолонки = "column_document_kedo" Тогда
			ТипПоля = "Строка";
			//Тип
			ИмяПоляТип = Колонка["TYPE_PROPERTY"];
			ТекстПоля = ТекстПоля + СформироватьТесктПоляЗапросаПоТипу(МетаОбъект, ИмяПоляТип, ТипПоля);
			// ФИО
			ИмяПоляСотрудник = Колонка["PROPERTY"];
			ТекстПоля = ТекстПоля + СформироватьТесктПоляЗапросаПоТипу(МетаОбъект, ИмяПоляСотрудник, ТипПоля);
			// Должность
			ИмяПоляДолжность = Колонка["POSITION_PROPERTY"];
			ТекстПоля = ТекстПоля + СформироватьТесктПоляЗапросаПоТипу(МетаОбъект, ИмяПоляДолжность, ТипПоля);
			// Организация
			ИмяПоляОрганизация = Колонка["ORG_PROPERTY"];
			ТекстПоля = ТекстПоля + СформироватьТесктПоляЗапросаПоТипу(МетаОбъект, ИмяПоляОрганизация, ТипПоля);
			// Инфо
			ИмяПоляИнфо = Колонка["INFO_PROPERTY"];
			ТекстПоля = ТекстПоля + СформироватьТесктПоляЗапросаПоТипу(МетаОбъект, ИмяПоляИнфо, ТипПоля);
			// Вложения
			ИмяПоляВложения = Колонка["ATTACHMENTS_PROPERTY"];
			ТекстПоля = ТекстПоля + СформироватьТесктПоляЗапросаПоТипу(МетаОбъект, ИмяПоляВложения, ТипПоля);
			// Этап
			ИмяПоляЭтап = Колонка["STAGE_PROPERTY"];
			ТекстПоля = ТекстПоля + СформироватьТесктПоляЗапросаПоТипу(МетаОбъект, ИмяПоляЭтап, ТипПоля);
			Продолжить;
		ИначеЕсли ШаблонКолонки = "column_employee" Тогда	
			ТипПоля = "Строка";
			// ФИО
			ИмяПоляСотрудник = Колонка["PROPERTY"];
			ТекстПоля = ТекстПоля + СформироватьТесктПоляЗапросаПоТипу(МетаОбъект, ИмяПоляСотрудник, ТипПоля);
			// Организация
			ИмяПоляОрганизация = Колонка["ORG_PROPERTY"];
            ТекстПоля = ТекстПоля + СформироватьТесктПоляЗапросаПоТипу(МетаОбъект, ИмяПоляОрганизация, ТипПоля);
			// Департамент
			ИмяПоляДепартамент = Колонка["DEPARTMENT_PROPERTY"];
			ТекстПоля = ТекстПоля + СформироватьТесктПоляЗапросаПоТипу(МетаОбъект, ИмяПоляДепартамент, ТипПоля);
			// Телефон
			ИмяПоляТелефон = Колонка["TEL_PROPERTY"];
			ТекстПоля = ТекстПоля + СформироватьТесктПоляЗапросаПоТипу(МетаОбъект, ИмяПоляТелефон, ТипПоля);
			// Должность
			ИмяПоляДолжность = Колонка["POSITION_PROPERTY"];
			ТекстПоля = ТекстПоля + СформироватьТесктПоляЗапросаПоТипу(МетаОбъект, ИмяПоляДолжность, ТипПоля);
			Продолжить;
		КонецЕсли;	
		// BSLLS:IfElseIfEndsWithElse-on
			
		ИмяПоля = get_prop(Колонка, "PROPERTY", ""); 
		ТипПоля = get_prop(Колонка, "TYPE", "");
		
		Если ПустаяСтрока(ИмяПоля) Тогда 
			Продолжить; 
		КонецЕсли;

        Если ИмяКолонки = "СтатусИС" Тогда
            Выражение = 
                "ВЫБОР " +
                "КОГДА ТаблицаОбъектовИС.ПометкаУдаления ТОГДА 2 " +
                "ИНАЧЕ ВЫБОР " +
                "КОГДА ТаблицаОбъектовИС.Проведен ТОГДА 0 " +
                "ИНАЧЕ 1 " +
                "КОНЕЦ КОНЕЦ КАК " + ИмяКолонки;
            ТекстПоля = ТекстПоля + ", " + Символы.ПС + " " + Выражение;
			Продолжить;
		Иначе
			ТекстПоля = ТекстПоля + СформироватьТесктПоляЗапросаПоТипу(МетаОбъект, ИмяПоля, ТипПоля);
		КонецЕсли;
		
    КонецЦикла;

    Возврат ТекстПоля;
КонецФункции

Функция СформироватьТесктПоляЗапросаПоТипу(МетаОбъект, ИмяПоля, ТипПоля)
	Выражение = "";
	Попытка	
		Если МетаОбъект.Реквизиты.Найти(ИмяПоля) <> Неопределено Тогда
			ТипРеквизита = МетаОбъект.Реквизиты[ИмяПоля].Тип;
		ИначеЕсли ЕстьСтандартныйРеквизит(МетаОбъект, ИмяПоля) Тогда
			ТипРеквизита = МетаОбъект.СтандартныеРеквизиты[ИмяПоля].Тип;
		Иначе	
			Возврат Выражение;
		КонецЕсли;
	Исключение
		Возврат Выражение;
	КонецПопытки;
	
	Если ТипПоля = "Строка" И ТипРеквизита <> Неопределено И ЭтоНеПростойТип(ТипРеквизита) Тогда  
		Выражение = ", " + Символы.ПС + " " + "ПРЕДСТАВЛЕНИЕ(ТаблицаОбъектовИС." + ИмяПоля + ") КАК " + ИмяПоля;
	Иначе
		Выражение = ", " + Символы.ПС + " " + "ТаблицаОбъектовИС." + ИмяПоля + " КАК " + ИмяПоля;
	КонецЕсли;
	
	Возврат Выражение;
КонецФункции	

// BSLLS:CognitiveComplexity-off
// BSLLS:CyclomaticComplexity-off

Функция СформироватьУсловияЗапроса(block_context, Columns, Filters, ПараметрыЗапроса, МетаОбъект, ТипИС) Экспорт
    ТекстУсловия = " ГДЕ";
	Если block_context = Неопределено Тогда 
		Возврат ""; 
	КонецЕсли;
	Если block_context["filter"] = Неопределено Тогда 
		Возврат ""; 
	КонецЕсли;
    
    ЗначенияФильтров = block_context["filter"];

    Для каждого Фильтр Из Filters Цикл
        ИмяФильтра = Фильтр["NAME"];
		ШаблонФильтра = Фильтр["TEMPLATE"];
		Если ШаблонФильтра = "filter_period" Тогда
			ИмяПоля = "Дата";
			ПарамНач = ИмяФильтра + "Нач";
            ПарамКнц = ИмяФильтра + "Кнц";
			Если get_prop(ЗначенияФильтров, ПарамНач) = Неопределено Тогда
            	Продолжить;
			КонецЕсли;     
			Если get_prop(ЗначенияФильтров, ПарамКнц) = Неопределено Тогда
            	Продолжить;
			КонецЕсли;   
			Если get_prop(ЗначенияФильтров, ИмяФильтра) <> Неопределено Тогда
            	Значение = ЗначенияФильтров[ИмяФильтра];        	
			КонецЕсли;

			Если Не get_prop(ЗначенияФильтров, ПарамНач) = Неопределено Тогда
				ДатаНач = get_prop(ЗначенияФильтров, ПарамНач);
				ДатаНач = ПреобразоватьСтрокуВДату("yyyy-MM-dd", ДатаНач);
			Иначе
			    ДатаНач = ?(ТипЗнч(Значение) = Тип("Структура") И Значение.Свойство("Начало"), Значение.Начало, Дата(1, 1, 1));
			КонецЕсли;
			Если Не get_prop(ЗначенияФильтров, ПарамКнц) = Неопределено Тогда
				ДатаКнц = get_prop(ЗначенияФильтров, ПарамКнц);
				ДатаКнц = ПреобразоватьСтрокуВДату("yyyy-MM-dd", ДатаКнц);
			Иначе
				ДатаКнц = ?(ТипЗнч(Значение) = Тип("Структура") И Значение.Свойство("Конец"), Значение.Конец, Дата(1, 1, 1));
			КонецЕсли;	
			
			ПараметрыЗапроса.Вставить(ПарамНач, Дата(ДатаНач));
			ПараметрыЗапроса.Вставить(ПарамКнц, Дата(ДатаКнц));
			
			Условие = " И (ВЫБОР
			|	КОГДА &" + ПарамНач + "НеЗаполнено И &" + ПарамКнц + "НеЗаполнено
			|		ТОГДА ИСТИНА
			|	КОГДА &" + ПарамКнц + "НеЗаполнено
			|		ТОГДА ТаблицаОбъектовИС." + ИмяФильтра + " >= НАЧАЛОПЕРИОДА(&" + ПарамНач + ", ДЕНЬ)
			|	КОГДА &" + ПарамНач + "НеЗаполнено
			|		ТОГДА ТаблицаОбъектовИС." + ИмяФильтра + " <= КОНЕЦПЕРИОДА(&" + ПарамКнц + ", ДЕНЬ)
			|	ИНАЧЕ ТаблицаОбъектовИС." + ИмяФильтра + " МЕЖДУ НАЧАЛОПЕРИОДА(&" + ПарамНач + ", ДЕНЬ) И КОНЕЦПЕРИОДА(&" + ПарамКнц + ", ДЕНЬ)
			|КОНЕЦ) ";
			
			 ТекстУсловия = ТекстУсловия + Условие;
			Продолжить;	
		КонецЕсли;
		
		Если get_prop(ЗначенияФильтров, ИмяФильтра) = Неопределено Тогда
            Продолжить;
        КонецЕсли;
		Значение = ЗначенияФильтров[ИмяФильтра];
		
        Множественный = get_prop(Фильтр, "MULTI_SELECT", Ложь);

        // Найдём колонку по имени фильтра
        Колонка = Неопределено;
        Для каждого _Колонка Из Columns Цикл
            Если _Колонка["NAME"] = ИмяФильтра Тогда
                Колонка = _Колонка;
                Прервать;
            КонецЕсли;
        КонецЦикла; 
		Если Колонка = Неопределено Тогда 
			Продолжить; 
		КонецЕсли;
        ИмяПоля = get_prop(Колонка, "PROPERTY");
				
		Если ИмяФильтра = "СтатусСБИС" Тогда
			ПарамЗнач = ИмяФильтра;
			ПараметрыЗапроса.Вставить(ПарамЗнач, Значение);
			Условие = " И &УсловияСабиСтатусов" + Символы.ПС;
			
        ИначеЕсли ИмяФильтра = "СтатусИС" Тогда
			ПарамНеЗап = ИмяФильтра + "НеЗаполнено";
			ПарамЗнач = ИмяФильтра;
			ПараметрыЗапроса.Вставить(ПарамЗнач, Значение);
			Условие = 
			" И (&" + ПарамНеЗап + " " +
			"ИЛИ ВЫБОР " +
			"КОГДА &" + ПарамЗнач + " = ""0"" ТОГДА ТаблицаОбъектовИС.Проведен " +
			"КОГДА &" + ПарамЗнач + " = ""1"" ТОГДА (НЕ ТаблицаОбъектовИС.ПометкаУдаления И НЕ ТаблицаОбъектовИС.Проведен) " +
			"КОГДА &" + ПарамЗнач + " = ""2"" ТОГДА ТаблицаОбъектовИС.ПометкаУдаления " +
			// BSLLS:IncorrectLineBreak-off
			"КОГДА &" + ПарамЗнач + " = ""3"" ТОГДА НЕ ТаблицаОбъектовИС.ПометкаУдаления " +
			// BSLLS:IncorrectLineBreak-on
			"КОНЕЦ)" + Символы.ПС;
        
        Иначе
            // Обычный или множественный фильтр
			ПарамНеЗап = ИмяФильтра + "НеЗаполнено";
			ПарамЗнач = ИмяФильтра;
			ПараметрыЗапроса.Вставить(ПарамЗнач, Значение);

            Если Множественный Тогда
                Условие = " И (&" + ПарамНеЗап + " ИЛИ ТаблицаОбъектовИС." + ИмяПоля + " В (&" + ПарамЗнач + "))" + Символы.ПС;
            Иначе
                Условие = " И (&" + ПарамНеЗап + " ИЛИ ТаблицаОбъектовИС." + ИмяПоля + " = &" + ПарамЗнач + ")" + Символы.ПС;
            КонецЕсли;
        КонецЕсли;

        ТекстУсловия = ТекстУсловия + Условие;
		 
    КонецЦикла;
	
	// Фильтруем по строке поиска, если она есть  
	ИмяФильтра = "Search"; 
	Значение = get_prop(ЗначенияФильтров, ИмяФильтра);
	Если Значение <> Неопределено И ЗначениеЗаполнено(Значение) Тогда  
		УсловиеФильтра = "";
		ПарамЗнач = ИмяФильтра;
		//ПараметрыЗапроса.Вставить(ПарамЗнач, "%" + ОбщегоНазначения.СформироватьСтрокуДляПоискаВЗапросе(ИскомыйТекст) + "%"); 
		Значение = СтрЗаменить(Значение, "~", "~~");
		Значение = СтрЗаменить(Значение, "%", "~%");
		Значение = СтрЗаменить(Значение, "_", "~_");
		Значение = СтрЗаменить(Значение, "[", "~[");
		Значение = СтрЗаменить(Значение, "]", "~]");
		Значение = СтрЗаменить(Значение, "^", "~^");   
		ПараметрыЗапроса.Вставить(ПарамЗнач, "%" + Значение + "%"); 
		// Искать будем по только по Номер, Код или Название
		Для каждого Column из Columns Цикл  
			ИмяПоля = Column["PROPERTY"];
			Если ИмяПоля = Неопределено Тогда
				ИмяПоля = Column["NUMBER_PROPERTY"];
			КонецЕсли;  
			Если НЕ ИмяПоля = "Номер" И НЕ ИмяПоля = "Код" И НЕ ИмяПоля = "Наименование" Тогда
				Продолжить;
			КонецЕсли;
			// BSLLS:UnusedLocalVariable-off
			Если ЕстьСтандартныйРеквизит(МетаОбъект, ИмяПоля) Тогда     
				ТипРеквизита = МетаОбъект.СтандартныеРеквизиты[ИмяПоля].Тип;	
			ИначеЕсли МетаОбъект.Реквизиты.Найти(ИмяПоля) <> Неопределено Тогда
				ТипРеквизита = МетаОбъект.Реквизиты[ИмяПоля].Тип;
			// BSLLS:UnusedLocalVariable-on
			Иначе
				Продолжить;
			КонецЕсли;
			Условие = "Строка(ТаблицаОбъектовИС." + ИмяПоля + ") ПОДОБНО &" + ПарамЗнач + "" + Символы.ПС;
			Если УсловиеФильтра = "" Тогда
				УсловиеФильтра = УсловиеФильтра + " И (" + Условие;	
			Иначе  
				УсловиеФильтра = УсловиеФильтра + " ИЛИ " + Условие;	
			КонецЕсли;
		КонецЦикла;
		ТекстУсловия = ТекстУсловия + ?(УсловиеФильтра<>"", УсловиеФильтра+")", "");
    КонецЕсли;
	
    ТекстУсловия = СтрЗаменить(ТекстУсловия, "ГДЕ И", "ГДЕ ");
    Возврат ТекстУсловия;
КонецФункции

// BSLLS:CyclomaticComplexity-on
// BSLLS:CognitiveComplexity-on

Функция ЭтоНеПростойТип(Знач ИмяТипа) Экспорт
	Если ПустаяСтрока(ИмяТипа) Тогда
        Возврат Ложь;
	КонецЕсли;
	
	ПростыеТипы = Новый Массив;
	ПростыеТипы.Добавить("Число");
	ПростыеТипы.Добавить("Строка");
	ПростыеТипы.Добавить("Дата");
	ПростыеТипы.Добавить("Булево");
	
	Если ПростыеТипы.Найти(Строка(ИмяТипа)) = Неопределено Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции	

// BSLLS:DuplicateStringLiteral-on

