
// Функция block_extsys_print_form_list_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Массив - Результат выполения функции
//
//DynamicDirective
Функция block_extsys_print_form_list_calc_value(block_type, node, path, context, block_context)
	СписокПечатныхФорм = Новый Массив;
	ИдИС = get_prop(block_context.API3,"ИдИС");
	ИмяИС = get_prop(block_context.API3,"ИмяИС");
	Если ЗначениеЗаполнено(ИдИС) и ЗначениеЗаполнено(ИмяИС) Тогда 
		Попытка   
			DOC = ПолучитьСсылкуПоИдИС(ИмяИС, ИдИС);
			СписокПечатныхФорм = ПолучитьПечатныеФормы(DOC, СписокПечатныхФорм, Истина);
		// BSLLS:MissingCodeTryCatchEx-off
		Исключение
		// Нужно выполнить код и не упасть
		КонецПопытки;
		// BSLLS:MissingCodeTryCatchEx-on
	КонецЕсли;
	Возврат СписокПечатныхФорм;
КонецФункции

