
// Функция block_extsys_read_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Структура - Результат выполения функции
//
//DynamicDirective
Функция block_extsys_read_calc_value(block_type, node, path, context, block_context)
	Возврат ПолучитьДанныеОбъекта(block_context.object);	
КонецФункции

Функция ПолучитьДанныеОбъекта(СтруктураПараметров)
	СтруктураДанных = Новый Структура;
	
	Если Не ЗначениеЗаполнено(get_prop(СтруктураПараметров, "ТипИС")) Тогда
		МассивТипов = СтрРазделить82(СтруктураПараметров["ИмяИС"],".");
		СтруктураПараметров.Вставить("ТипИС", МассивТипов[0]);
		СтруктураПараметров.Вставить("ИмяИС", МассивТипов[1]);
	КонецЕсли;
	
	Если СтруктураПараметров["ТипИС"] = "Документы" Тогда
		ТипМетаданных = Документы;
	ИначеЕсли СтруктураПараметров["ТипИС"] = "Справочники" Тогда
		ТипМетаданных = Справочники;
	ИначеЕсли СтруктураПараметров["ТипИС"] = "Перечисления" Тогда
		ТипМетаданных = Перечисления;
	ИначеЕсли СтруктураПараметров["ТипИС"] = "ПланыВидовРасчета" Тогда
		ТипМетаданных = ПланыВидовРасчета;
	ИначеЕсли СтруктураПараметров["ТипИС"] = "ПланыВидовХарактеристик" Тогда
		ТипМетаданных = ПланыВидовХарактеристик;
// BSLLS:EmptyCodeBlock-off
	ИначеЕсли get_prop(СтруктураПараметров, "ТипИС") = Неопределено Тогда
// Сохраняем идентичность со структурой кода в Питоне		
	Иначе
// BSLLS:EmptyCodeBlock-on		
		Возврат СтруктураДанных;
	КонецЕсли;
	
	Если СтруктураПараметров["ТипИС"] = "Перечисления" Тогда
		СсылкаОбъекта = ТипМетаданных[СтруктураПараметров["ИмяИС"]][СтруктураПараметров["ИдИС"]];
	Иначе
		СсылкаОбъекта = ТипМетаданных[СтруктураПараметров["ИмяИС"]].ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураПараметров["ИдИС"]));
	КонецЕсли;
    СтруктураДанных = ПолучитьДанныеПоСсылкеОбъекта(СсылкаОбъекта);
    
    Возврат СтруктураДанных;
КонецФункции

Функция ПолучитьДанныеПоСсылкеОбъекта(СсылкаОбъекта)
	СтруктураДанных = ПолучитьСтруктуруИзОбъекта(СсылкаОбъекта);
    СтруктураДанных.Вставить("_Представление", Строка(СсылкаОбъекта));
    
    Возврат СтруктураДанных;
КонецФункции	
