
// Функция block_file_read_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Строка - Результат выполения функции
//
//DynamicDirective
Функция block_file_read_calc_value(block_type, node, path, context, block_context)
	
	Данные = block_context.FILEPATH;
	ТипДанных = ТипЗнч(Данные);
	Если ТипДанных = Тип("Строка") Тогда // Путь к файлу
		РезультатДД = Новый ДвоичныеДанные(Данные); // Получить двоичные данные из файла по пути
	ИначеЕсли ТипДанных = Тип("ХранилищеЗначения") Тогда // Хранилище значения
		РезультатДД = Данные.Получить(); // Получить двоичные данные из поля ХранилищеЗначения
	Иначе
		Возврат "";
	КонецЕсли;
	
	Возврат Base64Строка(РезультатДД);
КонецФункции

