Функция block_math_round_calc_value(block_type, node, path, context, block_context)	
	_Число = Число(get_prop(block_context, "NUM"));
	Результат = Неопределено;
	Если block_context.OP = "ROUND" Тогда
		Результат = ОКР(_Число); 
	ИначеЕсли block_context.OP = "ROUNDUP" Тогда
		Если _Число > 0 Тогда
			Результат = Число(Формат(_Число, "ЧДЦ=0"))+1;
		Иначе
			Результат = Число(Формат(_Число, "ЧДЦ=0"));
		КонецЕсли;
	ИначеЕсли block_context.OP = "ROUNDDOWN" Тогда
		Если _Число >= 0 Тогда
			Результат = Число(Формат(_Число, "ЧДЦ=0"));
		Иначе
			Результат = Число(Формат(_Число, "ЧДЦ=0"))-1;
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;	
КонецФункции	
