
// Функция block_math_round_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Произвольный - Результат выполения функции
//
// Сохраняем идентичность со структурой кода в Питоне
// BSLLS:IfElseIfEndsWithElse-off
// BSLLS:CognitiveComplexity-off
//DynamicDirective
Функция block_math_round_calc_value(block_type, node, path, context, block_context)	
	_Число = Число(get_prop(block_context, "NUM"));
	Результат = Неопределено;
	Если block_context.OP = "ROUND" Тогда
		Результат = ОКР(_Число); 
	ИначеЕсли block_context.OP = "ROUNDUP" Тогда
		Если _Число > 0 Тогда
			ЧислоМассив = Saby_СтрРазделить82(Строка(_Число), ",");
			Если ЧислоМассив.Количество() > 1 Тогда
				Если ЧислоМассив[1] = "0" Тогда  
					Результат = Цел(_Число);
				Иначе
					Результат = Цел(_Число) + 1;
				КонецЕсли;
			Иначе
				Результат = _Число;
			КонецЕсли;
		ИначеЕсли _Число < 0 Тогда 
			Результат = Цел(_Число);
		Иначе
			Результат = _Число;
		КонецЕсли;
	ИначеЕсли block_context.OP = "ROUNDDOWN" Тогда
		Если _Число > 0 Тогда
			Результат = Цел(_Число);
		ИначеЕсли _Число < 0 Тогда			
			ЧислоМассив = Saby_СтрРазделить82(Строка(_Число), ",");
			Если ЧислоМассив.Количество() > 1 Тогда
				Если ЧислоМассив[1] = "0" Тогда  
					Результат = Цел(_Число);
				Иначе
					Результат = Цел(_Число) - 1;
				КонецЕсли;
			Иначе
				Результат = _Число;
			КонецЕсли;
		Иначе
			Результат = _Число;	
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;	
КонецФункции	
// BSLLS:IfElseIfEndsWithElse-on
// BSLLS:CognitiveComplexity-on
