
Функция block_object_type_calc_value(block_type, node, path, context, block_context)
	Объект = get_prop(block_context, "OBJECT");
	
	СоотвествиеТипов = Новый Соответствие;
	СоотвествиеТипов.Вставить(Тип("Число"), "number");
	СоотвествиеТипов.Вставить(Тип("Строка"), "string");
	СоотвествиеТипов.Вставить(Тип("Массив"), "array");
	СоотвествиеТипов.Вставить(Тип("СписокЗначений"), "array");
	СоотвествиеТипов.Вставить(Тип("Структура"), "object");
	СоотвествиеТипов.Вставить(Тип("Соответствие"), "object");
	СоотвествиеТипов.Вставить(Тип("Булево"), "boolean");
	СоотвествиеТипов.Вставить(Тип("Неопределено"), "null");
		
	ТипОбъекта = ТипЗнч(Объект);
	Возврат get_prop(СоотвествиеТипов, ТипОбъекта, "null");		
	
КонецФункции

