
// Возвращает записи присоединенных файлов объекта в зависимости от типа.
//
// Не видит описание параметров
// BSLLS:MissingParameterDescription-off
// Параметры:
//  block_context                - Контекст исполняемого блока.
//  ТипФайлов                    - строка = определяет тип возвращаемых данных.
//                               = "Файлы" - возвращаем прикрепленные файлы.
//                               = "ФайлыЭДО" - возвращаем прикрепленные файлы ЭДО.
//
// Возвращаемое значение:
//  Массив                       - массив с присоединенными файлами.
//                                 состав полей смотреть в описании соответствующих функций:
//                                   ПрикрепленныеФайлыКОбъекту()
//                                   ПрикрепленныеФайлыЭДОКОбъекту()
//
// Нет возможности красиво уменьшить Уменьшите когнитивную сложность, будет непонятная лапша из кода
// BSLLS:CognitiveComplexity-off
Функция ПрикрепленныеФайлыПоТипу(block_context, ТипФайлов = "")
	
	Результат = Новый Массив;
	
	// Доп.параметры
	ИменаФайлов = get_prop(block_context, "NAMES", Неопределено);
	ИзмененныеПосле = get_prop(block_context, "CHANGED_AFTER", Неопределено);
	НужныДвоичныеДанные = get_prop(block_context, "RECEIVING_BINARY_DATA", Неопределено);
	
	МассивСсылок = Новый Массив;
	Если ТипФайлов = "Файлы" Тогда
		МассивСсылок = ПрикрепленныеФайлыКОбъекту(block_context.OBJECT, ИменаФайлов, ИзмененныеПосле);
	Иначе
		Если ТипФайлов = "ФайлыЭДО" Тогда
			МассивСсылок = ПрикрепленныеФайлыЭДОКОбъекту(block_context.OBJECT, ИменаФайлов, ИзмененныеПосле);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(МассивСсылок) Тогда
		Возврат Результат;
	КонецЕсли;
	
	_ТекущаяВерсияРасширение = "ТекущаяВерсияРасширение";
	Для Каждого ПрикрепленныйФайл Из МассивСсылок Цикл
		ИмяФайла = ПрикрепленныйФайл.Наименование;
		ТипСправочника = ТипЗнч(ПрикрепленныйФайл);
		ИмяСправочника = Метаданные.НайтиПоТипу(ТипСправочника).Имя;
		Если Метаданные.Справочники[ИмяСправочника].Реквизиты.Найти("Расширение") <> Неопределено Тогда
			Если ЗначениеЗаполнено(ПрикрепленныйФайл["Расширение"]) Тогда
				ИмяФайла = ИмяФайла + "." + ПрикрепленныйФайл["Расширение"];
			КонецЕсли;	
		Иначе
			Если Метаданные.Справочники[ИмяСправочника].Реквизиты.Найти(_ТекущаяВерсияРасширение) <> Неопределено Тогда
				Если ЗначениеЗаполнено(ПрикрепленныйФайл[_ТекущаяВерсияРасширение]) Тогда
					ИмяФайла = ИмяФайла + "." + ПрикрепленныйФайл[_ТекущаяВерсияРасширение];
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
		ТипКонтента = ПолучитьКонтентТипВложения(ИмяФайла);
		
		ФайлBase64  = Неопределено;
		Если НужныДвоичныеДанные = "TRUE" Тогда
			ФайлДД = ПолучитьДвоичныеДанныеПрикрепленногоФайла(ПрикрепленныйФайл.Ссылка);
			ФайлBase64 = Base64Строка(ФайлДД); // Если нужны двоичные данные
		КонецЕсли;
		
		Файл = Новый Соответствие;
		Вложение = Новый Соответствие;
		Вложение.Вставить("Файл", Файл);
	    ВставитьСвойствоЕслиНет(Вложение["Файл"], "Имя", ИмяФайла);
	    ВставитьСвойствоЕслиНет(Вложение["Файл"], "ДвоичныеДанные", ФайлBase64);
	    ВставитьСвойствоЕслиНет(Вложение["Файл"], "ContentType", ТипКонтента);
		
		Результат.Добавить(Вложение);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции
// BSLLS:MissingParameterDescription-on
// BSLLS:CognitiveComplexity-on

// Функция block_object_get_attachments_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Неопределено - Результат выполения функции
//
//DynamicDirective
Функция block_object_get_attachments_calc_value(block_type, node, path, context, block_context)
	Возврат ПрикрепленныеФайлыПоТипу(block_context, "Файлы");
КонецФункции
