
// Функция block_obj_prop_append_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Неопределено - Результат выполения функции
//
// Сохраняем идентичность со структурой кода в Питоне
// BSLLS-off
//DynamicDirective
Функция block_obj_prop_append_calc_value(block_type, node, path, context, block_context)
	obj = block_get_variable(context, block_context["VAR"]);
	value = block_context["VALUE"];
	Если obj = value Тогда
		ВызватьИсключение "Объект не может быть добавлен в этот же объект"; 
	КонецЕсли;	
	obj_path = block_context["PATH"];
	Если ЗначениеЗаполнено(obj_path) Тогда
		//obj[block_context["PATH"]].append(value);
		block_obj_append_path_value(obj, obj_path, value);
	Иначе
		Если Найти(Строка(obj), "ТабличнаяЧасть") Тогда   
			_variable = obj.Добавить();
			Если ТипЗнч(value)= тип("Структура") или ТипЗнч(value) = Тип("Соответствие") Тогда
				Для Каждого field из value цикл
					Попытка
						_variable[field.Ключ] = field.Значение;
					Исключение
					КонецПопытки;
				КонецЦикла;
			КонецЕсли;
		ИначеЕсли Найти(Строка(obj), "ТаблицаЗначений") Тогда 
			Для Каждого field Из value Цикл
				ИмяКолонки = field.Ключ;
				Если obj.Колонки.Найти(ИмяКолонки) = Неопределено Тогда
					Попытка
						obj.Колонки.Добавить(ИмяКолонки);
					Исключение
						Продолжить;
					КонецПопытки;
				КонецЕсли;
			КонецЦикла;
			Строка = obj.Добавить();
			Для Каждого field Из value Цикл
				Попытка
					Строка[field.Ключ] = field.Значение;
				Исключение
					Продолжить;
				КонецПопытки;
			КонецЦикла;		
		Иначе	
			Попытка
				obj.Добавить(value);
			Исключение   
				Текст = "Объект не является списочным типом. Текущий тип объекта: "+ТипЗнч(obj);
				ВызватьИсключение Текст; 
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;	
	block_set_variable(context, block_context["VAR"], obj);
	Возврат Неопределено;
КонецФункции
// BSLLS-on
