
// Функция block_re_search_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Соответствие - Результат выполения функции
//
//DynamicDirective
Функция block_re_search_calc_value(block_type, node, path, context, block_context)
	_Строка = get_prop(block_context, "value");
	_ПодстрокаПоиска = get_prop(block_context, "re");
	Если _Строка <> Неопределено И _ПодстрокаПоиска <> Неопределено Тогда
		Возврат Найти(Строка(_Строка), Строка(_ПодстрокаПоиска));
	КонецЕсли;
	Возврат Неопределено;	
КонецФункции	
