
// Функция block_string_to_date_calc_value
//
// Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//
// Возвращаемое значение:
//  Строка - Результат выполения функции
//
//DynamicDirective
Функция block_string_to_date_calc_value(block_type, node, path, context, block_context)
	
	Значение = get_prop(block_context, "VALUE");
	СтрФормат = get_prop(block_context, "TEMPLATE");
	
	Попытка
		Дата = ДатаИзПитонФормата(Значение, СтрФормат);
		Возврат Дата;
	Исключение
		Инфо = ИнформацияОбОшибке();
		Если Инфо.Код = "1" Тогда
			Ошибка = NewExtExceptionСтрока(, "Неверный формат даты",
				"Проверьте заполненность формата даты для значения " + Значение + Символы.ПС + "(format)", "format_to_date");
			ВызватьИсключение Ошибка;
		Иначе
			Ошибка = NewExtExceptionСтрока(, "Неверный формат даты",
				"Значение " + Значение + " не соответствует формату " + СтрФормат + Символы.ПС + "(format)", "format_to_date");
			ВызватьИсключение Ошибка;
		КонецЕсли;
	КонецПопытки;
	
КонецФункции

// Функция ДатаИзПитонФормата
//
// Параметры:
// СтрокаДаты - Строка - Дата в строковом представлении
// ФорматПитон - Строка - Формат даты
//
// Возвращаемое значение:
//  Дата - Результат выполения функции
//
//DynamicDirective
Функция ДатаИзПитонФормата(СтрокаДаты, ФорматПитон)
	
	ДатаСтруктура = Новый Структура("Год, Месяц, День", 1900, 1, 1);
	ДатаСтруктура.Вставить("Час", 0);
	ДатаСтруктура.Вставить("Минута", 0);
	ДатаСтруктура.Вставить("Секунда", 0);
	
	ПозицияДата = 1;
	ПозицияФормат = 1;
	
	Пока ПозицияФормат <= СтрДлина(ФорматПитон) Цикл
		Символ = Сред(ФорматПитон, ПозицияФормат, 1);
		Если Символ = "%" Тогда
			ПозицияФормат = ПозицияФормат + 1;
			Код = Сред(ФорматПитон, ПозицияФормат, 1);
			РазобратьКодФорматаПитон(Код, СтрокаДаты, ПозицияДата, ДатаСтруктура);
		Иначе
			// Проверяем на разделитель
			Если Сред(СтрокаДаты, ПозицияДата, 1) <> Символ Тогда
				Ошибка = NewExtExceptionСтрока(, "Неверный формат даты",
					"Значение " + СтрокаДаты + " не соответствует формату " + ФорматПитон + Символы.ПС + "(format)", "format_to_date");
				ВызватьИсключение Ошибка;
			КонецЕсли;
			ПозицияДата = ПозицияДата + 1;
		КонецЕсли;
		ПозицияФормат = ПозицияФормат + 1;
	КонецЦикла;
	Возврат Дата(ДатаСтруктура.Год, ДатаСтруктура.Месяц, ДатаСтруктура.День,
		ДатаСтруктура.Час, ДатаСтруктура.Минута, ДатаСтруктура.Секунда);
КонецФункции

// Получает код из ISO формата, обновляет индекс и заполняет структуру с датой
//
// Параметры:
// 	Код - Строка - текущий код из Шаблона
// 	СтрокаДаты - Строка - Дата в строковом представлении
// 	ПозицияДата - Число - Указатель позиции при разборе даты
// 	ДатаСтруктура - Структура - Содержит элементы даты
//
//DynamicDirective
Процедура РазобратьКодФорматаПитон(Знач Код, СтрокаДаты, ПозицияДата, ДатаСтруктура)
	// BSLLS:MagicNumber-off Код подразумевает определенное количество символов
	Если Код = "Y" Тогда
		ДатаСтруктура.Год = Число(Сред(СтрокаДаты, ПозицияДата, 4));
		ПозицияДата = ПозицияДата + 4;
	ИначеЕсли Код = "y" Тогда
		Год = Число(Сред(СтрокаДаты, ПозицияДата, 2));
		Если Год >= 69 Тогда
			ДатаСтруктура.Год = Год + 1900;
		Иначе
			ДатаСтруктура.Год = Год + 2000;
		КонецЕсли;
		ПозицияДата = ПозицияДата + 2;
	ИначеЕсли Код = "m" Тогда
		ДатаСтруктура.Месяц = Число(Сред(СтрокаДаты, ПозицияДата, 2));
		ПозицияДата = ПозицияДата + 2;
	ИначеЕсли Код = "d" Тогда
		ДатаСтруктура.День = Число(Сред(СтрокаДаты, ПозицияДата, 2));
		ПозицияДата = ПозицияДата + 2;
	ИначеЕсли Код = "H" Тогда
		ДатаСтруктура.Час = Число(Сред(СтрокаДаты, ПозицияДата, 2));
		ПозицияДата = ПозицияДата + 2;
	ИначеЕсли Код = "M" Тогда
		ДатаСтруктура.Минута = Число(Сред(СтрокаДаты, ПозицияДата, 2));
		ПозицияДата = ПозицияДата + 2;
	ИначеЕсли Код = "S" Тогда
		ДатаСтруктура.Секунда = Число(Сред(СтрокаДаты, ПозицияДата, 2));
		ПозицияДата = ПозицияДата + 2;
	ИначеЕсли Код = "f" Тогда
		ПозицияДата = ПозицияДата + 6;
	Иначе
		Возврат;
	КонецЕсли;
	// BSLLS:MagicNumber-on
КонецПроцедуры
