
//DynamicDirective
// BSLLS:CognitiveComplexity-off
Функция block_taxmon2_indicator_turnover_account_calc_value(block_type, node, path, context, block_context)
	Если НЕ ЗначениеЗаполнено(КэшОперации) Тогда
		ИнициализацияКэшаОперации();
	КонецЕсли;
	ЭлементКэша = get_prop(КэшОперации.Значение, "indicator_list_src");
	Если Не ЗначениеЗаполнено(ЭлементКэша) Тогда
		indicator_list_src = get_prop(context_variables_get(context), "indicator_list_src");
		ПоказателиИС = index_indicators_by_name(indicator_list_src);
		ЗаписатьВКэшОперации(КэшОперации, ЭлементКэша, "indicator_list_src", ПоказателиИС);
	Иначе
		ПоказателиИС = ЭлементКэша.Значение;
		ЭлементКэша.Частота = ЭлементКэша.Частота + 1;
	КонецЕсли;
	
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СписокОрганизаций
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка = &НашаОрганизация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ОстаткиНаНачало.СуммаОстатокДт) КАК БУОбщийНачальныйОстатокДт,
	|	СУММА(ОстаткиНаНачало.СуммаОстатокКт) КАК БУОбщийНачальныйОстатокКт
	|ПОМЕСТИТЬ ОстаткиНаНачало
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&ДатаНач,
	|			Счет В ИЕРАРХИИ (&Счет),
	|			,
	|			Организация В
	|				(ВЫБРАТЬ
	|					СписокОрганизаций.Ссылка КАК Ссылка
	|				ИЗ
	|					СписокОрганизаций КАК СписокОрганизаций)) КАК ОстаткиНаНачало
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ОстаткиНаКонец.СуммаОстатокДт) КАК БУОбщийКонечныйОстатокДт,
	|	СУММА(ОстаткиНаКонец.СуммаОстатокКт) КАК БУОбщийКонечныйОстатокКт
	|ПОМЕСТИТЬ ОстаткиНаКонец
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&Граница,
	|			Счет В ИЕРАРХИИ (&Счет),
	|			,
	|			Организация В
	|				(ВЫБРАТЬ
	|					СписокОрганизаций.Ссылка КАК Ссылка
	|				ИЗ
	|					СписокОрганизаций КАК СписокОрганизаций)) КАК ОстаткиНаКонец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ОстаткиНаНачало.БУОбщийНачальныйОстатокДт, 0) КАК БУОбщийНачальныйОстатокДт,
	|	ЕСТЬNULL(ОстаткиНаНачало.БУОбщийНачальныйОстатокКт, 0) КАК БУОбщийНачальныйОстатокКт,
	|	ЕСТЬNULL(ОстаткиНаКонец.БУОбщийКонечныйОстатокДт, 0) КАК БУОбщийКонечныйОстатокДт,
	|	ЕСТЬNULL(ОстаткиНаКонец.БУОбщийКонечныйОстатокКт, 0) КАК БУОбщийКонечныйОстатокКт
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	ОстаткиНаНачало КАК ОстаткиНаНачало,
	|	ОстаткиНаКонец КАК ОстаткиНаКонец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Остатки.БУОбщийНачальныйОстатокКт <> 0
	|				И (Остатки.БУОбщийНачальныйОстатокДт = 0
	|					ИЛИ Остатки.БУОбщийНачальныйОстатокКт - Остатки.БУОбщийНачальныйОстатокДт > 0)
	|			ТОГДА Остатки.БУОбщийНачальныйОстатокКт - Остатки.БУОбщийНачальныйОстатокДт
	|		ИНАЧЕ Остатки.БУОбщийНачальныйОстатокДт - Остатки.БУОбщийНачальныйОстатокКт
	|	КОНЕЦ КАК БУОбщийНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА Остатки.БУОбщийКонечныйОстатокКт <> 0
	|				И (Остатки.БУОбщийКонечныйОстатокДт = 0
	|					ИЛИ Остатки.БУОбщийКонечныйОстатокКт - Остатки.БУОбщийКонечныйОстатокДт > 0)
	|			ТОГДА Остатки.БУОбщийКонечныйОстатокКт - Остатки.БУОбщийКонечныйОстатокДт
	|		ИНАЧЕ Остатки.БУОбщийКонечныйОстатокДт - Остатки.БУОбщийКонечныйОстатокКт
	|	КОНЕЦ КАК БУОбщийКонечныйОстаток,
	|	ВЫБОР
	|		КОГДА Остатки.БУОбщийНачальныйОстатокКт <> 0
	|				И (Остатки.БУОбщийНачальныйОстатокДт = 0
	|					ИЛИ Остатки.БУОбщийНачальныйОстатокКт - Остатки.БУОбщийНачальныйОстатокДт > 0)
	|			ТОГДА 0
	|		КОГДА Остатки.БУОбщийНачальныйОстатокДт - Остатки.БУОбщийНачальныйОстатокКт <> 0
	|			ТОГДА 1
	|	КОНЕЦ КАК БУОбщийНачальныйОстатокФлаг,
	|	ВЫБОР
	|		КОГДА Остатки.БУОбщийКонечныйОстатокКт <> 0
	|				И (Остатки.БУОбщийКонечныйОстатокДт = 0
	|					ИЛИ Остатки.БУОбщийКонечныйОстатокКт - Остатки.БУОбщийКонечныйОстатокДт > 0)
	|			ТОГДА 0
	|		КОГДА Остатки.БУОбщийКонечныйОстатокДт - Остатки.БУОбщийКонечныйОстатокКт <> 0
	|			ТОГДА 1
	|	КОНЕЦ КАК БУОбщийКонечныйОстатокФлаг
	|ПОМЕСТИТЬ ТаблицаИтоги
	|ИЗ
	|	Остатки КАК Остатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ХозрасчетныйОстаткиИОбороты.Период КАК Период,
	|	ХозрасчетныйОстаткиИОбороты.УточнениеПериода КАК УточнениеПериода,
	|	ХозрасчетныйОстаткиИОбороты.Регистратор КАК Регистратор,
	|	ХозрасчетныйОстаткиИОбороты.НомерСтроки КАК НомерСтроки,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстатокДт КАК БУНачальныйОстатокДт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстатокКт КАК БУНачальныйОстатокКт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт КАК БУОборотДт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт КАК БУОборотКт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокДт КАК БУКонечныйОстатокДт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокКт КАК БУКонечныйОстатокКт
	|ПОМЕСТИТЬ ХозрасчетныйОстаткиИОбороты
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	|			&ДатаНач,
	|			&ДатаКнц,
	|			Запись,
	|			,
	|			Счет В ИЕРАРХИИ (&Счет),
	|			,
	|			Организация В
	|				(ВЫБРАТЬ
	|					СписокОрганизаций.Ссылка КАК Ссылка
	|				ИЗ
	|					СписокОрганизаций КАК СписокОрганизаций)) КАК ХозрасчетныйОстаткиИОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Регистратор,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДвиженияССубконто.Период КАК Период,
	|	ДвиженияССубконто.УточнениеПериода КАК УточнениеПериода,
	|	ДвиженияССубконто.Регистратор КАК Регистратор,
	|	ДвиженияССубконто.НомерСтроки КАК НомерСтроки,
	|	ДвиженияССубконто.СчетДт КАК СчетДт,
	|	ДвиженияССубконто.СубконтоДт1 КАК СубконтоДт1,
	|	ДвиженияССубконто.СубконтоДт2 КАК СубконтоДт2,
	|	ДвиженияССубконто.СубконтоДт3 КАК СубконтоДт3,
	|	ДвиженияССубконто.СчетКт КАК СчетКт,
	|	ДвиженияССубконто.СубконтоКт1 КАК СубконтоКт1,
	|	ДвиженияССубконто.СубконтоКт2 КАК СубконтоКт2,
	|	ДвиженияССубконто.СубконтоКт3 КАК СубконтоКт3,
	|	ДвиженияССубконто.ПодразделениеДт КАК ПодразделениеДт,
	|	ДвиженияССубконто.ПодразделениеКт КАК ПодразделениеКт,
	|	ДвиженияССубконто.Содержание КАК Содержание
	|ПОМЕСТИТЬ ДвиженияССубконто
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(
	|			&ДатаНач,
	|			&ДатаКнц,
	|			Счет В ИЕРАРХИИ (&Счет)
	|				И Активность = ИСТИНА
	|				И Организация В
	|					(ВЫБРАТЬ
	|						СписокОрганизаций.Ссылка КАК Ссылка
	|					ИЗ
	|						СписокОрганизаций КАК СписокОрганизаций),
	|			,
	|			) КАК ДвиженияССубконто
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Регистратор,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДвиженияССубконто.Период КАК Период,
	|	ДвиженияССубконто.УточнениеПериода КАК УточнениеПериода,
	|	ДвиженияССубконто.Регистратор КАК Регистратор,
	|	ДвиженияССубконто.НомерСтроки КАК НомерСтроки,
	|	ДвиженияССубконто.СчетДт КАК СчетДт,
	|	ДвиженияССубконто.СубконтоДт1 КАК СубконтоДт1,
	|	ДвиженияССубконто.СубконтоДт2 КАК СубконтоДт2,
	|	ДвиженияССубконто.СубконтоДт3 КАК СубконтоДт3,
	|	ДвиженияССубконто.СчетКт КАК СчетКт,
	|	ДвиженияССубконто.СубконтоКт1 КАК СубконтоКт1,
	|	ДвиженияССубконто.СубконтоКт2 КАК СубконтоКт2,
	|	ДвиженияССубконто.СубконтоКт3 КАК СубконтоКт3,
	|	ДвиженияССубконто.ПодразделениеДт КАК ПодразделениеДт,
	|	ДвиженияССубконто.ПодразделениеКт КАК ПодразделениеКт,
	|	ДвиженияССубконто.Содержание КАК Содержание,
	|	ИСТИНА КАК ОбщиеИтоги,
	|	ХозрасчетныйОстаткиИОбороты.БУНачальныйОстатокДт КАК БУНачальныйОстатокДт,
	|	ХозрасчетныйОстаткиИОбороты.БУНачальныйОстатокКт КАК БУНачальныйОстатокКт,
	|	ХозрасчетныйОстаткиИОбороты.БУОборотДт КАК БУОборотДт,
	|	ХозрасчетныйОстаткиИОбороты.БУОборотКт КАК БУОборотКт,
	|	ХозрасчетныйОстаткиИОбороты.БУКонечныйОстатокДт КАК БУКонечныйОстатокДт,
	|	ХозрасчетныйОстаткиИОбороты.БУКонечныйОстатокКт КАК БУКонечныйОстатокКт,
	|	ТаблицаИтоги.БУОбщийНачальныйОстаток КАК БУОбщийНачальныйОстаток,
	|	ТаблицаИтоги.БУОбщийКонечныйОстаток КАК БУОбщийКонечныйОстаток,
	|	ТаблицаИтоги.БУОбщийНачальныйОстатокФлаг КАК БУОбщийНачальныйОстатокФлаг,
	|	ТаблицаИтоги.БУОбщийКонечныйОстатокФлаг КАК БУОбщийКонечныйОстатокФлаг,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияССубконто.Регистратор) КАК РегистраторПредставление,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияССубконто.СчетДт) КАК СчетДтПредставление,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияССубконто.СчетКт) КАК СчетКтПредставление
	|ИЗ
	|    ХозрасчетныйОстаткиИОбороты КАК ХозрасчетныйОстаткиИОбороты
	|        ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДвиженияССубконто КАК ДвиженияССубконто
	|        ПО ХозрасчетныйОстаткиИОбороты.Период = ДвиженияССубконто.Период
	|            И ХозрасчетныйОстаткиИОбороты.УточнениеПериода = ДвиженияССубконто.УточнениеПериода
	|            И ХозрасчетныйОстаткиИОбороты.Регистратор = ДвиженияССубконто.Регистратор
	|            И ХозрасчетныйОстаткиИОбороты.НомерСтроки = ДвиженияССубконто.НомерСтроки,
	|    ТаблицаИтоги КАК ТаблицаИтоги
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОбщиеИтоги";
	
	api3_taxmon_report = get_prop(block_context, "_api3_taxmon_report");
	declaration_indicator_id = get_prop(block_context, "_declaration_indicator_id");
	Название = get_prop(block_context, "NAME");
	СторонаУчета = get_prop(block_context, "TYPE");
	СторонаУчетаЗапрос = ?(СторонаУчета = "D", "Дт", "Кт");
	СторонаУчетаФормула = ?(СторонаУчета = "D", "ОД", "ОК");

	ПараметрыЗапроса = Новый Структура;
	Показатель = get_prop(ПоказателиИС, Название, Новый Соответствие);
	ИдентифПараметры = get_prop(Показатель, "Параметры", Новый Соответствие);
	Счет = get_prop(ИдентифПараметры, "Счет");	
	Для каждого ИдентифПарам Из ИдентифПараметры Цикл
		Если Лев(ИдентифПарам.Ключ, 9) = "Аналитика" И ТипЗнч(ИдентифПарам.Значение) = Тип("Массив") Тогда
			НомерАналитики = Прав(ИдентифПарам.Ключ, 1);
			
			ЗначениеАналитики = "УсловиеЗапроса" + ИдентифПарам.Значение[0];
			
			КонтекстФункции = Новый Структура("NAME, ENDPOINT", "Blockly_НДПоНалогуНаПрибыль_read", ЗначениеАналитики);
			РезультатРасчетаАналитики = block_execute_workspace_calc_value(block_type, node, path, context, КонтекстФункции);
			
			УсловиеЗапросаПоАналитике = get_prop(РезультатРасчетаАналитики, "УсловиеЗапроса");
			УсловиеЗапросаПоАналитике = СтрЗаменить(УсловиеЗапросаПоАналитике, "Субконто", "Субконто" + СторонаУчетаЗапрос + НомерАналитики);
			ПараметрыЗапросаПоАналитике = get_prop(РезультатРасчетаАналитики, "ПараметрыЗапроса");
			Если Найти(ТекстЗапроса, " ГДЕ ДвиженияССубконто.") > 0 Тогда
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, " ГДЕ ДвиженияССубконто.", " ГДЕ ДвиженияССубконто."  + УсловиеЗапросаПоАналитике + " И ДвиженияССубконто.");
			Иначе
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ") КАК ДвиженияССубконто", ") КАК ДвиженияССубконто" + " ГДЕ ДвиженияССубконто." + УсловиеЗапросаПоАналитике);
			КонецЕсли;	
			Для каждого _param Из ПараметрыЗапросаПоАналитике Цикл
				ЗначениеПараметра = ПривестиAPI3ОбъектКСсылке(_param.Значение);
				ПараметрыЗапроса.Вставить(_param.Ключ, ЗначениеПараметра);
			КонецЦикла;
		КонецЕсли;	
	КонецЦикла;
	
	РезультатЗапроса = ПолучитьОборотыПоСчету(api3_taxmon_report, ТекстЗапроса, ПараметрыЗапроса, Счет);
	
	ДобавитьВОбмен = Новый Массив();
	ИтогСумма = 0;
	ИдРасшифровки = 1;
	Для каждого Строка Из РезультатЗапроса Цикл
		Сумма = get_prop(Строка, "БУОборот"+СторонаУчетаЗапрос, 0);
		Если Не Сумма = 0 Тогда
			ИдИС = get_prop(api3_taxmon_report, "ИдИС")+"|"+declaration_indicator_id+"|"+СторонаУчетаФормула+" "+Название+"|"+ИдРасшифровки;
			ИдСБИС = get_prop(api3_taxmon_report, "ИдИС")+"|"+declaration_indicator_id+"|"+СторонаУчетаФормула+" "+Название;
			
			СтрокаВОбмен = Новый Структура;
			СтрокаВОбмен.Вставить("ИдИС", ИдИС);
			СтрокаВОбмен.Вставить("ИмяИС", "Справочники.РасшифровкаПоказателяСтрокиОтчета");
			СтрокаВОбмен.Вставить("ИдСБИС", ИдСБИС);
			СтрокаВОбмен.Вставить("ТипСБИС", "ЭлементыТабличныхЧастей");
			СтрокаВОбмен.Вставить("ИмяСБИС", "РасшифровкаПоказателяСтрокиОтчета");
			СтрокаВОбмен.Вставить("Название", Строка.РегистраторПредставление);
			СтрокаВОбмен.Вставить("Дата", Формат(Строка.Период, "ДФ=yyyy-MM-dd"));
			СтрокаВОбмен.Вставить("Сумма", Сумма);
			ini_name = ИмяМетаданныхПоСсылкеНаОбъект(Строка.Регистратор)+"_read";
			Попытка
				Load_ini(ini_name);
			Исключение
				ini_name = "БухгалтерскаяСправка_read";
			КонецПопытки;
			
			Документ = Api3Object(Строка.Регистратор, "");
			Документ.Вставить("Ини", ini_name); 
			СтрокаВОбмен.Вставить("Документ", Документ);
			
			ДобавитьВОбмен.Добавить(СтрокаВОбмен);
			
			ИдРасшифровки = ИдРасшифровки  + 1;
			ИтогСумма = ИтогСумма + Сумма;
		КонецЕсли;
	КонецЦикла;
	// BSLLS:UnusedLocalVariable-off
	result = block_extsyncdoc_write("import_api3_obj", ДобавитьВОбмен, context, Ложь);
    // BSLLS:UnusedLocalVariable-on
	Формула = Новый Массив;
	Формула.Добавить(Новый Структура("Ид, Операция", СторонаУчетаФормула + " " + Название, "+"));
	Возврат Новый Структура("Сумма, Формула", ИтогСумма, Формула);
	
КонецФункции
// BSLLS:CognitiveComplexity-on

Функция ПолучитьОборотыПоСчету(api3_taxmon_report, ТекстЗапроса, ПараметрыЗапроса, Счет)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач", ПреобразоватьСтрокуВДату("yyyy-MM-dd", get_prop(api3_taxmon_report, "ДатаНач")));
	ДатаКнц = ПреобразоватьСтрокуВДату("yyyy-MM-dd HH:mm:ss", get_prop(api3_taxmon_report, "ДатаКнц") + " 23:59:59");
	Запрос.УстановитьПараметр("ДатаКнц", ДатаКнц);
	Запрос.УстановитьПараметр("НашаОрганизация", ПривестиAPI3ОбъектКСсылке(get_prop(api3_taxmon_report, "НашаОрганизация")));
	Запрос.УстановитьПараметр("Счет", ПланыСчетов["Хозрасчетный"].НайтиПоРеквизиту("КодБыстрогоВыбора", Счет));
	Запрос.УстановитьПараметр("Граница", Новый Граница(ДатаКнц, ВидГраницы.Включая));
	Для каждого _param Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(_param.Ключ, _param.Значение);
	КонецЦикла;
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат РезультатЗапроса;
КонецФункции

Функция ИмяМетаданныхПоСсылкеНаОбъект(СсылкаНаОбъект)
	ТипЗначения = ТипЗнч(СсылкаНаОбъект);
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначения);
	Возврат ОбъектМетаданных.Имя;
КонецФункции

// Функция index_indicators_by_account_code
//
// Параметры:
//  Показатели - Массив - Массив показателей в начальном виде
//
// Возвращаемое значение:
//  Массив - Результат выполнения функции = индексированные показатели по коду
//
Функция index_indicators_by_account_code(Показатели)
	
	ИндексированныеПоказатели = Новый Соответствие;
	
	Для Каждого Показатель Из Показатели["Показатели"] Цикл
		СтруктураПоказателя = Новый Соответствие;
		СтруктураПоказателя.Вставить("КодПоказателя", Показатель["Имя"]);
		СтруктураПоказателя.Вставить("Приоритет", Показатель["Приоритет"]);
		СтруктураПоказателя.Вставить("Рейтинг", 0);
		Для Каждого Парам Из Показатель["Параметры"] Цикл
			КодСчета = get_prop(Парам, "Счет");
			СтруктураПоказателя.Вставить("Параметры", Парам);
		КонецЦикла;
		Детализация = Новый Соответствие;
		Для Каждого Детал Из Показатель["ДетализацияЭкспорт"] Цикл
			ДеталИмя = Новый Соответствие;
			ДеталИмя.Вставить("СпособПолучения", Детал["СпособПолучения"]);
			ДеталИмя.Вставить("ЗначениеПоУмолчанию", Детал["ЗначениеПоУмолчанию"]);
			Детализация.Вставить(Детал["Имя"], ДеталИмя);
		КонецЦикла;
		СтруктураПоказателя.Вставить("Детализация", Детализация);
		
		СписокПоказателейПоКодуСчета = get_prop(ИндексированныеПоказатели, КодСчета);
		Если СписокПоказателейПоКодуСчета = Неопределено Тогда
			СписокПоказателейПоКодуСчета = Новый Массив;
		КонецЕсли;
		СписокПоказателейПоКодуСчета.Добавить(СтруктураПоказателя);
		
		ИндексированныеПоказатели.Вставить(КодСчета, СписокПоказателейПоКодуСчета);
	КонецЦикла;
	
	Возврат ИндексированныеПоказатели;
	
КонецФункции

// Функция index_indicators_by_name
//
// Параметры:
//  Показатели - Массив - Массив показателей в начальном виде
//
// Возвращаемое значение:
//  Массив - Результат выполнения функции = индексированные показатели по имени
//
Функция index_indicators_by_name(Показатели)
	
	ИндексированныеПоказатели = Новый Соответствие;
	
	Для Каждого Показатель Из Показатели["Показатели"] Цикл
		СтруктураПоказателя = Новый Соответствие;
		СтруктураПоказателя.Вставить("КодПоказателя", Показатель["Имя"]);
		СтруктураПоказателя.Вставить("Приоритет", Показатель["Приоритет"]);
		СтруктураПоказателя.Вставить("Рейтинг", 0);
		КодСчета = "";
		СтруктураПоказателя.Вставить("КодСчета", КодСчета);
		Для Каждого Парам Из Показатель["Параметры"] Цикл
			СтруктураПоказателя.Вставить("КодСчета", get_prop(Парам, "Счет"));
			СтруктураПоказателя.Вставить("Параметры", Парам);
		КонецЦикла;
		Детализация = Новый Соответствие;
		Для Каждого Детал Из Показатель["ДетализацияИмпорт"] Цикл
			ДеталИмя = Новый Соответствие;
			ДеталИмя.Вставить("СпособПолучения", Детал["СпособПолучения"]);
			ДеталИмя.Вставить("ЗначениеПоУмолчанию", Детал["ЗначениеПоУмолчанию"]);
			Детализация.Вставить(Детал["Имя"], ДеталИмя);
		КонецЦикла;
		СтруктураПоказателя.Вставить("Детализация", Детализация);
		
		ИндексированныеПоказатели.Вставить(Показатель["Имя"], СтруктураПоказателя);
	КонецЦикла;
	
	Возврат ИндексированныеПоказатели;
	
КонецФункции

