
//DynamicDirective
// BSLLS:CognitiveComplexity-off
Функция block_taxmon2_indicator_turnover_accounts_calc_value(block_type, node, path, context, block_context)
	Если НЕ ЗначениеЗаполнено(КэшОперации) Тогда
		ИнициализацияКэшаОперации();
	КонецЕсли;
	ЭлементКэша = get_prop(КэшОперации.Значение, "indicator_list_src");
	Если Не ЗначениеЗаполнено(ЭлементКэша) Тогда
		indicator_list_src = get_prop(context_variables_get(context), "indicator_list_src");
		ПоказателиИС = index_indicators_by_name(indicator_list_src);
		ЗаписатьВКэшОперации(КэшОперации, ЭлементКэша, "indicator_list_src", ПоказателиИС);
	Иначе
		ПоказателиИС = ЭлементКэша.Значение;
		ЭлементКэша.Частота = ЭлементКэша.Частота + 1;
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ХозрасчетныйОборотыДтКт.Период КАК Период,
	|	ХозрасчетныйОборотыДтКт.СчетДт КАК СчетДт,
	|	ХозрасчетныйОборотыДтКт.СчетКт КАК СчетКт,
	|	ХозрасчетныйОборотыДтКт.СубконтоДт1 КАК СубконтоДт1,
	|	ХозрасчетныйОборотыДтКт.СубконтоДт2 КАК СубконтоДт2,
	|	ХозрасчетныйОборотыДтКт.СубконтоДт3 КАК СубконтоДт3,
	|	ХозрасчетныйОборотыДтКт.СубконтоКт1 КАК СубконтоКт1,
	|	ХозрасчетныйОборотыДтКт.СубконтоКт2 КАК СубконтоКт2,
	|	ХозрасчетныйОборотыДтКт.СубконтоКт3 КАК СубконтоКт3,
	|	ХозрасчетныйОборотыДтКт.Организация КАК Организация,
	|	ХозрасчетныйОборотыДтКт.СуммаОборот КАК Сумма,
	|	ХозрасчетныйОборотыДтКт.Регистратор КАК Регистратор,
	|	ХозрасчетныйОборотыДтКт.Регистратор.Представление КАК РегистраторПредставление
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&ДатаНач, &ДатаКнц, Регистратор, СчетДт В ИЕРАРХИИ (&СчетДт), , СчетКт В ИЕРАРХИИ (&СчетКт), , Организация = &НашаОрганизация) КАК ХозрасчетныйОборотыДтКт
	|ГДЕ
	|	ХозрасчетныйОборотыДтКт.СуммаОборот <> 0";
	
	ПараметрыЗапроса = Новый Структура;
	
	api3_taxmon_report = get_prop(block_context, "_api3_taxmon_report");
	declaration_indicator_id = get_prop(block_context, "_declaration_indicator_id");
	НазваниеДт = get_prop(block_context, "NAME1");
	НазваниеКт = get_prop(block_context, "NAME2");
	
	Показатель_Дт = get_prop(ПоказателиИС, НазваниеДт, Новый Соответствие);
	Показатель_Кт = get_prop(ПоказателиИС, НазваниеКт, Новый Соответствие);
	
	ИдентифПараметры_Дт = get_prop(Показатель_Дт, "Параметры", Новый Соответствие);
	СчетДт = get_prop(ИдентифПараметры_Дт, "Счет");
	Для каждого ИдентифПарам Из ИдентифПараметры_Дт Цикл
		Если Лев(ИдентифПарам.Ключ, 9) = "Аналитика" И ТипЗнч(ИдентифПарам.Значение) = Тип("Массив") Тогда
			НомерАналитики = Прав(ИдентифПарам.Ключ, 1);
			
			ЗначениеАналитики = "УсловиеЗапроса" + ИдентифПарам.Значение[0];
			
			КонтекстФункции = Новый Структура("NAME, ENDPOINT", "Blockly_НДПоНалогуНаПрибыль_read", ЗначениеАналитики);
			РезультатРасчетаАналитики = block_execute_workspace_calc_value(block_type, node, path, context, КонтекстФункции);
			
			УсловиеЗапросаПоАналитике = get_prop(РезультатРасчетаАналитики, "УсловиеЗапроса");
			УсловиеЗапросаПоАналитике = СтрЗаменить(УсловиеЗапросаПоАналитике, "Субконто", "СубконтоДт" + НомерАналитики);
			ПараметрыЗапросаПоАналитике = get_prop(РезультатРасчетаАналитики, "ПараметрыЗапроса");
			Если Найти(ТекстЗапроса, " ГДЕ ДвиженияССубконто.") > 0 Тогда
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, " ГДЕ ДвиженияССубконто.", " ГДЕ ДвиженияССубконто."  + УсловиеЗапросаПоАналитике + " И ДвиженияССубконто.");
			Иначе
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ") КАК ДвиженияССубконто", ") КАК ДвиженияССубконто" + " ГДЕ ДвиженияССубконто." + УсловиеЗапросаПоАналитике);
			КонецЕсли;	
			Для каждого _param Из ПараметрыЗапросаПоАналитике Цикл
				ЗначениеПараметра = ПривестиAPI3ОбъектКСсылке(_param.Значение);
				ПараметрыЗапроса.Вставить(_param.Ключ, ЗначениеПараметра);
			КонецЦикла;
		КонецЕсли;	
	КонецЦикла;
	
	ИдентифПараметры_Кт = get_prop(Показатель_Кт, "Параметры", Новый Соответствие);
	СчетКт = get_prop(ИдентифПараметры_Кт, "Счет");
	Для каждого ИдентифПарам Из ИдентифПараметры_Кт Цикл
		Если Лев(ИдентифПарам.Ключ, 9) = "Аналитика" И ТипЗнч(ИдентифПарам.Значение) = Тип("Массив") Тогда
			НомерАналитики = Прав(ИдентифПарам.Ключ, 1);
			
			ЗначениеАналитики = "УсловиеЗапроса" + ИдентифПарам.Значение[0];
			
			КонтекстФункции = Новый Структура("NAME, ENDPOINT", "Blockly_НДПоНалогуНаПрибыль_read", ЗначениеАналитики);
			РезультатРасчетаАналитики = block_execute_workspace_calc_value(block_type, node, path, context, КонтекстФункции);
			
			УсловиеЗапросаПоАналитике = get_prop(РезультатРасчетаАналитики, "УсловиеЗапроса");
			УсловиеЗапросаПоАналитике = СтрЗаменить(УсловиеЗапросаПоАналитике, "Субконто", "СубконтоКт" + НомерАналитики);
			ПараметрыЗапросаПоАналитике = get_prop(РезультатРасчетаАналитики, "ПараметрыЗапроса");
			Если Найти(ТекстЗапроса, " ГДЕ ДвиженияССубконто.") > 0 Тогда
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, " ГДЕ ДвиженияССубконто.", " ГДЕ ДвиженияССубконто."  + УсловиеЗапросаПоАналитике + " И ДвиженияССубконто.");
			Иначе
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ") КАК ДвиженияССубконто", ") КАК ДвиженияССубконто" + " ГДЕ ДвиженияССубконто." + УсловиеЗапросаПоАналитике);
			КонецЕсли;	
			Для каждого _param Из ПараметрыЗапросаПоАналитике Цикл
				ЗначениеПараметра = ПривестиAPI3ОбъектКСсылке(_param.Значение);
				ПараметрыЗапроса.Вставить(_param.Ключ, ЗначениеПараметра);
			КонецЦикла;
		КонецЕсли;	
	КонецЦикла;
	
	РезультатЗапроса = ПолучитьОборотыМеждуСчетами(api3_taxmon_report, ТекстЗапроса, ПараметрыЗапроса, СчетДт, СчетКт);
	
	ДобавитьВОбмен = Новый Массив();
	ИтогСумма = 0;
	ИдРасшифровки = 1;
	Для каждого Строка Из РезультатЗапроса Цикл
		Сумма = get_prop(Строка, "Сумма", 0);
		Если Не Сумма = 0 Тогда
			ИдИС = get_prop(api3_taxmon_report, "ИдИС")+"|"+declaration_indicator_id+"|Ом "+НазваниеДт+" и "+НазваниеКт+"|"+ИдРасшифровки;
			ИдСБИС = get_prop(api3_taxmon_report, "ИдИС")+"|"+declaration_indicator_id+"|Ом "+НазваниеДт+" и "+НазваниеКт;
			
			СтрокаВОбмен = Новый Структура;
			СтрокаВОбмен.Вставить("ИдИС", ИдИС);
			СтрокаВОбмен.Вставить("ИмяИС", "Справочники.РасшифровкаПоказателяСтрокиОтчета");
			СтрокаВОбмен.Вставить("ИдСБИС", ИдСБИС);
			СтрокаВОбмен.Вставить("ТипСБИС", "ЭлементыТабличныхЧастей");
			СтрокаВОбмен.Вставить("ИмяСБИС", "РасшифровкаПоказателяСтрокиОтчета");
			СтрокаВОбмен.Вставить("Название", Строка.РегистраторПредставление);
			СтрокаВОбмен.Вставить("Дата", Формат(Строка.Период, "ДФ=yyyy-MM-dd"));
			СтрокаВОбмен.Вставить("Сумма", Сумма);
			ini_name = ИмяМетаданныхПоСсылкеНаОбъект(Строка.Регистратор)+"_read";
			Попытка
				Load_ini(ini_name);
			Исключение
				ini_name = "БухгалтерскаяСправка_read";
			КонецПопытки;
			
			Документ = Api3Object(Строка.Регистратор, "");
			Документ.Вставить("Ини", ini_name); 
			СтрокаВОбмен.Вставить("Документ", Документ);
			
			ДобавитьВОбмен.Добавить(СтрокаВОбмен);
			
			ИдРасшифровки = ИдРасшифровки  + 1;
			ИтогСумма = ИтогСумма + Сумма;
		КонецЕсли;
	КонецЦикла;
	// BSLLS:UnusedLocalVariable-off
	result = block_extsyncdoc_write("import_api3_obj", ДобавитьВОбмен, context, Ложь);
    // BSLLS:UnusedLocalVariable-on
	Формула = Новый Массив;
	Формула.Добавить(Новый Структура("Ид, Операция", "Ом "+НазваниеДт+" и "+НазваниеКт, "+"));
	Возврат Новый Структура("Сумма, Формула", ИтогСумма, Формула);
	
КонецФункции	
// BSLLS:CognitiveComplexity-on

Функция ПолучитьОборотыМеждуСчетами(api3_taxmon_report, ТекстЗапроса, ПараметрыЗапроса, СчетДт, СчетКт)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач", ПреобразоватьСтрокуВДату("yyyy-MM-dd", get_prop(api3_taxmon_report, "ДатаНач")));
	ДатаКнц = ПреобразоватьСтрокуВДату("yyyy-MM-dd HH:mm:ss", get_prop(api3_taxmon_report, "ДатаКнц") + " 23:59:59");
	Запрос.УстановитьПараметр("ДатаКнц", ДатаКнц);
	Запрос.УстановитьПараметр("НашаОрганизация", ПривестиAPI3ОбъектКСсылке(get_prop(api3_taxmon_report, "НашаОрганизация")));
	Запрос.УстановитьПараметр("СчетДт", ПланыСчетов["Хозрасчетный"].НайтиПоРеквизиту("КодБыстрогоВыбора", СчетДт));
	Запрос.УстановитьПараметр("СчетКт", ПланыСчетов["Хозрасчетный"].НайтиПоРеквизиту("КодБыстрогоВыбора", СчетКт));
	Для каждого _param Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(_param.Ключ, _param.Значение);
	КонецЦикла;
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат РезультатЗапроса;
КонецФункции
	
