
//DynamicDirective

Функция block_taxmon2_get_declaration_indicator_calc_value(block_type, node, path, context, block_context)
	workspace_find_fields(node, block_context);
	variable = block_context["VAR"];
	Отчет = block_get_variable(context, variable);  
	НазваниеСтрокиОтчета = block_context["NAME"];
	
	ДанныеОтчета = get_prop(Отчет, "Данные");
	Формула = Новый Массив;
	Если Не ДанныеОтчета = Неопределено Тогда
		Для каждого СтрокаОтчета Из ДанныеОтчета Цикл
			Если СтрокаОтчета["Ид"] = НазваниеСтрокиОтчета Тогда
				ЭлемФормулы = Новый Структура("Ид, Операция", "Стр. '" + СтрокаОтчета["Ид"] + "'", "+");
				Формула.Добавить(ЭлемФормулы);
				Возврат Новый Структура("Сумма, Формула", СтрокаОтчета["Сумма"], Формула);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Текст = "В блоке 'Получить оборот по строке (taxmon2_get_declaration_indicator)' указана несуществующая строка отчета '" + НазваниеСтрокиОтчета + "'!";
	ВызватьИсключение Текст;	
КонецФункции

