Функция ПолучитьОборотыМеждуСчетами(api3_taxmon_report, ТекстЗапроса, ПараметрыЗапроса, СчетДт, СчетКт, Группа1 = "")
	Запрос = Новый Запрос;
	УстановитьПараметрыЗапросаПоНМ(Запрос, api3_taxmon_report, ПараметрыЗапроса);
	Запрос.УстановитьПараметр("СчетДт", ПланыСчетов["Хозрасчетный"].НайтиПоРеквизиту("КодБыстрогоВыбора", СчетДт));
	Запрос.УстановитьПараметр("СчетКт", ПланыСчетов["Хозрасчетный"].НайтиПоРеквизиту("КодБыстрогоВыбора", СчетКт));
	Если Группа1 = "" Тогда
		Запрос.Параметры.Удалить("Группа1");
	Иначе
		Запрос.УстановитьПараметр("Группа1", Группа1);
	КонецЕсли;	
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат ТаблицаЗначенийВМассив(РезультатЗапроса);
КонецФункции

// Рассчитывает показатель: возвращает параметры для построения запроса.
//
//Параметры:
//Показатель - Массив - Показатель для расчета
//ПоказателиИС - Массив - Массив всех показателей
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
//ГлубинаРекурсии - Число - Для проверки на уровни рекурсии 
//ПосещенныеПоказатели - Массив - Для проверки на зацикливание 
//Группа1 - Строка - Группировка показателей
// Возвращаемое значение:
// АгрегированныеРезультаты:
//   Структура:
//   - Счета - Массив строк 
//   - Параметры - Соответствие (параметры для запроса)
//   - УсловияЗапроса - Массив структур {Номер, Условие, Сторона}
//
//DynamicDirective
// BSLLS:CognitiveComplexity-off
// BSLLS:CyclomaticComplexity-off
// BSLLS:NestedStatements-off
Функция РазрешитьПоказательДляЗапроса(Показатель, ПоказателиИС,  
	block_type, node, path, context,
	ГлубинаРекурсии = 0, ПосещенныеПоказатели = Неопределено, Группа1 = "")
	
	//Защита от рекурсии
	Если ГлубинаРекурсии > 10 Тогда
		ВызватьИсключение "Превышена глубина рекурсии при резолвинге показателя";
	КонецЕсли;
	
	Если ПосещенныеПоказатели = Неопределено Тогда
		// BSLLS:FunctionOutParameter-off
		ПосещенныеПоказатели = Новый Массив;
		// BSLLS:FunctionOutParameter-on
	КонецЕсли;
	АгрегированныеРезультаты = Новый Массив;
	//Если на вход пришел массив, рассчитываем каждый элемент
	Если ТипЗнч(Показатель) = Тип("Массив") Тогда
		Для каждого ЭлементПоказателя Из Показатель Цикл
			АгрегированныйРезультат = Новый Структура;
			АгрегированныйРезультат.Вставить("Счета", Новый Массив);
			АгрегированныйРезультат.Вставить("Параметры", Новый Соответствие);
			АгрегированныйРезультат.Вставить("УсловияЗапроса", Новый Массив);
			АгрегированныйРезультат.Вставить("Группа1", Группа1);
			
			РезультатЭлемента = РазрешитьПоказательДляЗапроса(ЭлементПоказателя, ПоказателиИС, 
			block_type, node, path, context, ГлубинаРекурсии, ПосещенныеПоказатели);
			
			// Объединяем счета
			Для каждого Результат Из РезультатЭлемента Цикл
				Для каждого Счет Из Результат.Счета Цикл
					Если АгрегированныйРезультат.Счета.Найти(Счет) = Неопределено Тогда
						АгрегированныйРезультат.Счета.Добавить(Счет);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			
			// Объединяем параметры (с проверкой на дубли ключей)
			Для каждого Результат Из РезультатЭлемента Цикл
				Для каждого Параметр Из Результат.Параметры Цикл
					Если get_prop(АгрегированныйРезультат.Параметры, Параметр.Ключ) = Неопределено Тогда
						АгрегированныйРезультат.Параметры.Вставить(Параметр.Ключ, Параметр.Значение);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			
			// Объединяем условия
			Для каждого Результат Из РезультатЭлемента Цикл
				Для каждого УсловиеСтруктура Из Результат.УсловияЗапроса Цикл
					АгрегированныйРезультат.УсловияЗапроса.Добавить(УсловиеСтруктура);
				КонецЦикла;
			КонецЦикла;
			
			АгрегированныеРезультаты.Добавить(АгрегированныйРезультат);
			
		КонецЦикла;
		Возврат АгрегированныеРезультаты;
	КонецЕсли;
	
	//Работа с одиночным показателем
	СпособХранения = get_prop(Показатель, "СпособХранения", "План счетов");
	ИдентифПараметры = get_prop(Показатель, "Параметры", Новый Соответствие);
	
	//СпособХранения "План счетов"
	Если СпособХранения = "План счетов" Тогда
		
		Результат = Новый Структура;
		Результат.Вставить("Счета", Новый Массив);
		Результат.Счета.Добавить(get_prop(ИдентифПараметры, "Счет", ""));
		Результат.Вставить("Параметры", Новый Соответствие);
		Результат.Вставить("УсловияЗапроса", Новый Массив);
		Результат.Вставить("Группа1", Группа1);
		
		// Обработка аналитик
		Для каждого ИдентифПарам Из ИдентифПараметры Цикл
			Если Лев(ИдентифПарам.Ключ, 9) = "Аналитика" И ТипЗнч(ИдентифПарам.Значение) = Тип("Массив") Тогда
				НомерАналитики = Прав(ИдентифПарам.Ключ, 1);
				ЗначениеАналитики = "УсловиеЗапроса" + ИдентифПарам.Значение[0];
				
				КонтекстФункции = Новый Структура("NAME, ENDPOINT", "Blockly_НДПоНалогуНаПрибыль_read", ЗначениеАналитики);
				РезультатРасчетаАналитики = block_execute_workspace_calc_value(block_type, node, path, context, КонтекстФункции);
				
				Условие = get_prop(РезультатРасчетаАналитики, "УсловиеЗапроса");
				ПараметрыАналитики = get_prop(РезультатРасчетаАналитики, "ПараметрыЗапроса");
				
				Результат.УсловияЗапроса.Добавить(Новый Структура("Номер, Условие", НомерАналитики, Условие));
				
				Для каждого _param Из ПараметрыАналитики Цикл
					Если get_prop(Результат.Параметры, _param.Ключ) = Неопределено Тогда
						Результат.Параметры.Вставить(_param.Ключ, ПривестиAPI3ОбъектКСсылке(_param.Значение));
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		АгрегированныеРезультаты.Добавить(Результат);
		Возврат АгрегированныеРезультаты;
		//СпособХранения "Показатель" (рекурсия)
	ИначеЕсли СпособХранения = "Показатель" Тогда
		
		СсылкаНаПоказатель = get_prop(ИдентифПараметры, "Счет");
		Если Не ЗначениеЗаполнено(СсылкаНаПоказатель) Тогда
			ВызватьИсключение "Показатель с СпособХранения='Показатель' должен содержать ссылку в поле 'Счет'";
		КонецЕсли;
		
		// Проверка цикла
		Если Не ПосещенныеПоказатели.Найти(СсылкаНаПоказатель) = Неопределено Тогда
			ВызватьИсключение "Цикл в показателях: " + СтрСоединить82(ПосещенныеПоказатели, " - ") + " - " + СсылкаНаПоказатель;
		КонецЕсли;
		ПосещенныеПоказатели.Добавить(СсылкаНаПоказатель);
		// BSLLS:FunctionOutParameter-off
		Группа1 = СсылкаНаПоказатель;
		// BSLLS:FunctionOutParameter-on
		//Получаем массив показателей из индекса    
		МассивСсылочныхПоказателей = get_prop(ПоказателиИС, СсылкаНаПоказатель);
		Если МассивСсылочныхПоказателей = Неопределено Тогда
			ВызватьИсключение "Не найден показатель: " + СсылкаНаПоказатель;
		КонецЕсли;
		
		//Рекурсивный вызов (передаем массив, функция сама обработает)
		Возврат РазрешитьПоказательДляЗапроса(МассивСсылочныхПоказателей, ПоказателиИС, 
		block_type, node, path, context, ГлубинаРекурсии + 1, ПосещенныеПоказатели, Группа1);
		
	Иначе
		ВызватьИсключение "Неподдерживаемый СпособХранения: " + СпособХранения;
	КонецЕсли;
	
КонецФункции
// BSLLS:NestedStatements-on
// BSLLS:CyclomaticComplexity-on
// BSLLS:CognitiveComplexity-on

//ВыполнитьЗапросДляПарыПоказателей
//Параметры:
//ПоказательДт - Массив - Показатель, характеризующий дебетовую сторону
//ПоказательКт - Массив - Показатель, характеризующий кредитовую сторону
//ПоказателиИС - Массив - Массив всех показателей
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
//api3_taxmon_report - Соответствие - Данные отчета
//Возвращаемое значение:
//ВсеРезультатыЗапроса - Массив - Массив, содержащий результаты запросов для пары показателей
//DynamicDirective
// BSLLS:CognitiveComplexity-off
Функция ВыполнитьЗапросДляПарыПоказателей(ПоказательДт, ПоказательКт, 
	ПоказателиИС, block_type, node, path, context, api3_taxmon_report)
	ВсеРезультатыЗапроса = Новый Массив;
	//Рассчитываем показатели (с поддержкой рекурсии)
	РазрешенныйДт = РазрешитьПоказательДляЗапроса(ПоказательДт, ПоказателиИС, 
	block_type, node, path, context);
	РазрешенныйКт = РазрешитьПоказательДляЗапроса(ПоказательКт, ПоказателиИС, 
	block_type, node, path, context);
	
	//Базовый шаблон запроса
	БазовыйТекстЗапроса = "ВЫБРАТЬ
	|	ХозрасчетныйОборотыДтКт.Период КАК Период,
	|	ХозрасчетныйОборотыДтКт.СчетДт КАК СчетДт,
	|	ХозрасчетныйОборотыДтКт.СчетКт КАК СчетКт,
	|	ХозрасчетныйОборотыДтКт.СубконтоДт1 КАК СубконтоДт1,
	|	ХозрасчетныйОборотыДтКт.СубконтоДт2 КАК СубконтоДт2,
	|	ХозрасчетныйОборотыДтКт.СубконтоДт3 КАК СубконтоДт3,
	|	ХозрасчетныйОборотыДтКт.СубконтоКт1 КАК СубконтоКт1,
	|	ХозрасчетныйОборотыДтКт.СубконтоКт2 КАК СубконтоКт2,
	|	ХозрасчетныйОборотыДтКт.СубконтоКт3 КАК СубконтоКт3,
	|	ХозрасчетныйОборотыДтКт.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОборотыДтКт.СуммаНУОборотДт > 0
	|			ТОГДА ХозрасчетныйОборотыДтКт.СуммаНУОборотДт
	|		ИНАЧЕ ХозрасчетныйОборотыДтКт.СуммаНУОборотКт
	|	КОНЕЦ КАК Сумма,
	|	ХозрасчетныйОборотыДтКт.Регистратор КАК Регистратор,
	|	ХозрасчетныйОборотыДтКт.Регистратор.Представление КАК РегистраторПредставление,
	|	&Группа1 КАК Группа1
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&ДатаНач, &ДатаКнц, Регистратор, 
	|					СчетДт В ИЕРАРХИИ (&СчетДт), , СчетКт В ИЕРАРХИИ (&СчетКт), , Организация = &НашаОрганизация) КАК ХозрасчетныйОборотыДтКт
	|ГДЕ
	|	ХозрасчетныйОборотыДтКт.СуммаОборот <> 0";
	
	ПараметрыЗапроса = Новый Структура;
	
	
	Для каждого ПоказательДт Из РазрешенныйДт Цикл
		Для каждого ПоказательКт Из РазрешенныйКт Цикл
			СчетДт = ПоказательДт.Счета[0];
			СчетКт = ПоказательКт.Счета[0];
			// Вставка параметров в структуру запроса
			Для каждого Параметр Из ПоказательДт.Параметры Цикл
				ПараметрыЗапроса.Вставить(Параметр.Ключ, Параметр.Значение);
			КонецЦикла;
			Для каждого Параметр Из ПоказательКт.Параметры Цикл
				ПараметрыЗапроса.Вставить(Параметр.Ключ, Параметр.Значение);
			КонецЦикла;
			
			ТекстЗапроса = БазовыйТекстЗапроса;
			//Вставка условий по субконто
			// Дт
			Для каждого УсловиеСтруктура Из ПоказательДт.УсловияЗапроса Цикл
				Номер = УсловиеСтруктура.Номер;
				Условие = УсловиеСтруктура.Условие;
				Условие = СтрЗаменить(Условие, "Субконто", "СубконтоДт" + Номер);
				ТекстЗапроса = ВставитьУсловиеВЗапрос(ТекстЗапроса, Условие);
			КонецЦикла;
			
			// Кт
			Для каждого УсловиеСтруктура Из ПоказательКт.УсловияЗапроса Цикл
				Номер = УсловиеСтруктура.Номер;
				Условие = УсловиеСтруктура.Условие;
				Условие = СтрЗаменить(Условие, "Субконто", "СубконтоКт" + Номер);
				ТекстЗапроса = ВставитьУсловиеВЗапрос(ТекстЗапроса, Условие);
			КонецЦикла;
			
			Если Не get_prop(ПоказательДт, "Группа1", "") = "" Тогда
				Группа1 = get_prop(ПоказательДт, "Группа1");
			ИначеЕсли Не get_prop(ПоказательКт, "Группа1", "") = "" Тогда
				Группа1 = get_prop(ПоказательКт, "Группа1");
			Иначе
				Группа1 = "";
			КонецЕсли;
			// Выполняем запрос для текущей пары счетов
			ОборотыМеждуСчетами = ПолучитьОборотыМеждуСчетами(api3_taxmon_report, ТекстЗапроса, ПараметрыЗапроса, СчетДт, СчетКт, Группа1);;
				
			Для каждого Строка Из ОборотыМеждуСчетами Цикл
				ВсеРезультатыЗапроса.Добавить(Строка);
			КонецЦикла;
			
		КонецЦикла;
	КонецЦикла; 
	
	
	Возврат ВсеРезультатыЗапроса;
	
КонецФункции
// BSLLS:CognitiveComplexity-on

// Вставляет новое условие в текст запроса после псевдонима "ХозрасчетныйОборотыДтКт"
//Параметры:
//ТекстЗапроса - Строка - Текст запроса
//НовоеУсловие - Строка - Условие для вставки
//Возвращаемое значение:
//ТекстЗапроса - Строка - Обновленный текст запроса
//DynamicDirective
Функция ВставитьУсловиеВЗапрос(ТекстЗапроса, НовоеУсловие)
	// BSLLS:FunctionOutParameter-off
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
	"ГДЕ ХозрасчетныйОборотыДтКт.СуммаОборот <> 0", 
	"ГДЕ ХозрасчетныйОборотыДтКт.СуммаОборот <> 0 И ХозрасчетныйОборотыДтКт." + НовоеУсловие);
	// BSLLS:FunctionOutParameter-on
	Возврат ТекстЗапроса;
КонецФункции

//Функция block_taxmon2_indicator_turnover_accounts_calc_value
//Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//Возвращаемое значение:
//Структура
//DynamicDirective
// BSLLS:NestedStatements-off
Функция block_taxmon2_indicator_turnover_accounts_calc_value(block_type, node, path, context, block_context)
	
	//Инициализация кэша и получение показателей
	Если НЕ ЗначениеЗаполнено(КэшОперации) Тогда
		ИнициализацияКэшаОперации();
	КонецЕсли;
	
	ЭлементКэша = get_prop(КэшОперации.Значение, "indicator_list_src");
	Если Не ЗначениеЗаполнено(ЭлементКэша) Тогда
		indicator_list_src = get_prop(context_variables_get(context), "indicator_list_src");
		ПоказателиИС = index_indicators_by_name(indicator_list_src);
		ЗаписатьВКэшОперации(КэшОперации, ЭлементКэша, "indicator_list_src", ПоказателиИС);
	Иначе
		ПоказателиИС = ЭлементКэша.Значение;
		ЭлементКэша.Частота = ЭлементКэша.Частота + 1;
	КонецЕсли;
	
	//Чтение входных параметров
	api3_taxmon_report = get_prop(block_context, "_api3_taxmon_report");
	declaration_indicator_id = get_prop(block_context, "_declaration_indicator_id");
	НазваниеДт = get_prop(block_context, "NAME1");
	НазваниеКт = get_prop(block_context, "NAME2");
	
	Показатель_Дт = get_prop(ПоказателиИС, НазваниеДт, Новый Массив);
	Показатель_Кт = get_prop(ПоказателиИС, НазваниеКт, Новый Массив);
	
	//Сбор всех результатов по комбинациям
	ВсеРезультатыЗапроса = Новый Массив;
	
	Для каждого ПоказательДт Из Показатель_Дт Цикл
		Для каждого ПоказательКт Из Показатель_Кт Цикл
			
			// Выполняем запрос для текущей пары
			РезультатПары = ВыполнитьЗапросДляПарыПоказателей(
			ПоказательДт, ПоказательКт, ПоказателиИС,  
			block_type, node, path, context, api3_taxmon_report);
				
			Для каждого Строка Из РезультатПары Цикл
				ВсеРезультатыЗапроса.Добавить(Строка);
			КонецЦикла;
			
		КонецЦикла;
	КонецЦикла;
	
	//Формирование данных для обмена
	ДобавитьВОбмен = Новый Массив();
	ИтогСумма = 0;
	ИдРасшифровки = 1;
	
	Для каждого Строка Из ВсеРезультатыЗапроса Цикл
		Сумма = get_prop(Строка, "Сумма", 0);
		Если Не Сумма = 0 Тогда
			ИдИС = get_prop(api3_taxmon_report, "ИдИС")+"|"+declaration_indicator_id+
			"|Д "+НазваниеДт+" К "+НазваниеКт+"|"+ИдРасшифровки;
			ИдСБИС = get_prop(api3_taxmon_report, "ИдИС")+"|"+declaration_indicator_id+
			"|Д "+НазваниеДт+" К "+НазваниеКт;
			
			СтрокаВОбмен = Новый Структура;
			СтрокаВОбмен.Вставить("Группа1", get_prop(Строка, "Группа1", Неопределено));
			СтрокаВОбмен.Вставить("ИдИС", ИдИС);
			СтрокаВОбмен.Вставить("ИмяИС", "Справочники.РасшифровкаПоказателяСтрокиОтчета");
			СтрокаВОбмен.Вставить("ИдСБИС", ИдСБИС);
			СтрокаВОбмен.Вставить("ТипСБИС", "ЭлементыТабличныхЧастей");
			СтрокаВОбмен.Вставить("ИмяСБИС", "РасшифровкаПоказателяСтрокиОтчета");
			СтрокаВОбмен.Вставить("Название", Строка.РегистраторПредставление);
			СтрокаВОбмен.Вставить("Дата", Формат(Строка.Период, "ДФ=yyyy-MM-dd"));
			СтрокаВОбмен.Вставить("Сумма", Сумма);
			
			ini_name = ИмяМетаданныхПоСсылкеНаОбъект(Строка.Регистратор)+"_read";
			Попытка
				Load_ini(ini_name);
			Исключение
				ini_name = "БухгалтерскаяСправка_read";
			КонецПопытки;
			Документ = Api3Object(Строка.Регистратор, Неопределено);
			Документ.Вставить("Ини", ini_name); 
			СтрокаВОбмен.Вставить("Документ", Документ);
			
			ДобавитьВОбмен.Добавить(СтрокаВОбмен);
			
			ИдРасшифровки = ИдРасшифровки + 1;
			ИтогСумма = ИтогСумма + Сумма;
		КонецЕсли;
	КонецЦикла;
	
	//Отправка данных в обмен
	// BSLLS:UnusedLocalVariable-off
	result = block_extsyncdoc_write("import_api3_obj", ДобавитьВОбмен, context, Ложь);
	// BSLLS:UnusedLocalVariable-on
	
	//Формирование формулы для отчета
	Формула = Новый Массив;
	Формула.Добавить(Новый Структура("Ид, Операция", "Д "+НазваниеДт+" К "+НазваниеКт, "+"));
	
	Возврат Новый Структура("Сумма, Формула", ИтогСумма, Формула);
	
КонецФункции
// BSLLS:NestedStatements-on


