
//Функция block_taxmon2_indicator_turnover_account_calc_valu
//Параметры:
// block_type - Строка - Название блока
// node - XML - Текущий обрабатываемый узел XML
// path - Строка - Абсолютный путь до исполняемого блока
// context - Соответствие - Контекст исполняемого блока
// block_context - Соответствие - Контекст текущего выполняемого блока
//DynamicDirective
// BSLLS:CognitiveComplexity-off
// BSLLS:CyclomaticComplexity-off
// BSLLS:NestedStatements-off
Функция block_taxmon2_indicator_turnover_account_calc_value(block_type, node, path, context, block_context)
	Если НЕ ЗначениеЗаполнено(КэшОперации) Тогда
		ИнициализацияКэшаОперации();
	КонецЕсли;
	ЭлементКэша = get_prop(КэшОперации.Значение, "indicator_list_src");
	Если Не ЗначениеЗаполнено(ЭлементКэша) Тогда
		indicator_list_src = get_prop(context_variables_get(context), "indicator_list_src");
		ПоказателиИС = index_indicators_by_name(indicator_list_src);
		ЗаписатьВКэшОперации(КэшОперации, ЭлементКэша, "indicator_list_src", ПоказателиИС);
	Иначе
		ПоказателиИС = ЭлементКэша.Значение;
		ЭлементКэша.Частота = ЭлементКэша.Частота + 1;
	КонецЕсли;
	
	ИмяПоляСуммы = ПолучитьСуммуХозрасчетныйОстаткиИОбороты();	
	
	// BSLLS:QueryParseError-off
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СписокОрганизаций
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка = &НашаОрганизация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ОстаткиНаНачало.СуммаОстатокДт) КАК НУОбщийНачальныйОстатокДт,
	|	СУММА(ОстаткиНаНачало.СуммаОстатокКт) КАК НУОбщийНачальныйОстатокКт
	|ПОМЕСТИТЬ ОстаткиНаНачало
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&ДатаНач,
	|			Счет В ИЕРАРХИИ (&Счет),
	|			,
	|			Организация В
	|				(ВЫБРАТЬ
	|					СписокОрганизаций.Ссылка КАК Ссылка
	|				ИЗ
	|					СписокОрганизаций КАК СписокОрганизаций)) КАК ОстаткиНаНачало
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ОстаткиНаКонец.СуммаОстатокДт) КАК НУОбщийКонечныйОстатокДт,
	|	СУММА(ОстаткиНаКонец.СуммаОстатокКт) КАК НУОбщийКонечныйОстатокКт
	|ПОМЕСТИТЬ ОстаткиНаКонец
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&Граница,
	|			Счет В ИЕРАРХИИ (&Счет),
	|			,
	|			Организация В
	|				(ВЫБРАТЬ
	|					СписокОрганизаций.Ссылка КАК Ссылка
	|				ИЗ
	|					СписокОрганизаций КАК СписокОрганизаций)) КАК ОстаткиНаКонец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ОстаткиНаНачало.НУОбщийНачальныйОстатокДт, 0) КАК НУОбщийНачальныйОстатокДт,
	|	ЕСТЬNULL(ОстаткиНаНачало.НУОбщийНачальныйОстатокКт, 0) КАК НУОбщийНачальныйОстатокКт,
	|	ЕСТЬNULL(ОстаткиНаКонец.НУОбщийКонечныйОстатокДт, 0) КАК НУОбщийКонечныйОстатокДт,
	|	ЕСТЬNULL(ОстаткиНаКонец.НУОбщийКонечныйОстатокКт, 0) КАК НУОбщийКонечныйОстатокКт
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	ОстаткиНаНачало КАК ОстаткиНаНачало,
	|	ОстаткиНаКонец КАК ОстаткиНаКонец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Остатки.НУОбщийНачальныйОстатокКт <> 0
	|				И (Остатки.НУОбщийНачальныйОстатокДт = 0
	|					ИЛИ Остатки.НУОбщийНачальныйОстатокКт - Остатки.НУОбщийНачальныйОстатокДт > 0)
	|			ТОГДА Остатки.НУОбщийНачальныйОстатокКт - Остатки.НУОбщийНачальныйОстатокДт
	|		ИНАЧЕ Остатки.НУОбщийНачальныйОстатокДт - Остатки.НУОбщийНачальныйОстатокКт
	|	КОНЕЦ КАК НУОбщийНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА Остатки.НУОбщийКонечныйОстатокКт <> 0
	|				И (Остатки.НУОбщийКонечныйОстатокДт = 0
	|					ИЛИ Остатки.НУОбщийКонечныйОстатокКт - Остатки.НУОбщийКонечныйОстатокДт > 0)
	|			ТОГДА Остатки.НУОбщийКонечныйОстатокКт - Остатки.НУОбщийКонечныйОстатокДт
	|		ИНАЧЕ Остатки.НУОбщийКонечныйОстатокДт - Остатки.НУОбщийКонечныйОстатокКт
	|	КОНЕЦ КАК НУОбщийКонечныйОстаток,
	|	ВЫБОР
	|		КОГДА Остатки.НУОбщийНачальныйОстатокКт <> 0
	|				И (Остатки.НУОбщийНачальныйОстатокДт = 0
	|					ИЛИ Остатки.НУОбщийНачальныйОстатокКт - Остатки.НУОбщийНачальныйОстатокДт > 0)
	|			ТОГДА 0
	|		КОГДА Остатки.НУОбщийНачальныйОстатокДт - Остатки.НУОбщийНачальныйОстатокКт <> 0
	|			ТОГДА 1
	|	КОНЕЦ КАК НУОбщийНачальныйОстатокФлаг,
	|	ВЫБОР
	|		КОГДА Остатки.НУОбщийКонечныйОстатокКт <> 0
	|				И (Остатки.НУОбщийКонечныйОстатокДт = 0
	|					ИЛИ Остатки.НУОбщийКонечныйОстатокКт - Остатки.НУОбщийКонечныйОстатокДт > 0)
	|			ТОГДА 0
	|		КОГДА Остатки.НУОбщийКонечныйОстатокДт - Остатки.НУОбщийКонечныйОстатокКт <> 0
	|			ТОГДА 1
	|	КОНЕЦ КАК НУОбщийКонечныйОстатокФлаг
	|ПОМЕСТИТЬ ТаблицаИтоги
	|ИЗ
	|	Остатки КАК Остатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ХозрасчетныйОстаткиИОбороты.Период КАК Период,
	|	ХозрасчетныйОстаткиИОбороты.Регистратор КАК Регистратор,
	|	ХозрасчетныйОстаткиИОбороты.НомерСтроки КАК НомерСтроки,
	|	ХозрасчетныйОстаткиИОбороты." + ИмяПоляСуммы + "НачальныйОстатокДт КАК НУНачальныйОстатокДт,
	|	ХозрасчетныйОстаткиИОбороты." + ИмяПоляСуммы + "НачальныйОстатокКт КАК НУНачальныйОстатокКт,
	|	ХозрасчетныйОстаткиИОбороты." + ИмяПоляСуммы + "ОборотДт КАК НУОборотДт,
	|	ХозрасчетныйОстаткиИОбороты." + ИмяПоляСуммы + "ОборотКт КАК НУОборотКт,
	|	ХозрасчетныйОстаткиИОбороты." + ИмяПоляСуммы + "КонечныйОстатокДт КАК НУКонечныйОстатокДт,
	|	ХозрасчетныйОстаткиИОбороты." + ИмяПоляСуммы + "КонечныйОстатокКт КАК НУКонечныйОстатокКт
	|ПОМЕСТИТЬ ХозрасчетныйОстаткиИОбороты
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	|			&ДатаНач,
	|			&ДатаКнц,
	|			Запись,
	|			,
	|			Счет В ИЕРАРХИИ (&Счет),
	|			,
	|			Организация В
	|				(ВЫБРАТЬ
	|					СписокОрганизаций.Ссылка КАК Ссылка
	|				ИЗ
	|					СписокОрганизаций КАК СписокОрганизаций)) КАК ХозрасчетныйОстаткиИОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Регистратор,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДвиженияССубконто.Период КАК Период,
	|	ДвиженияССубконто.Регистратор КАК Регистратор,
	|	ДвиженияССубконто.НомерСтроки КАК НомерСтроки,
	|	ДвиженияССубконто.СчетДт КАК СчетДт,
	|	ДвиженияССубконто.СубконтоДт1 КАК СубконтоДт1,
	|	ДвиженияССубконто.СубконтоДт2 КАК СубконтоДт2,
	|	ДвиженияССубконто.СубконтоДт3 КАК СубконтоДт3,
	|	ДвиженияССубконто.СчетКт КАК СчетКт,
	|	ДвиженияССубконто.СубконтоКт1 КАК СубконтоКт1,
	|	ДвиженияССубконто.СубконтоКт2 КАК СубконтоКт2,
	|	ДвиженияССубконто.СубконтоКт3 КАК СубконтоКт3,
	|	ДвиженияССубконто.Содержание КАК Содержание
	|ПОМЕСТИТЬ ДвиженияССубконто
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(
	|			&ДатаНач,
	|			&ДатаКнц,
	|			Счет В ИЕРАРХИИ (&Счет)
	|				И Активность = ИСТИНА
	|				И Организация В
	|					(ВЫБРАТЬ
	|						СписокОрганизаций.Ссылка КАК Ссылка
	|					ИЗ
	|						СписокОрганизаций КАК СписокОрганизаций),
	|			,
	|			) КАК ДвиженияССубконто
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Регистратор,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДвиженияССубконто.Период КАК Период,
	|	ДвиженияССубконто.Регистратор КАК Регистратор,
	|	ДвиженияССубконто.НомерСтроки КАК НомерСтроки,
	|	ДвиженияССубконто.СчетДт КАК СчетДт,
	|	ДвиженияССубконто.СубконтоДт1 КАК СубконтоДт1,
	|	ДвиженияССубконто.СубконтоДт2 КАК СубконтоДт2,
	|	ДвиженияССубконто.СубконтоДт3 КАК СубконтоДт3,
	|	ДвиженияССубконто.СчетКт КАК СчетКт,
	|	ДвиженияССубконто.СубконтоКт1 КАК СубконтоКт1,
	|	ДвиженияССубконто.СубконтоКт2 КАК СубконтоКт2,
	|	ДвиженияССубконто.СубконтоКт3 КАК СубконтоКт3,
	|	ДвиженияССубконто.Содержание КАК Содержание,
	|	ИСТИНА КАК ОбщиеИтоги,
	|	ХозрасчетныйОстаткиИОбороты.НУНачальныйОстатокДт КАК НУНачальныйОстатокДт,
	|	ХозрасчетныйОстаткиИОбороты.НУНачальныйОстатокКт КАК НУНачальныйОстатокКт,
	|	ХозрасчетныйОстаткиИОбороты.НУОборотДт КАК НУОборотДт,
	|	ХозрасчетныйОстаткиИОбороты.НУОборотКт КАК НУОборотКт,
	|	ХозрасчетныйОстаткиИОбороты.НУКонечныйОстатокДт КАК НУКонечныйОстатокДт,
	|	ХозрасчетныйОстаткиИОбороты.НУКонечныйОстатокКт КАК НУКонечныйОстатокКт,
	|	ТаблицаИтоги.НУОбщийНачальныйОстаток КАК НУОбщийНачальныйОстаток,
	|	ТаблицаИтоги.НУОбщийКонечныйОстаток КАК НУОбщийКонечныйОстаток,
	|	ТаблицаИтоги.НУОбщийНачальныйОстатокФлаг КАК НУОбщийНачальныйОстатокФлаг,
	|	ТаблицаИтоги.НУОбщийКонечныйОстатокФлаг КАК НУОбщийКонечныйОстатокФлаг,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияССубконто.Регистратор) КАК РегистраторПредставление,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияССубконто.СчетДт) КАК СчетДтПредставление,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияССубконто.СчетКт) КАК СчетКтПредставление
	|ИЗ
	|	ХозрасчетныйОстаткиИОбороты КАК ХозрасчетныйОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДвиженияССубконто КАК ДвиженияССубконто
	|		ПО ХозрасчетныйОстаткиИОбороты.Период = ДвиженияССубконто.Период
	|			И ХозрасчетныйОстаткиИОбороты.Регистратор = ДвиженияССубконто.Регистратор
	|			И ХозрасчетныйОстаткиИОбороты.НомерСтроки = ДвиженияССубконто.НомерСтроки,
	|	ТаблицаИтоги КАК ТаблицаИтоги
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОбщиеИтоги";
	// BSLLS:QueryParseError-on
	
	api3_taxmon_report = get_prop(block_context, "_api3_taxmon_report");
	declaration_indicator_id = get_prop(block_context, "_declaration_indicator_id");
	Название = get_prop(block_context, "NAME");
	СторонаУчета = get_prop(block_context, "TYPE");
	СторонаУчетаФормула_Соответствие = Новый Соответствие;
	СторонаУчетаФормула_Соответствие.Вставить("D", "Д");
	СторонаУчетаФормула_Соответствие.Вставить("K", "К");
	СторонаУчетаФормула_Соответствие.Вставить("SUM", "СУМ");
	СторонаУчетаФормула = СторонаУчетаФормула_Соответствие.Получить(СторонаУчета);
	
	СторонаУчетаЗапрос = ?(СторонаУчета = "D", "Дт", "Кт");
	
	ПараметрыЗапроса = Новый Структура;
	МассивПоказателей = get_prop(ПоказателиИС, Название, Новый Соответствие);
	Сумма = 0;
	Для каждого Показатель Из МассивПоказателей Цикл
		ИдентифПараметры = get_prop(Показатель, "Параметры", Новый Соответствие);
		Счет = get_prop(ИдентифПараметры, "Счет");
		СпособХранения = get_prop(Показатель, "СпособХранения", "План счетов");
		Если СпособХранения = "РегистрНУ" Тогда
			block_context.Вставить("_Контекст", Неопределено);
			filter = context_variables_get(context);
			filter.Вставить("_api3_taxmon_report", block_context["_api3_taxmon_report"]);
			Для каждого ИдентифПарам Из ИдентифПараметры Цикл
				Если Лев(ИдентифПарам.Ключ, 9) = "Аналитика" И ТипЗнч(ИдентифПарам.Значение) = Тип("Массив") Тогда
					Endpoint = workspace_init_procedure_block("УсловиеЗапроса"+ИдентифПарам.Значение[0]);
					Попытка
						// BSLLS:UnusedLocalVariable-off
						проверка = Endpoint.node;
						// BSLLS:UnusedLocalVariable-on
					Исключение
						ИнфОбОшибке = ИнформацияОбОшибке();
						ВызватьИсключение(NewExtExceptionСтрока(ИнфОбОшибке, "Ошибка при расчете идентифицирующего параметра", "Код счета: " + Показатель.КодСчета + ", параметр " + ИдентифПарам.Ключ));
					КонецПопытки;
					args_values = procedures_callreturn_get_params(Endpoint.node);
					Если block_context._Контекст = Неопределено Тогда
						block_context._Контекст = Новый Соответствие();
						Попытка
							Для счПарам = 1 По ИдентифПарам.Значение.Количество()-1 Цикл
								block_context._Контекст.Вставить(args_values.args[счПарам-1], ИдентифПарам.Значение[счПарам]);
							КонецЦикла;
						Исключение
							ИнфОбОшибке = ИнформацияОбОшибке();
							ВызватьИсключение(NewExtExceptionСтрока(ИнфОбОшибке, "Ошибка при расчете идентифицирующего параметра", "Код счета: " + Показатель.КодСчета + ", параметр " + ИдентифПарам.Ключ));
						КонецПопытки;
						context_set_next_step();
					КонецЕсли;
					
					Если get_prop(block_context, "_child") = Неопределено Тогда
						block_context.Вставить("_child", Новый Структура("variable_scopes", Новый Массив));
						block_context["_child"]["variable_scopes"].Добавить(block_context._Контекст);
					КонецЕсли;
					save_last_context();
					// BSLLS:FunctionOutParameter-off
					context = context_init_nested(block_context, BlocklyExecutor.workspace.name);
					// BSLLS:FunctionOutParameter-off
					block_context["_child"] = context.data; 
					Результат = block_execute(Endpoint.type,Endpoint.node, path, context, context.block_context);
					delete_last_context();
					
					block_context._Контекст = Неопределено;
					block_context._child = Неопределено;
					
					filter.Вставить(args_values.args[0], get_prop(Результат, args_values.args[0]));
				КонецЕсли;
				
				
				
			КонецЦикла;
			
			
			Если get_prop(block_context, "ИдЭлементаФормулы") = Неопределено Тогда
				 ИдЭлементаФормулы = block_context["NAME"];
			Иначе
				 ИдЭлементаФормулы = get_prop(block_context, "ИдЭлементаФормулы");
			КонецЕсли;
			
			filter.Вставить("ИмяПоляПодстановки", block_context["_declaration_indicator_id"]);
			filter.Вставить("ИдЭлементаФормулы", ИдЭлементаФормулы);
			workspace_name = Счет + "_list";
			endpoint = "main";
			
			Если get_prop(block_context, "_child") = Неопределено Тогда
				block_context.Вставить("_child", Новый Структура("variable_scopes", Новый Массив));
				block_context["_child"]["variable_scopes"].Добавить(Новый Соответствие);
				block_context["_child"]["variable_scopes"][0].Вставить("Filter", filter);
			КонецЕсли;
			res = block_execute_workspace(workspace_name, endpoint, context, block_context);
			block_context._child = Неопределено;
			ЭлемФормулы = Новый Структура("Ид, Операция", ИдЭлементаФормулы, "+");
			Формула = Новый Массив;
			Формула.Добавить(ЭлемФормулы);
			result = Новый Структура("Сумма, Формула", res["Totals"]["Сумма"], Формула);
			
		ИначеЕсли СпособХранения = "Показатель" Тогда
			block_context.Вставить("ИдЭлементаФормулы", Название);
			block_context["NAME"] = get_prop(ИдентифПараметры, "Счет");
			РезультатПоПоказателю = block_taxmon2_indicator_turnover_account_calc_value(block_type, node, path, context, block_context);
			Сумма = Сумма + get_prop(РезультатПоПоказателю, "Сумма", 0);
			ЭлемФормулы = Новый Структура("Ид, Операция", Название, "+");
			Формула = Новый Массив;
			Формула.Добавить(ЭлемФормулы);
			
			result = Новый Структура("Сумма, Формула", Сумма, Формула);
		Иначе
			Для каждого ИдентифПарам Из ИдентифПараметры Цикл
				Если Лев(ИдентифПарам.Ключ, 9) = "Аналитика" И ТипЗнч(ИдентифПарам.Значение) = Тип("Массив") Тогда
					НомерАналитики = Прав(ИдентифПарам.Ключ, 1);
					
					ЗначениеАналитики = "УсловиеЗапроса" + ИдентифПарам.Значение[0];
					
					КонтекстФункции = Новый Структура("NAME, ENDPOINT", "Blockly_НДПоНалогуНаПрибыль_read", ЗначениеАналитики);
					РезультатРасчетаАналитики = block_execute_workspace_calc_value(block_type, node, path, context, КонтекстФункции);
					
					УсловиеЗапросаПоАналитике = get_prop(РезультатРасчетаАналитики, "УсловиеЗапроса");
					УсловиеЗапросаПоАналитике = СтрЗаменить(УсловиеЗапросаПоАналитике, "Субконто", "Субконто" + СторонаУчетаЗапрос + НомерАналитики);
					ПараметрыЗапросаПоАналитике = get_prop(РезультатРасчетаАналитики, "ПараметрыЗапроса");
					Если Найти(ТекстЗапроса, " ГДЕ ДвиженияССубконто.") > 0 Тогда
						ТекстЗапроса = СтрЗаменить(ТекстЗапроса, " ГДЕ ДвиженияССубконто.", " ГДЕ ДвиженияССубконто."  + УсловиеЗапросаПоАналитике + " И ДвиженияССубконто.");
					Иначе
						ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ") КАК ДвиженияССубконто", ") КАК ДвиженияССубконто" + " ГДЕ ДвиженияССубконто." + УсловиеЗапросаПоАналитике);
					КонецЕсли;	
					Для каждого _param Из ПараметрыЗапросаПоАналитике Цикл
						ЗначениеПараметра = ПривестиAPI3ОбъектКСсылке(_param.Значение);
						ПараметрыЗапроса.Вставить(_param.Ключ, ЗначениеПараметра);
					КонецЦикла;
				КонецЕсли;	
			КонецЦикла;
			
			РезультатЗапроса = ПолучитьОборотыПоСчету(api3_taxmon_report, ТекстЗапроса, ПараметрыЗапроса, Счет);
			
			ДобавитьВОбмен = Новый Массив();
			ИтогСумма = 0;
			ИдРасшифровки = 1;
			Если get_prop(block_context, "ИдЭлементаФормулы") = Неопределено Тогда
				 Название = СторонаУчетаФормула + " " + Название;
			Иначе
				 Название = get_prop(block_context, "ИдЭлементаФормулы");
			КонецЕсли;	 
			Для каждого Строка Из РезультатЗапроса Цикл
				Сумма = get_prop(Строка, "НУОборот"+СторонаУчетаЗапрос, 0);
				Если Не Сумма = 0 Тогда
					ИдИС = get_prop(api3_taxmon_report, "ИдИС")+"|"+declaration_indicator_id+"|"+Название+"|"+ИдРасшифровки;
					ИдСБИС = get_prop(api3_taxmon_report, "ИдИС")+"|"+declaration_indicator_id+"|"+Название;
					
					СтрокаВОбмен = Новый Структура;
					СтрокаВОбмен.Вставить("Группа1", get_prop(Показатель, "КодПоказателя", ""));
					СтрокаВОбмен.Вставить("ИдИС", ИдИС);
					СтрокаВОбмен.Вставить("ИмяИС", "Справочники.РасшифровкаПоказателяСтрокиОтчета");
					СтрокаВОбмен.Вставить("ИдСБИС", ИдСБИС);
					СтрокаВОбмен.Вставить("ТипСБИС", "ЭлементыТабличныхЧастей");
					СтрокаВОбмен.Вставить("ИмяСБИС", "РасшифровкаПоказателяСтрокиОтчета");
					СтрокаВОбмен.Вставить("Название", Строка.РегистраторПредставление);
					СтрокаВОбмен.Вставить("Дата", Формат(Строка.Период, "ДФ=yyyy-MM-dd"));
					СтрокаВОбмен.Вставить("Сумма", Сумма);
					ini_name = ИмяМетаданныхПоСсылкеНаОбъект(Строка.Регистратор)+"_read";
					Попытка
						Load_ini(ini_name);
					Исключение
						ini_name = "БухгалтерскаяСправка_read";
					КонецПопытки;
					
					Документ = Api3Object(Строка.Регистратор, Неопределено);
					Документ.Вставить("Ини", ini_name); 
					СтрокаВОбмен.Вставить("Документ", Документ);
					
					ДобавитьВОбмен.Добавить(СтрокаВОбмен);
					
					ИдРасшифровки = ИдРасшифровки  + 1;
					ИтогСумма = ИтогСумма + Сумма;
				КонецЕсли;
			КонецЦикла;
			// BSLLS:UnusedLocalVariable-off
			result_import = block_extsyncdoc_write("import_api3_obj", ДобавитьВОбмен, context, Ложь);
			// BSLLS:UnusedLocalVariable-on
			Формула = Новый Массив;
			Формула.Добавить(Новый Структура("Ид, Операция", Название, "+"));
			result = Новый Структура("Сумма, Формула", ИтогСумма, Формула);
		КонецЕсли;
	КонецЦикла;
	Возврат result;
	
КонецФункции
// BSLLS:NestedStatements-on
// BSLLS:CyclomaticComplexity-on
// BSLLS:CognitiveComplexity-on

// Проверяет наличие полей с суммами НУ в таблице ХозрасчетныйОборотыДтКт
//Возвращаемое значение:
//ИмяПоляСуммы - Строка - Имя поля суммы для текста запроса
Функция ПолучитьСуммуХозрасчетныйОстаткиИОбороты()
	Попытка
		// BSLLS:VirtualTableCallWithoutParameters-off
		ТестовыйЗапрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		|	ХозрасчетныйОстаткиИОбороты.СуммаНУКонечныйОстатокКт КАК НУКонечныйОстатокКт
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты КАК ХозрасчетныйОстаткиИОбороты");
		ТестовыйЗапрос.Выполнить();
		// BSLLS:VirtualTableCallWithoutParameters-on
		ИмяПоляСуммы = "СуммаНУ";	
	Исключение	
		ИмяПоляСуммы = "Сумма";	
	КонецПопытки;
	Возврат ИмяПоляСуммы;
КонецФункции

Функция ПолучитьОборотыПоСчету(api3_taxmon_report, ТекстЗапроса, ПараметрыЗапроса, Счет)
	Запрос = Новый Запрос;
	УстановитьПараметрыЗапросаПоНМ(Запрос, api3_taxmon_report, ПараметрыЗапроса);
	ДатаКнц = ПреобразоватьСтрокуВДату("dd.MM.yyyy HH:mm:ss", get_prop(api3_taxmon_report, "ДатаКнц") + " 23:59:59");
	Запрос.УстановитьПараметр("Граница", Новый Граница(ДатаКнц, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Счет", ПланыСчетов["Хозрасчетный"].НайтиПоРеквизиту("КодБыстрогоВыбора", Счет));
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат ТаблицаЗначенийВМассив(РезультатЗапроса);
КонецФункции

Процедура УстановитьПараметрыЗапросаПоНМ(Запрос, api3_taxmon_report, ПараметрыЗапроса)
	Запрос.УстановитьПараметр("ДатаНач", ПреобразоватьСтрокуВДату("dd.MM.yyyy", get_prop(api3_taxmon_report, "ДатаНач")));
	ДатаКнц = ПреобразоватьСтрокуВДату("dd.MM.yyyy HH:mm:ss", get_prop(api3_taxmon_report, "ДатаКнц") + " 23:59:59");
	Запрос.УстановитьПараметр("ДатаКнц", ДатаКнц);
	Запрос.УстановитьПараметр("НашаОрганизация", ПривестиAPI3ОбъектКСсылке(get_prop(api3_taxmon_report, "НашаОрганизация")));	
	Для каждого _param Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(_param.Ключ, _param.Значение);
	КонецЦикла;
КонецПроцедуры	

//Вызывает расчет ини на сервере
//Параметры:
//ПараметрыВызова - Структура - Параметры расчета ини
//Возвращаемое значение:
//LocalCalcIni(ПараметрыВызова) - Структура - Результат расчета ини
//DynamicDirective
Функция РассчитатьИниПоРегистру(ПараметрыВызова)
	Возврат LocalCalcIni(ПараметрыВызова);
КонецФункции	

Функция ИмяМетаданныхПоСсылкеНаОбъект(СсылкаНаОбъект)
	ТипЗначения = ТипЗнч(СсылкаНаОбъект);
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначения);
	Возврат ОбъектМетаданных.Имя;
КонецФункции

// Функция index_indicators_by_account_code
//
// Параметры:
//  Показатели - Массив - Массив показателей в начальном виде
//
// Возвращаемое значение:
//  Массив - Результат выполнения функции = индексированные показатели по коду
//
Функция index_indicators_by_account_code(Показатели)
	
	ИндексированныеПоказатели = Новый Соответствие;
	
	Для Каждого Показатель Из Показатели["Показатели"] Цикл
		СтруктураПоказателя = Новый Соответствие;
		СтруктураПоказателя.Вставить("КодПоказателя", Показатель["Имя"]);
		СтруктураПоказателя.Вставить("Приоритет", Показатель["Приоритет"]);
		СтруктураПоказателя.Вставить("Рейтинг", 0);
		СтруктураПоказателя.Вставить("СпособХранения", Показатель["СпособХранения"]);
		Для Каждого Парам Из Показатель["Параметры"] Цикл
			КодСчета = get_prop(Парам, "Счет");
			СтруктураПоказателя.Вставить("Параметры", Парам);
		КонецЦикла;
		Детализация = Новый Соответствие;
		Для Каждого Детал Из Показатель["ДетализацияЭкспорт"] Цикл
			ДеталИмя = Новый Соответствие;
			ДеталИмя.Вставить("СпособПолучения", Детал["СпособПолучения"]);
			ДеталИмя.Вставить("ЗначениеПоУмолчанию", Детал["ЗначениеПоУмолчанию"]);
			Детализация.Вставить(Детал["Имя"], ДеталИмя);
		КонецЦикла;
		СтруктураПоказателя.Вставить("Детализация", Детализация);
		
		СписокПоказателейПоКодуСчета = get_prop(ИндексированныеПоказатели, КодСчета);
		Если СписокПоказателейПоКодуСчета = Неопределено Тогда
			СписокПоказателейПоКодуСчета = Новый Массив;
		КонецЕсли;
		СписокПоказателейПоКодуСчета.Добавить(СтруктураПоказателя);
		
		ИндексированныеПоказатели.Вставить(КодСчета, СписокПоказателейПоКодуСчета);
	КонецЦикла;
	
	Возврат ИндексированныеПоказатели;
	
КонецФункции

// Функция index_indicators_by_name
//
// Параметры:
//  Показатели - Массив - Массив показателей в начальном виде
//
// Возвращаемое значение:
//  Массив - Результат выполнения функции = индексированные показатели по имени
//
Функция index_indicators_by_name(Показатели)
	
	ИндексированныеПоказатели = Новый Соответствие;
	
	Для Каждого Показатель Из Показатели["Показатели"] Цикл
		СтруктураПоказателя = Новый Соответствие;
		СтруктураПоказателя.Вставить("КодПоказателя", Показатель["Имя"]);
		СтруктураПоказателя.Вставить("Приоритет", Показатель["Приоритет"]);
		СтруктураПоказателя.Вставить("Рейтинг", 0);
		СтруктураПоказателя.Вставить("СпособХранения", Показатель["СпособХранения"]);
		КодСчета = "";
		СтруктураПоказателя.Вставить("КодСчета", КодСчета);
		Для Каждого Парам Из Показатель["Параметры"] Цикл
			СтруктураПоказателя.Вставить("КодСчета", get_prop(Парам, "Счет"));
			СтруктураПоказателя.Вставить("Параметры", Парам);
		КонецЦикла;
		Детализация = Новый Соответствие;
		Для Каждого Детал Из Показатель["ДетализацияИмпорт"] Цикл
			ДеталИмя = Новый Соответствие;
			ДеталИмя.Вставить("СпособПолучения", Детал["СпособПолучения"]);
			ДеталИмя.Вставить("ЗначениеПоУмолчанию", Детал["ЗначениеПоУмолчанию"]);
			Детализация.Вставить(Детал["Имя"], ДеталИмя);
		КонецЦикла;
		СтруктураПоказателя.Вставить("Детализация", Детализация);
		Если get_prop(ИндексированныеПоказатели, Показатель["Имя"]) = Неопределено Тогда
			ИндексированныеПоказатели.Вставить(Показатель["Имя"], Новый Массив);
		КонецЕсли;
		ИндексированныйПоказатель = get_prop(ИндексированныеПоказатели, Показатель["Имя"]);
		ИндексированныйПоказатель.Добавить(СтруктураПоказателя);
		
	КонецЦикла;
	
	Возврат ИндексированныеПоказатели;
	
КонецФункции

