//DynamicDirective
Функция block_text_indexOf_calc_value(block_type, node, path, context, block_context)
	_Строка = Строка(get_prop(block_context, "VALUE"));
	_ПодстрокаПоиска = Строка(get_prop(block_context, "FIND"));
	_НаправлениеПоиска = get_prop(block_context, "END");
	Результат = 0;
	Если _НаправлениеПоиска = "FIRST" Тогда
		Возврат Найти(_Строка, _ПодстрокаПоиска);	
	ИначеЕсли _НаправлениеПоиска = "LAST" Тогда
		Пока Найти(_Строка, _ПодстрокаПоиска) > 0 Цикл
			РезультатПоиска = Найти(_Строка, _ПодстрокаПоиска); 
			Результат = Результат + РезультатПоиска;
			_Строка = Сред(_Строка, РезультатПоиска + 1, СтрДлина(_Строка));
		КонецЦикла;
		Возврат Результат;
	КонецЕсли;	
	Возврат 0;
КонецФункции 
