
//DynamicDirective

Функция ФильтрДокументовПериод(NAME = "", TITLE = "", DEFAULT_VALUE = Неопределено, MIN_RANGE = "") 
	Фильтр = Новый Соответствие;
	Фильтр.Вставить("NAME", NAME);
	Фильтр.Вставить("TITLE", TITLE);
	Фильтр.Вставить("DEFAULT_VALUE", DEFAULT_VALUE);
	Фильтр.Вставить("TEMPLATE", "filter_period");
		
	Возврат Фильтр;
КонецФункции

Функция ФильтрДокументовПолеСвязи(NAME = "", TITLE = "", ALGORITHM = "", MULTI_SELECT = Ложь, DEFAULT_VALUE = Неопределено, DISPLAY_PROPERTY = Неопределено, KEY_PROPERTY = Неопределено) 
	Фильтр = Новый Соответствие;
	Фильтр.Вставить("NAME", NAME);
	Фильтр.Вставить("TITLE", TITLE);
	Фильтр.Вставить("ALGORITHM", ALGORITHM);
	Фильтр.Вставить("MULTI_SELECT", MULTI_SELECT);
	Фильтр.Вставить("DEFAULT_VALUE", DEFAULT_VALUE);
	Фильтр.Вставить("DISPLAY_PROPERTY", DISPLAY_PROPERTY);
	Фильтр.Вставить("KEY_PROPERTY", KEY_PROPERTY);
	Фильтр.Вставить("TEMPLATE", "filter_link");

	Возврат Фильтр;
КонецФункции

Функция ФильтрДокументовПеречисление(ITEMS, NAME = "", TITLE = "", DEFAULT_VALUE = "") 
	Фильтр = Новый Соответствие;
	Фильтр.Вставить("NAME", NAME);
	Фильтр.Вставить("TITLE", TITLE);
	Фильтр.Вставить("DEFAULT_VALUE", DEFAULT_VALUE);
	Фильтр.Вставить("ITEMS", ITEMS);
	Фильтр.Вставить("TEMPLATE", "filter_enumeration");

	Возврат Фильтр;
КонецФункции

// BSLLS:IfElseIfEndsWithElse-off
//DynamicDirective

Процедура ЗаполнитьФильтрыДокументов(ПараметрыОтображения, node) 
	МассивФильтров = Новый Массив;	
	
	ФильтрПериод = ФильтрДокументовПериод("Дата", "Период", 30); 
	МассивФильтров.Добавить(ФильтрПериод);
	
	ТипОрганизация = workspace_find_mutation_by_name(node, "TYPE_ORGANIZATION");
	ФильтрОрганизация = ФильтрДокументовПолеСвязи("НашаОрганизация", "Организация", "Blockly_" + ТипОрганизация + "_list", 
													Ложь, , "Наименование", "ИдИС"); 
	МассивФильтров.Добавить(ФильтрОрганизация);
	
	ТипОтветственный = workspace_find_mutation_by_name(node, "TYPE_RESPONSIBLE");
	ФильтрОтветственный = ФильтрДокументовПолеСвязи("Ответственный", "Ответственный", "Blockly_" + ТипОтветственный + "_list", Ложь, , "Наименование", "ИдИС"); 
	МассивФильтров.Добавить(ФильтрОтветственный);
	
	ITEMS_1С = Новый Массив();
	ITEM0 = ЗаполнитьСоответствиеЗначенияПеречисления("", Ложь, "Проведен", "0");
	ITEMS_1С.Добавить(ITEM0);
	ITEM1 = ЗаполнитьСоответствиеЗначенияПеречисления("", Ложь, "Не проведен", "1");
	ITEMS_1С.Добавить(ITEM1);
	ITEM2 = ЗаполнитьСоответствиеЗначенияПеречисления("", Ложь, "Помечен на удаление", "2");
	ITEMS_1С.Добавить(ITEM2);
	ФильтрСтатусИС = ФильтрДокументовПеречисление(ITEMS_1С, "СтатусИС", "Статус 1С", "");
	МассивФильтров.Добавить(ФильтрСтатусИС);
	
	ITEMS_Saby = Новый Массив();
	ITEMS_Saby.Добавить(ЗаполнитьСоответствиеЗначенияПеречисления("", Ложь, "Документ редактируется", "0"));
	ITEMS_Saby.Добавить(ЗаполнитьСоответствиеЗначенияПеречисления("", Ложь, "Есть документ", "1"));
	ITEMS_Saby.Добавить(ЗаполнитьСоответствиеЗначенияПеречисления("", Ложь, "Отправлено приглашение", "2"));
	ITEMS_Saby.Добавить(ЗаполнитьСоответствиеЗначенияПеречисления("", Ложь, "Отправлен", "3"));
	ITEMS_Saby.Добавить(ЗаполнитьСоответствиеЗначенияПеречисления("", Ложь, "Доставлен", "4"));
	ITEMS_Saby.Добавить(ЗаполнитьСоответствиеЗначенияПеречисления("", Ложь, "Ошибка", "6"));
	ITEMS_Saby.Добавить(ЗаполнитьСоответствиеЗначенияПеречисления("", Ложь, "Выполнение завершено успешно", "7"));
	ITEMS_Saby.Добавить(ЗаполнитьСоответствиеЗначенияПеречисления("", Ложь, "Выполнение завершено с проблемами", "9"));
	ITEMS_Saby.Добавить(ЗаполнитьСоответствиеЗначенияПеречисления("", Ложь, "В обработке", "10"));
	ITEMS_Saby.Добавить(ЗаполнитьСоответствиеЗначенияПеречисления("", Ложь, "Отозван мной", "19"));
	ITEMS_Saby.Добавить(ЗаполнитьСоответствиеЗначенияПеречисления("", Ложь, "Удален контрагентом", "20"));
	ITEMS_Saby.Добавить(ЗаполнитьСоответствиеЗначенияПеречисления("", Ложь, "Аннулирован по соглашению", "22"));
	ITEMS_Saby.Добавить(ЗаполнитьСоответствиеЗначенияПеречисления("", Ложь, "Ожидает подписания", "23"));
	ITEMS_Saby.Добавить(ЗаполнитьСоответствиеЗначенияПеречисления("", Ложь, "Ожидает аннулирования", "27"));
	
	ФильтрСтатусSaby = ФильтрДокументовПеречисление(ITEMS_Saby, "СтатусСБИС", "Статус Saby", "");
	МассивФильтров.Добавить(ФильтрСтатусSaby);
	
	FILTER_SET = get_prop(ПараметрыОтображения, "FILTER_SET");
	Если FILTER_SET = "EMPLOYEE" Тогда
		ТипСотрудник = workspace_find_mutation_by_name(node, "TYPE_EMPLOYEE");
		ФильтрСотрудник = ФильтрДокументовПолеСвязи("Сотрудник", "Сотрудник", "Blockly_" + ТипСотрудник + "_list", Истина, , "Наименование", "ИдИС"); 
		МассивФильтров.Добавить(ФильтрСотрудник);
	ИначеЕсли FILTER_SET = "PRIVATE_PERSON" Тогда
		ТипФизическоеЛицо = workspace_find_mutation_by_name(node, "TYPE_PRIVATE_PERSON");
		ФильтрФизическоеЛицо = ФильтрДокументовПолеСвязи("ЧастноеЛицо", "Физическое лицо", "Blockly_" + ТипФизическоеЛицо + "_list", 
															Истина, , "Наименование", "ИдИС"); 
		МассивФильтров.Добавить(ФильтрФизическоеЛицо);
	ИначеЕсли FILTER_SET = "CONTRACTOR" Тогда
		ТипКонтрагент = workspace_find_mutation_by_name(node, "TYPE_CONTRACTOR");
		ФильтрКонтрагент = ФильтрДокументовПолеСвязи("Контрагент", "Контрагент", "Blockly_" + ТипКонтрагент + "_list", Истина, , "Наименование", "ИдИС"); 
		МассивФильтров.Добавить(ФильтрКонтрагент);
	ИначеЕсли FILTER_SET = "WAREHOUSE" Тогда
		ТипКонтрагент = workspace_find_mutation_by_name(node, "TYPE_CONTRACTOR");
		ФильтрКонтрагент = ФильтрДокументовПолеСвязи("Контрагент", "Контрагент", "Blockly_" + ТипКонтрагент + "_list", Истина, , "Наименование", "ИдИС"); 
		МассивФильтров.Добавить(ФильтрКонтрагент);
		ТипСклад = workspace_find_mutation_by_name(node, "TYPE_WAREHOUSE");
	    ФильтрСклад = ФильтрДокументовПолеСвязи("Склад", "Склад", "Blockly_" + ТипСклад + "_list", Истина, , "Наименование", "ИдИС");
		МассивФильтров.Добавить(ФильтрСклад);
	КонецЕсли;
	
	ДопФильтры = get_prop(ПараметрыОтображения, "FILTER", Новый Массив);
	Если ДопФильтры.Количество() > 0 Тогда
		Для каждого ДопФильтр Из ДопФильтры Цикл
			МассивФильтров.Добавить(ДопФильтр);
		КонецЦикла;	
	КонецЕсли;
	
	ПараметрыОтображения.Вставить("FILTER", МассивФильтров);
КонецПроцедуры

// BSLLS:IfElseIfEndsWithElse-on

Функция ЗаполнитьСоответствиеЗначенияПеречисления(PARENT, IS_FOLDER, TITLE, VALUE)
	ITEM = Новый Соответствие;
	ITEM.Вставить("PARENT", PARENT);
	ITEM.Вставить("IS_FOLDER", IS_FOLDER);
	ITEM.Вставить("TITLE", TITLE);
	ITEM.Вставить("VALUE", VALUE);
	
	Возврат ITEM;	
	
КонецФункции	

//DynamicDirective

Функция КолонкаДокументов(NAME, TITLE, TYPE, PROPERTY, VISIBLE, WIDTH, HORIZONTALSTRETCH = Истина, MORE_LOAD = Истина) 
	КолонкаСписка = Новый Соответствие;
	КолонкаСписка.Вставить("NAME", NAME);
	КолонкаСписка.Вставить("TITLE", TITLE);
	КолонкаСписка.Вставить("TYPE", TYPE);
	КолонкаСписка.Вставить("PROPERTY", PROPERTY);
	КолонкаСписка.Вставить("VISIBLE", VISIBLE);
	КолонкаСписка.Вставить("WIDTH", WIDTH);
	КолонкаСписка.Вставить("ALIGN", "2");
	КолонкаСписка.Вставить("HORIZONTALSTRETCH", HORIZONTALSTRETCH);
	КолонкаСписка.Вставить("MORE_LOAD", MORE_LOAD);
	КолонкаСписка.Вставить("TEMPLATE", "column_default");
	Возврат КолонкаСписка;
КонецФункции	

// BSLLS:IfElseIfEndsWithElse-off
//DynamicDirective

Процедура ЗаполнитьКолонкиДокументов(ПараметрыОтображения, node)
// BSLLS:MagicNumber-off	
	МассивКолонок = Новый Массив;	
	КолонкаСтатус1С = КолонкаСтатус1C();
	МассивКолонок.Добавить(КолонкаСтатус1С); 
		
	КолонкаСтатусСБИС = КолонкаСтатусСБИС();
	МассивКолонок.Добавить(КолонкаСтатусСБИС);
	
	ШиринаПоУмолчанию = 230;
	ТипСтрока = "Строка";
	
	РеквизитАктивныйЭтап = "АктивныйЭтап";
	КолонкаАктивныйЭтап = КолонкаДокументов("АктивныйЭтап", "Активный этап", ТипСтрока, РеквизитАктивныйЭтап, Истина, 50);
	МассивКолонок.Добавить(КолонкаАктивныйЭтап);
	
	КолонкаДата = КолонкаДокументов("Дата", "Дата", "Дата", "Дата", Истина, 120, Ложь);
    МассивКолонок.Добавить(КолонкаДата);
	
	КолонкаНомер = КолонкаДокументов("Номер", "Номер", ТипСтрока, "Номер", Истина, 110, Ложь);
    МассивКолонок.Добавить(КолонкаНомер);
	
	COLUMNS_SET = get_prop(ПараметрыОтображения, "COLUMNS_SET");
	Если COLUMNS_SET = "EMPLOYEE" Тогда
		РеквизитСотрудник = workspace_find_mutation_by_name(node, "FIELD_EMPLOYEE");
	    КолонкаСотрудник = КолонкаДокументов("Сотрудник", "Сотрудник", ТипСтрока, РеквизитСотрудник, Истина, ШиринаПоУмолчанию);
		МассивКолонок.Добавить(КолонкаСотрудник);
	ИначеЕсли COLUMNS_SET = "PRIVATE_PERSON" Тогда
		РеквизитФизическоеЛицо = workspace_find_mutation_by_name(node, "FIELD_PRIVATE_PERSON");
	    КолонкаФизическоеЛицо = КолонкаДокументов("ЧастноеЛицо", "Физическое лицо", ТипСтрока, РеквизитФизическоеЛицо, 
													Истина, ШиринаПоУмолчанию);
		МассивКолонок.Добавить(КолонкаФизическоеЛицо);
	ИначеЕсли COLUMNS_SET = "CONTRACTOR" Тогда
		РеквизитКонтрагент = workspace_find_mutation_by_name(node, "FIELD_CONTRACTOR");
	    КолонкаКонтрагент = КолонкаДокументов("Контрагент", "Контрагент", ТипСтрока, РеквизитКонтрагент, Истина, ШиринаПоУмолчанию);
		МассивКолонок.Добавить(КолонкаКонтрагент);
		РеквизитСумма = workspace_find_mutation_by_name(node, "FIELD_SUM");
	    КолонкаСумма = КолонкаДокументов("Сумма", "Сумма", ТипСтрока, РеквизитСумма, Истина, 100);
		МассивКолонок.Добавить(КолонкаСумма);
	ИначеЕсли COLUMNS_SET = "WAREHOUSE" Тогда
		РеквизитКонтрагент = workspace_find_mutation_by_name(node, "FIELD_CONTRACTOR");
	    КолонкаКонтрагент = КолонкаДокументов("Контрагент", "Контрагент", ТипСтрока, РеквизитКонтрагент, Истина, ШиринаПоУмолчанию);
		МассивКолонок.Добавить(КолонкаКонтрагент);
		РеквизитСклад = workspace_find_mutation_by_name(node, "FIELD_WAREHOUSE");
	    КолонкаСклад = КолонкаДокументов("Склад", "Склад", ТипСтрока, РеквизитСклад, Истина, ШиринаПоУмолчанию);
		МассивКолонок.Добавить(КолонкаСклад);
		РеквизитСумма = workspace_find_mutation_by_name(node, "FIELD_SUM");
	    КолонкаСумма = КолонкаДокументов("Сумма", "Сумма", ТипСтрока, РеквизитСумма, Истина, 100);
		МассивКолонок.Добавить(КолонкаСумма);
	КонецЕсли;
	
	ДопКолонки = get_prop(ПараметрыОтображения, "COLUMNS", Новый Массив);
	Если ДопКолонки.Количество() > 0 Тогда
		Для каждого ДопКолонка Из ДопКолонки Цикл
			МассивКолонок.Добавить(ДопКолонка);
		КонецЦикла;	
	КонецЕсли;	
	
	РеквизитОрганизация = workspace_find_mutation_by_name(node, "FIELD_ORGANIZATION");
	КолонкаОрганизация = КолонкаДокументов("НашаОрганизация", "Организация", ТипСтрока, РеквизитОрганизация, 
											Истина, ШиринаПоУмолчанию);
	МассивКолонок.Добавить(КолонкаОрганизация);
	
	РеквизитКомментарий = "Комментарий";
	КолонкаКомментарий = КолонкаДокументов("Комментарий", "Комментарий", ТипСтрока, РеквизитКомментарий, Истина, ШиринаПоУмолчанию);
	МассивКолонок.Добавить(КолонкаКомментарий);
	
	РеквизитОтветственный = workspace_find_mutation_by_name(node, "FIELD_RESPONSIBLE");
	КолонкаОрганизация = КолонкаДокументов("Ответственный", "Ответственный", ТипСтрока, РеквизитОтветственный, Истина, ШиринаПоУмолчанию);
	МассивКолонок.Добавить(КолонкаОрганизация);
		
   	ПараметрыОтображения.Вставить("COLUMNS", МассивКолонок);
// BSLLS:MagicNumber-on
КонецПроцедуры

// BSLLS:IfElseIfEndsWithElse-on

//DynamicDirective

Функция КомандаДокументов(NAME = "", TITLE = "", ICON = "", DESCRIPTION = "", DEFAULT_BUTTON = Ложь, SHOW_IN_MAIN_TOOLBAR = Истина, 
	SHOW_IN_DEFAULT_TOOLBAR = Ложь, SHOW_IN_OPERATION_PANEL = Ложь, SHOW_IN_ITEM_ACTION = Истина, ACTION = "", 
	PARAM0_KEY = "", PARAM0_VALUE = "", PARAM1_KEY = "", PARAM1_VALUE = "");
	Команда = Новый Соответствие;
	Команда.Вставить("NAME", NAME);
	Команда.Вставить("TITLE", TITLE);
	Команда.Вставить("ICON", ICON);
	Команда.Вставить("DESCRIPTION", DESCRIPTION);
	Команда.Вставить("DEFAULT_BUTTON", DEFAULT_BUTTON);
	Команда.Вставить("SHOW_IN_MAIN_TOOLBAR", SHOW_IN_MAIN_TOOLBAR);
	Команда.Вставить("SHOW_IN_DEFAULT_TOOLBAR", SHOW_IN_DEFAULT_TOOLBAR);
	Команда.Вставить("SHOW_IN_OPERATION_PANEL", SHOW_IN_OPERATION_PANEL);
	Команда.Вставить("SHOW_IN_ITEM_ACTION", SHOW_IN_ITEM_ACTION);
	Команда.Вставить("ACTION", ACTION);
	ПараметрыКоманды = Новый Структура;
	Если Не PARAM0_KEY = "" Тогда
		ПараметрыКоманды.Вставить(PARAM0_KEY, PARAM0_VALUE);
	КонецЕсли;
	Если Не PARAM1_KEY = "" Тогда
		ПараметрыКоманды.Вставить(PARAM1_KEY, PARAM1_VALUE);
	КонецЕсли;
	Команда.Вставить("ARGS", ПараметрыКоманды);
	Команда.Вставить("TEMPLATE", "command");
	
	Возврат Команда; 
КонецФункции

// BSLLS:IfElseIfEndsWithElse-off
//DynamicDirective

Процедура ЗаполнитьКомандыДокументов(ПараметрыОтображения)
	КомандыДокументов = Новый Массив;
	
	endpoint_main = "main";
	algorithm_str = "Algorithm";
	endpoint_str = "Endpoint";
	
	ACTIONS_SET = get_prop(ПараметрыОтображения, "ACTIONS_SET");
	Если ACTIONS_SET = "1" Тогда
		КомандаЗагрузитьВSaby = КомандаДокументов("ЗагрузитьВSaby", "Загрузить в " + ЛокализацияНазваниеПродукта(),,,,,,,, "OPEN_FORM_MODULE", "Template", "OperationImport");
		КомандыДокументов.Добавить(КомандаЗагрузитьВSaby);
	ИначеЕсли ACTIONS_SET = "0" Тогда
		КомандаВыгрузитьИзSaby = КомандаДокументов("ВыгрузитьИзSaby", "Выгрузить из " + ЛокализацияНазваниеПродукта(),,,,,,,, "BLOCKLY_RUN_FOR_SELECTED_ITEMS_IN_MODULE",
								algorithm_str, "Blockly_Документы_update", endpoint_str, endpoint_main);
		КомандыДокументов.Добавить(КомандаВыгрузитьИзSaby);	
	ИначеЕсли ACTIONS_SET = "1/25" Тогда
		КомандаЗагрузитьВSaby = КомандаДокументов("ЗагрузитьВSaby", "Загрузить в " + ЛокализацияНазваниеПродукта(),,,,,,,, "OPEN_FORM_MODULE", "Template", "OperationImport");
		КомандыДокументов.Добавить(КомандаЗагрузитьВSaby);
		
		КомандаВыгрузитьВложенияИзSaby = КомандаДокументов("ВыгрузитьВложенияИзSaby", "Выгрузить вложения из " + ЛокализацияНазваниеПродукта(),,,,,,,, "BLOCKLY_RUN_FOR_SELECTED_ITEMS_IN_MODULE",
															algorithm_str, "Blockly_ExportAttachment_operation", endpoint_str, endpoint_main);
		КомандыДокументов.Добавить(КомандаВыгрузитьВложенияИзSaby);				
	ИначеЕсли ACTIONS_SET = "0/25" Тогда
		КомандаВыгрузитьИзSaby = КомандаДокументов("ВыгрузитьИзSaby", "Выгрузить из " + ЛокализацияНазваниеПродукта(),,,,,,,, "BLOCKLY_RUN_FOR_SELECTED_ITEMS_IN_MODULE",
								algorithm_str, "Blockly_Документы_update", endpoint_str, endpoint_main);
		КомандыДокументов.Добавить(КомандаВыгрузитьИзSaby);
		КомандаВыгрузитьВложенияИзSaby = КомандаДокументов("ВыгрузитьВложенияИзSaby", "Выгрузить вложения из " + ЛокализацияНазваниеПродукта(),,,,,,,, "BLOCKLY_RUN_FOR_SELECTED_ITEMS_IN_MODULE",
															algorithm_str, "Blockly_ExportAttachment_operation", endpoint_str, endpoint_main);
		КомандыДокументов.Добавить(КомандаВыгрузитьВложенияИзSaby);
	ИначеЕсли ACTIONS_SET = "1/0" Тогда
		КомандаЗагрузитьВSaby = КомандаДокументов("ЗагрузитьВSaby", "Загрузить в " + ЛокализацияНазваниеПродукта(),,,,,,,, "OPEN_FORM_MODULE", "Template", "OperationImport");
		КомандыДокументов.Добавить(КомандаЗагрузитьВSaby);
		КомандаВыгрузитьИзSaby = КомандаДокументов("ВыгрузитьИзSaby", "Выгрузить из " + ЛокализацияНазваниеПродукта(),,,,,,,, "BLOCKLY_RUN_FOR_SELECTED_ITEMS_IN_MODULE",
								algorithm_str, "Blockly_Документы_update", endpoint_str, endpoint_main);
		КомандыДокументов.Добавить(КомандаВыгрузитьИзSaby);
	ИначеЕсли ACTIONS_SET = "0/25/1" Тогда
		КомандаВыгрузитьИзSaby = КомандаДокументов("ВыгрузитьИзSaby", "Выгрузить из " + ЛокализацияНазваниеПродукта(),,,,,,,, "BLOCKLY_RUN_FOR_SELECTED_ITEMS_IN_MODULE",
								algorithm_str, "Blockly_Документы_update", endpoint_str, endpoint_main);
		КомандыДокументов.Добавить(КомандаВыгрузитьИзSaby);
		КомандаВыгрузитьВложенияИзSaby = КомандаДокументов("ВыгрузитьВложенияИзSaby", "Выгрузить вложения из " + ЛокализацияНазваниеПродукта(),,,,,,,, "BLOCKLY_RUN_FOR_SELECTED_ITEMS_IN_MODULE",
															algorithm_str, "Blockly_ExportAttachment_operation", endpoint_str, endpoint_main);
		КомандыДокументов.Добавить(КомандаВыгрузитьВложенияИзSaby);
		КомандаЗагрузитьВSaby = КомандаДокументов("ЗагрузитьВSaby", "Загрузить в " + ЛокализацияНазваниеПродукта(),,,,,,,, "OPEN_FORM_MODULE", "Template", "OperationImport");
		КомандыДокументов.Добавить(КомандаЗагрузитьВSaby);
	ИначеЕсли ACTIONS_SET = "20/0/25/1" Тогда
		КомандаВыполнитьПереходЭДО = КомандаДокументов("ВыполнитьПереходЭДО", "Выполнить в " + ЛокализацияНазваниеПродукта(),,,,,,,, "OPEN_FORM_MODULE", "Template", "OperationEdoAction");
		КомандыДокументов.Добавить(КомандаВыполнитьПереходЭДО);
		КомандаВыгрузитьИзSaby = КомандаДокументов("ВыгрузитьИзSaby", "Выгрузить из " + ЛокализацияНазваниеПродукта(),,,,,,,, "BLOCKLY_RUN_FOR_SELECTED_ITEMS_IN_MODULE",
								algorithm_str, "Blockly_Документы_update", endpoint_str, endpoint_main);
		КомандыДокументов.Добавить(КомандаВыгрузитьИзSaby);
		КомандаВыгрузитьВложенияИзSaby = КомандаДокументов("ВыгрузитьВложенияИзSaby", "Выгрузить вложения из " + ЛокализацияНазваниеПродукта(),,,,,,,, "BLOCKLY_RUN_FOR_SELECTED_ITEMS_IN_MODULE",
															algorithm_str, "Blockly_ExportAttachment_operation", endpoint_str, endpoint_main);
		КомандыДокументов.Добавить(КомандаВыгрузитьВложенияИзSaby);
		КомандаЗагрузитьВSaby = КомандаДокументов("ЗагрузитьВSaby", "Загрузить в " + ЛокализацияНазваниеПродукта(),,,,,,,, "OPEN_FORM_MODULE", "Template", "OperationImport");
		КомандыДокументов.Добавить(КомандаЗагрузитьВSaby);
	КонецЕсли;
	
	ДопКоманды = get_prop(ПараметрыОтображения, "ACTIONS", Новый Массив);
	Если ДопКоманды.Количество() > 0 Тогда
		Для каждого ДопКоманда Из ДопКоманды Цикл
			КомандыДокументов.Добавить(ДопКоманда);
		КонецЦикла;	
	КонецЕсли;
	
	КомандаОткрытьВSaby = КомандаДокументов("OPEN_FORM_SABY", "Открыть в " + ЛокализацияНазваниеПродукта(),,,,,,,, "OPEN_FORM_SABY");  
	КомандыДокументов.Добавить(КомандаОткрытьВSaby);
	
	КомандаОткрытьВИС = КомандаДокументов("OPEN_FORM_IS", "Открыть в 1С",,,,,,,, "OPEN_FORM_IS");  
	КомандыДокументов.Добавить(КомандаОткрытьВИС);
	
	КомандаОбновить = КомандаДокументов("REFRESH_ITEMS", "Обновить список",,,,,,,, "REFRESH_ITEMS");  
	КомандыДокументов.Добавить(КомандаОбновить);
	
	КомандаОбновитьСтатусы = КомандаДокументов("ОбновитьСтатусы", "Обновить статусы",,,,,,,, "BLOCKLY_RUN_FOR_SELECTED_ITEMS_IN_MODULE",
															algorithm_str, "Blockly_ОбновитьСтатусы_send", endpoint_str, endpoint_main);
    КомандыДокументов.Добавить(КомандаОбновитьСтатусы);
	
	КомандаПолеПоиска = Новый Соответствие;
	КомандаПолеПоиска.Вставить("TEMPLATE", "search");
	КомандыДокументов.Добавить(КомандаПолеПоиска);
	
    ПараметрыОтображения.Вставить("ACTIONS", КомандыДокументов);
КонецПроцедуры

// BSLLS:IfElseIfEndsWithElse-on

//DynamicDirective

Процедура ЗаполнитьПараметрыОтображенияДокументов(ПараметрыОтображения, node)
	ЗаполнитьФильтрыДокументов(ПараметрыОтображения, node);
	ЗаполнитьКолонкиДокументов(ПараметрыОтображения, node);
	ЗаполнитьКомандыДокументов(ПараметрыОтображения);
КонецПроцедуры

//DynamicDirective

Функция block_view_list_documents_calc_value(block_type, node, path, context, block_context)
	param = Новый Соответствие;
	copy_block_context(param, block_context);
	param.Вставить("TEMPLATE", "list_flat");
	ЗаполнитьПараметрыОтображенияДокументов(param, node);
	ОписаниеТипа = Новый ОписаниеТипов("Число");
	PAGE_SIZE = ОписаниеТипа.ПривестиЗначение(get_prop(param, "PAGE_SIZE", 25)); 
	param.Вставить("PAGE_SIZE", PAGE_SIZE);
	Возврат param;
КонецФункции	

