

//DynamicDirective

Процедура ЗаполнитьФильтрыЗадач(ПараметрыОтображения) 
	МассивФильтров = Новый Массив;	
	ФильтрСоответствие = Новый Соответствие;
	ФильтрСоответствие.Вставить("NAME", "Дата");
	ФильтрСоответствие.Вставить("TITLE", "Период");
	ФильтрСоответствие.Вставить("DEFAULT_VALUE", 30);
	ФильтрСоответствие.Вставить("TEMPLATE", "filter_period");
	МассивФильтров.Добавить(ФильтрСоответствие);
	ПараметрыОтображения.Вставить("FILTER", МассивФильтров);
КонецПроцедуры

//DynamicDirective

Функция КолонкаЗадач(NAME, TITLE, TYPE, PROPERTY, VISIBLE, WIDTH, HORIZONTALSTRETCH = Истина, MORE_LOAD = Ложь) 
	КолонкаСписка = Новый Соответствие;
	КолонкаСписка.Вставить("NAME", NAME);
	КолонкаСписка.Вставить("TITLE", TITLE);
	КолонкаСписка.Вставить("TYPE", TYPE);
	КолонкаСписка.Вставить("PROPERTY", PROPERTY);
	КолонкаСписка.Вставить("VISIBLE", VISIBLE);
	КолонкаСписка.Вставить("WIDTH", WIDTH);
	КолонкаСписка.Вставить("ALIGN", "2");
	КолонкаСписка.Вставить("HORIZONTALSTRETCH", HORIZONTALSTRETCH);
	КолонкаСписка.Вставить("MORE_LOAD", MORE_LOAD);
	КолонкаСписка.Вставить("TEMPLATE", "column_default");
	Возврат КолонкаСписка;
КонецФункции

//DynamicDirective

Функция КолонкаСтатусСБИС() 
	КолонкаСтатусСБИС = Новый Соответствие;
	КолонкаСтатусСБИС.Вставить("NAME", "СтатусСБИС");
	КолонкаСтатусСБИС.Вставить("TITLE", ЛокализацияНазваниеПродукта());
	КолонкаСтатусСБИС.Вставить("PROPERTY", "СтатусСБИС");
	КолонкаСтатусСБИС.Вставить("VISIBLE", Истина);
	КолонкаСтатусСБИС.Вставить("WIDTH", "50");
	КолонкаСтатусСБИС.Вставить("TEMPLATE", "column_icon");
	КолонкаСтатусСБИС.Вставить("ALIGN", "2");
	КолонкаСтатусСБИС.Вставить("HORIZONTALSTRETCH", Ложь);
	ICON = Новый Соответствие;
	ICON.Вставить("KEY", "Интеграция");
	ICON.Вставить("VALUE", "СтатусыСБИС"); 
	ICONS = Новый Массив;	
	ICONS.Добавить(ICON);
	КолонкаСтатусСБИС.Вставить("ICONS", ICONS);
	Возврат КолонкаСтатусСБИС;
КонецФункции

//DynamicDirective

Функция КолонкаСтатус1C() 
	КолонкаСтатус1С = Новый Соответствие;
	КолонкаСтатус1С.Вставить("NAME", "СтатусИС");
	КолонкаСтатус1С.Вставить("TITLE", "1С");
	КолонкаСтатус1С.Вставить("PROPERTY", "СтатусИС");
	КолонкаСтатус1С.Вставить("VISIBLE", Истина);
	КолонкаСтатус1С.Вставить("WIDTH", "50");
	КолонкаСтатус1С.Вставить("TEMPLATE", "column_icon");
	КолонкаСтатус1С.Вставить("ALIGN", "2");
	КолонкаСтатус1С.Вставить("HORIZONTALSTRETCH", Ложь);
	ICON = Новый Соответствие;
	ICON.Вставить("KEY", "Интеграция");
	ICON.Вставить("VALUE", "Статусы1С"); 
	ICONS = Новый Массив;	
	ICONS.Добавить(ICON);
	КолонкаСтатус1С.Вставить("ICONS", ICONS);
	Возврат КолонкаСтатус1С;
КонецФункции

//DynamicDirective

Процедура ЗаполнитьКолонкиЗадач(ПараметрыОтображения)
// BSLLS:MagicNumber-off	
	МассивКолонок = Новый Массив;
	ТипСтрока = "Строка";
	КолонкаСтатус1С = КолонкаСтатус1C();
	МассивКолонок.Добавить(КолонкаСтатус1С); 
	
	КолонкаСтатусСБИС = КолонкаСтатусСБИС();
	МассивКолонок.Добавить(КолонкаСтатусСБИС); 
	
	КолонкаДата = КолонкаЗадач("Дата", "Дата", "Дата", "Документ.Дата", Истина, 120, Ложь);
    МассивКолонок.Добавить(КолонкаДата);
	
	КолонкаНомер = КолонкаЗадач("Номер", "Номер", ТипСтрока, "Документ.Номер", Истина, 110, Ложь);
    МассивКолонок.Добавить(КолонкаНомер);

	ШиринаПоУмолчанию = 230;
	КолонкаНазвание = КолонкаЗадач("Название", "Название", ТипСтрока, "Документ.Название", Истина, ШиринаПоУмолчанию);
	МассивКолонок.Добавить(КолонкаНазвание); 
	РеквизитСотрудники = "Документ.Сотрудники.0.ФИО";
	КолонкаСотрудник = КолонкаЗадач("Сотрудник", "Сотрудник", ТипСтрока, РеквизитСотрудники, Истина, ШиринаПоУмолчанию, Истина, Истина);
	МассивКолонок.Добавить(КолонкаСотрудник); 
	РеквизитОрганизация = "Документ.НашаОрганизация.Название";
	КолонкаОрганизация = КолонкаЗадач("Организация", "Наша организация", ТипСтрока, РеквизитОрганизация, Истина, ШиринаПоУмолчанию);
	МассивКолонок.Добавить(КолонкаОрганизация); 
 	КолонкаЭтап = КолонкаЗадач("Этап", "Этап", ТипСтрока, "Документ.Этап.Название", Истина, ШиринаПоУмолчанию);
	МассивКолонок.Добавить(КолонкаЭтап); 
 	КолонкаДокументСБИС = КолонкаЗадач("ДокументСБИС", "ДокументСБИС", "Соответствие", "Документ", Ложь, ШиринаПоУмолчанию);
	МассивКолонок.Добавить(КолонкаДокументСБИС); 
	СтрокаДокументИС = "ДокументИС";
	КолонкаДокументИС = КолонкаЗадач(СтрокаДокументИС, СтрокаДокументИС, "ДокументСсылка", СтрокаДокументИС, Ложь, ШиринаПоУмолчанию);
	МассивКолонок.Добавить(КолонкаДокументИС); 
	
	ПараметрыОтображения.Вставить("COLUMNS", МассивКолонок);
// BSLLS:MagicNumber-on
КонецПроцедуры  

//DynamicDirective

Функция КомандаЗадач(NAME = "", TITLE = "", ICON = "", DESCRIPTION = "", DEFAULT_BUTTON = Ложь, SHOW_IN_MAIN_TOOLBAR = Истина, 
					 SHOW_IN_DEFAULT_TOOLBAR = Ложь, SHOW_IN_OPERATION_PANEL = Ложь, SHOW_IN_ITEM_ACTION = Истина, ACTION = "");
    Команда = Новый Соответствие;
	Команда.Вставить("NAME", NAME);
	Команда.Вставить("TITLE", TITLE);
	Команда.Вставить("ICON", ICON);
	Команда.Вставить("DESCRIPTION", DESCRIPTION);
	Команда.Вставить("DEFAULT_BUTTON", DEFAULT_BUTTON);
	Команда.Вставить("SHOW_IN_MAIN_TOOLBAR", SHOW_IN_MAIN_TOOLBAR);
	Команда.Вставить("SHOW_IN_DEFAULT_TOOLBAR", SHOW_IN_DEFAULT_TOOLBAR);
	Команда.Вставить("SHOW_IN_OPERATION_PANEL", SHOW_IN_OPERATION_PANEL);
	Команда.Вставить("SHOW_IN_ITEM_ACTION", SHOW_IN_ITEM_ACTION);
	Команда.Вставить("ACTION", ACTION);
	Команда.Вставить("TEMPLATE", "command");
	
	Возврат Команда; 
КонецФункции

//DynamicDirective

Процедура ЗаполнитьКомандыЗадач(ПараметрыОтображения)
	КомандыЗадач = Новый Массив;
	КомандаВыполнитьSABY = КомандаЗадач("ВыполнитьВSABYНажатие", "Выполнить в " + ЛокализацияНазваниеПродукта(),,,,,,,, "ВыполнитьВSABYНажатие");  
	КомандыЗадач.Добавить(КомандаВыполнитьSABY);
	
	МенюКомандВыгрузитьВ1С = КомандаЗадач("ВыгрузитьВ1СМеню", "Выгрузить в 1С");  
   	МенюКомандВыгрузитьВ1С.Вставить("TEMPLATE", "menu"); 
	КомандыВыгрузитьВ1С = Новый Массив;
	КомандаВыгрузитьОбъектВ1СНаКлиенте = КомандаЗадач("ВыгрузитьОбъектВ1СНаКлиенте", "Выгрузить в 1С",,,,,,,, "ВыгрузитьОбъектВ1СНаКлиенте");  
 	КомандаВыгрузитьВложенияНаКлиенте = КомандаЗадач("ВыгрузитьВложенияНаКлиенте", "Выгрузить вложения из " + ЛокализацияНазваниеПродукта(),,,,,,,, "ВыгрузитьВложенияНаКлиенте");  
    КомандыВыгрузитьВ1С.Добавить(КомандаВыгрузитьОбъектВ1СНаКлиенте);
    КомандыВыгрузитьВ1С.Добавить(КомандаВыгрузитьВложенияНаКлиенте);
	МенюКомандВыгрузитьВ1С.Вставить("COMMANDS", КомандыВыгрузитьВ1С); 
	КомандыЗадач.Добавить(МенюКомандВыгрузитьВ1С);
	
	КомандаОбновитьВСБИСНажатие = КомандаЗадач("ОбновитьВСБИСНажатие", "Обновить в " + ЛокализацияНазваниеПродукта(),,,,,,,, "ОбновитьВСБИСНажатие");  
	КомандыЗадач.Добавить(КомандаОбновитьВСБИСНажатие);

	КомандаОбновитьВСБИСНажатие = КомандаЗадач("ОткрытьВSABYНажатие", "Открыть в " + ЛокализацияНазваниеПродукта(),,,,,,,, "ОткрытьВSABYНажатие");  
	КомандыЗадач.Добавить(КомандаОбновитьВСБИСНажатие);
 	
	КомандаОбновить = КомандаЗадач("REFRESH_ITEMS", "Обновить",,,,,,,, "REFRESH_ITEMS");  
	КомандыЗадач.Добавить(КомандаОбновить);
   
    ПараметрыОтображения.Вставить("ACTIONS", КомандыЗадач);
КонецПроцедуры

//DynamicDirective

Процедура ЗаполнитьПараметрыОтображенияЗадач(ПараметрыОтображения)
	ЗаполнитьФильтрыЗадач(ПараметрыОтображения);
	ЗаполнитьКолонкиЗадач(ПараметрыОтображения);
	ЗаполнитьКомандыЗадач(ПараметрыОтображения);
КонецПроцедуры

//DynamicDirective

Функция block_view_list_tasks_calc_value(block_type, node, path, context, block_context)
	param = Новый Соответствие;
	copy_block_context(param, block_context);
	param.Вставить("TEMPLATE", "list_flat");
	ЗаполнитьПараметрыОтображенияЗадач(param);
	param.Вставить("FORM", "ПросмотрДокумента");
	Возврат param;
КонецФункции	

