
// Группировка через реквизит структуры
//
// Параметры:
//  block_type - Строка - Название блока
// 	node - Структура - Dom структура хмл
//  path - Строка - Пусть до блока по алгоритму
//  context - Структура - Общий контекст алгоритма
//  block_context - Структура - Контекст исполняемого блока
//
// Возвращаемое значение:
//  - Структура - Результат обсчета алгоритма
//
Функция block_list_obj_group_calc_value(block_type, node, path, context, block_context)
	ГруппируемыйСписок = block_context["LIST"];
	ПолеГруппировки = block_context["PARAMS"];
	РезультатСписокИтого = Новый Массив();
	Если ТипЗнч(ПолеГруппировки) = Тип("Строка") Тогда
		РезультатСтруктура = ГруппируемыйСписокСтрока(ГруппируемыйСписок, ПолеГруппировки);	
	ИначеЕсли ТипЗнч(ПолеГруппировки) = Тип("Массив") Тогда	  
		РезультатСтруктура = ГруппируемыйСписокМассив(ГруппируемыйСписок, ПолеГруппировки);		
	Иначе
	// Для отладки
	// BSLLS:UnusedLocalVariable-off
		Ошибка = "Неправильный тип группировки"
	// BSLLS:UnusedLocalVariable-on	
	КонецЕсли;
	Для Каждого Элемент Из РезультатСтруктура Цикл
		РезультатСписок = Новый Массив();
		Для Каждого ЭлементСтруктуры Из Элемент.Значение Цикл
			РезультатСписок.Добавить(ЭлементСтруктуры);
		КонецЦикла;
		РезультатСписокИтого.Добавить(РезультатСписок);
	КонецЦикла;
	Возврат РезультатСписокИтого;
КонецФункции

// Группировка если это строка
//
// Параметры:
// 	ГруппируемыйСписок - Структура - Группируемая структура
//  ПолеГруппировки - Строка - Поле для группировки
//
// Возвращаемое значение:
//  - Структура - Результат обсчета алгоритма
//
Функция ГруппируемыйСписокСтрока(ГруппируемыйСписок, ПолеГруппировки)
	РезультатСтруктура = Новый Соответствие();
	Для Каждого ЭлементИсходногоСписка Из ГруппируемыйСписок Цикл
		ЗначениеЭлементаИсходногоСписка = ЭлементИсходногоСписка[ПолеГруппировки];
		Если РезультатСтруктура.Получить(ЗначениеЭлементаИсходногоСписка) = Неопределено Тогда
			Выборка = Новый Массив();
			Выборка.Добавить(ЭлементИсходногоСписка);
			РезультатСтруктура.Вставить(ЗначениеЭлементаИсходногоСписка, Выборка); 
		Иначе
			РезультатСтруктура[ЗначениеЭлементаИсходногоСписка].Добавить(ЭлементИсходногоСписка);
		КонецЕсли;	
	КонецЦикла;
	Возврат РезультатСтруктура;
КонецФункции

// Группировка если это массив
//
// Параметры:
// 	ГруппируемыйСписок - Структура - Группируемая структура
//  ПолеГруппировки - Строка - Поле для группировки
//
// Возвращаемое значение:
//  - Структура - Результат обсчета алгоритма
//
// Необходимости менять функцию нет
// BSLLS:NestedStatements-off
// BSLLS:CognitiveComplexity-off
Функция ГруппируемыйСписокМассив(ГруппируемыйСписок, ПолеГруппировки)
    ВсеВариантыЗначенийРеквизитов = Новый Массив();
    // Нахождения всех уникальных вариантов значений реквизитов
    Для Каждого ЭлементИсходногоСписка Из ГруппируемыйСписок Цикл
        ЗначенияРеквизитовТекущегоЭлемента = Новый Соответствие();    
        Для Каждого РеквизитГруппировки Из ПолеГруппировки Цикл
            ЗначениеЭлементаИсходногоСписка = ЭлементИсходногоСписка[РеквизитГруппировки];
            ЗначенияРеквизитовТекущегоЭлемента.Вставить(РеквизитГруппировки, ЗначениеЭлементаИсходногоСписка);
        КонецЦикла;     
        // Проверка на наличие такого варианта значений
        ВариантНайден = Ложь;
        Для Каждого ВариантЗначений Из ВсеВариантыЗначенийРеквизитов Цикл
            Совпадает = Истина;
            Для Каждого РеквизитГруппировки Из ПолеГруппировки Цикл
                Если ВариантЗначений.Получить(РеквизитГруппировки) <> ЗначенияРеквизитовТекущегоЭлемента.Получить(РеквизитГруппировки) Тогда
                    Совпадает = Ложь;
                    Прервать;
                КонецЕсли;
            КонецЦикла;
            Если Совпадает Тогда
                ВариантНайден = Истина;
                Прервать;
            КонецЕсли;
        КонецЦикла;   
        Если НЕ ВариантНайден Тогда
            ВсеВариантыЗначенийРеквизитов.Добавить(ЗначенияРеквизитовТекущегоЭлемента);
        КонецЕсли;
    КонецЦикла;
    // Группировка элементов по найденным вариантам
    РезультатСтруктура = Новый Соответствие();
    Для Каждого ЭлементИсходногоСписка Из ГруппируемыйСписок Цикл
        Для Каждого ВариантЗначений Из ВсеВариантыЗначенийРеквизитов Цикл
            Совпадает = Истина;
            Для Каждого РеквизитГруппировки Из ПолеГруппировки Цикл
                Если ЭлементИсходногоСписка[РеквизитГруппировки] <> ВариантЗначений.Получить(РеквизитГруппировки) Тогда
                    Совпадает = Ложь;
                    Прервать;
                КонецЕсли;
            КонецЦикла;    
            Если Совпадает Тогда
                Если РезультатСтруктура.Получить(ВариантЗначений) = Неопределено Тогда
                    Выборка = Новый Массив();
                    Выборка.Добавить(ЭлементИсходногоСписка);
                    РезультатСтруктура.Вставить(ВариантЗначений, Выборка); 
                Иначе
                    РезультатСтруктура[ВариантЗначений].Добавить(ЭлементИсходногоСписка);
                КонецЕсли;
            КонецЕсли;
        КонецЦикла;
    КонецЦикла;
    Возврат РезультатСтруктура;
КонецФункции
// BSLLS:CognitiveComplexity-on
// BSLLS:NestedStatements-on
