
Функция ПрогрессВыполнения(ДанныеПрогресса)
	ПрогрессЗнач = Новый Структура();
	ОбъектовВсего = get_prop(ДанныеПрогресса, "CountObjects", 0);
	ОбъектТекущий = get_prop(ДанныеПрогресса, "CountConfirmed", 0);
	ОбъектовСОшибкой = get_prop(ДанныеПрогресса, "CountErrors", 0);
	ОбъектовПроигнорировано = get_prop(ДанныеПрогресса, "CountIgnored", 0);
	
	ПрогрессВыполнения = 0;
	Если ОбъектовВсего > 0 Тогда
		ПрогрессВыполнения = Окр((ОбъектТекущий + ОбъектовСОшибкой) / ОбъектовВсего * 100, 0);
	КонецЕсли;
	
	ПрогрессЗнач.Вставить("Прогресс", ПрогрессВыполнения);
	ПрогрессЗнач.Вставить("ПрогрессОбъектов", ОбъектовВсего);
	ПрогрессЗнач.Вставить("ПрогрессТекущий", ОбъектТекущий);
	ПрогрессЗнач.Вставить("ПрогрессСОшибкой", ОбъектовСОшибкой);
	ПрогрессЗнач.Вставить("ПрогрессПроигнорировано", ОбъектовПроигнорировано);
	Возврат ПрогрессЗнач;
КонецФункции

